{
	"2192785861376214": "Both the translation and the comments are the responsibility of Wilbur N. Pickering, ThM PhD, ©, being based on his edition of the Greek New Testament, according to the only significant line of transmission, both ancient and independent, that has a demonstrable archetypal form in all 27 books. The Greek Text of which this is a translation, and articles explaining the preference, may be downloaded free from  www.prunch.org.",
	"7558168470537583": "Whose, the Father’s or the Son’s? Probably the Son’s, but in practice it makes little or no difference. Yes, the Text says “slaves”, so this book is not intended for the merely curious.",
	"05366557347606493": "The Text actually says, “with speed”. Since to God 1000 years = one day, it has only been two days!",
	"4470983840612308": "Any testimony of Jesus Christ is a word of God.",
	"35677480420172536": "Most, if not all, versions have ‘he saw’ (referring to John, not Jesus) and omit the rest of the verse. The manuscript evidence is seriously divided at this point. My translation reflects two of the three main independent lines of transmission, including the best one (as I see it). See 22:20, “He who testifies to these things says, ‘Yes, I am coming swiftly!’ Oh yes!! Come Lord Jesus!” The whole book is what Jesus Christ is testifying, is revealing; as an eye witness. So the whole book is inspired.",
	"4838460282162722": "John is evidently claiming divine inspiration for what he is writing. You won’t be blessed for reading or hearing a newspaper or a magazine. Notice that one person is reading (aloud) and a number of people are hearing, which was the norm in the congregations, since very few could afford to have a private copy of Scripture. Notice further that it is necessary to “keep” what is written.",
	"20970963258883968": "The sequence “from..., and from..., and from...” suggests three persons. The third, “Jesus Christ”, has to be the Son. “The seven-fold Spirit” would be the Holy Spirit. So “Him who is, was and is coming” must be the Father. Just over half of the Greek MSS add ‘God’ after the first “from” to make the connection overt (but the best line of transmission does not).",
	"9011239925889738": "Although the evidence is badly divided, I take it that the original reading is “the seven spirits which is”. A plural subject with a singular verb is anomalous, unless we understand “seven-fold Spirit which is”. If the Deity is three in one, why might not the Holy Spirit be seven in one? See Isaiah 11:2.",
	"22764319677793976": "When and how was He “the faithful witness”? Throughout His life on earth He was the faithful witness to the Father’s character, what the Father was doing (John 5:19), what the Father was saying (John 12:50). Here He is the faithful witness to what is going to happen.",
	"9836529105522611": "We have two readings here: one is clearly “from among the dead” while the other is ambiguous, meaning either “from among the dead” or ‘of the dead’. With the latter option, “firstborn” could have the derived meaning of ‘lord’ or ‘boss’. I take it that the better option is to follow the best line of transmission and read “from among”, in which case “firstborn” has its primary meaning. Death is pictured as a huge womb, pregnant with all the dead, and Jesus Christ was the first one out, literally the “firstborn”—but only the first! Because Jesus conquered death, we too may emerge from that ‘womb’. Thank you Lord!",
	"6579109343412985": "Satan has been demoted—see John 12:31.",
	"5559363834781534": "What was the function of a priest? A priest was a go-between, representing the people to God. I would say that intercessory prayer is a priestly function.",
	"020857469135895812": "The soldier who actually pierced His side on the cross, and the religious leaders who brought the situation about, are presumably in Hades. I take it that we are being told that the dead will also see Him when He returns to reign. The human spirit is indestructible, so those in Hades are very much ‘aware’ (Luke 16:22-31).",
	"7191215455983735": "That is how people used to talk—you may prefer ‘Yes, indeed!’ or ‘Even so, amen!’ The certainty that all tribes will beat their breasts is being emphasized.",
	"20366006963841765": "To be the first and the last you have to be the biggest, all the time.",
	"8952432243208404": "In verse 8 the Father speaks, putting His weight behind what is being written.",
	"015212023575100764": "“The tribulation and kingdom and endurance”—that there is only one definite article for the three nouns presumably indicates that the three are regarded as a single package. To participate in the Kingdom in this life involves tribulation and requires endurance.",
	"6537565569902957": "Presumably the witness that John gave about Jesus Christ. As in this verse, the human authors frequently alternated ‘Jesus Christ’ and ‘Christ Jesus’—so far as I can see, it was merely a stylistic devise to reduce repetition.",
	"4686272099483999": "There is no definite article with “spirit”, so to capitalize the word is arbitrary. It could refer to the Holy Spirit, but I think it more likely that it refers to John’s spiritual condition (see 4:2 below).",
	"2482926498801996": "It was at that point that he turned.",
	"4588273550064894": "The Lord Jesus referred to Himself as “the Son of the Man”, always with the two definite articles, but here there are no articles (in the Greek). John saw a human like form, very different from the Jesus he had known.",
	"4176991961572496": "Since the figure was clothed, the nipples would not be visible, so the point is presumably to give the position of the belt—across the middle of the chest. Since no further mention is made of the belt, in the letters, it is hard to know what purpose it served. But see 15:6 below.",
	"8420516445992674": "A low (or loud) roar that pervades the atmosphere—it is awesome, and you can’t get away from it.",
	"16453692106366713": "Comparing this with verse 14 it is evident that only the part of the head covered by the hair was white, the face (probably no beard) was like the sun.",
	"693859562212217": "But He had seven stars on that hand! Presumably the stars were on His open hand, so He rested the back of His hand on John. Since the seven stars represented the messengers of the seven churches, what might the symbolism be? Since the seven churches, taken together, represent the total Church (presumably), perhaps the glorified Christ is blessing John on behalf of the Church, so that he will be a blessing to that Church, in his turn.",
	"883198367578458": "Oh praise God! Satan used to have the keys, Hebrews 2:14, but now Jesus has them, because He did indeed vanquish the devil.",
	"12217888935745869": "In verse 8 the Father guarantees the veracity of the prophecy; here the Son, who conquered death and lives forevermore, does the guaranteeing.",
	"2630549616305895": "I take it that the precise form of the original Text here has the effect of affirming the certainty of the coming events. This verse is often taken as giving the outline of the book: “what you saw” = chapter 1; “things that are” = chapters 2-3; “things to come” = chapters 4-22.",
	"16073023776841833": "The Greek word  may mean messenger or angel (they are often messengers). Since 2:20 below says “your wife”, referring to the messenger, we should presumably understand ‘messenger’ here as referring to a man. It is possible that messengers from these churches were visiting John, on Patmos, or had visited him earlier.",
	"8814821196775149": "These letters have received a variety of ‘interpretations’. The basic meaning is obviously the literal one—these were actual churches at the time that John wrote, and each one was exactly as described in its letter. By way of application, these churches may also be taken as symbolic—at any given moment throughout the history of the Church local churches may be found to be similar in character to any one of these seven. It is also possible to see these seven churches as prophetic of the general course of the Church through time, and in that event we are presumably in the last or Laodicean age.",
	"23991542968220192": "Christ’s walking about in the midst of the churches is not an aimless meandering; He is observing and evaluating.",
	"9683939060440323": "Evidently it is possible to test the validity of someone’s claim to be an apostle—I wish we had been told how to do it.",
	"7808445570232727": "Ouch!",
	"6187214005072066": "They had not taken a sudden fall, they had drifted from their moorings, a process so gradual that it may go unnoticed for quite some time. It can happen to us too.",
	"25962979309956524": "In fact, Ephesus did lose its lampstand.",
	"2903147765706715": "We do not know for sure who or what they were. The etymology of the word suggests ‘laity conquerors’, perhaps the beginning of the system where the clergy dominates the laity. Once someone has a ‘guaranteed’ position their lifestyle often becomes licentious.",
	"09106766029624769": "That is right, just one ear. In other words, we had better pay attention!",
	"6158938493890962": "At this point it becomes very clear that God is giving a general application to these letters. The first one was written to a literal church in literal Ephesus, in literal terms, but  all  of us are to pay attention to the spiritual principles and lessons involved.",
	"9015467621559397": "So what happens if you don’t overcome??",
	"010739114107732872": "The Tree of Life is first mentioned in Genesis 3:22-24; it must have been transplanted out of the Garden of Eden before the Flood, unless it was a replica of the original in God’s Paradise. A considerable majority of the Greek manuscripts, including the best line of transmission, have “my” God. While walking this earth the Son repeatedly referred to the Father as ‘my God’.",
	"7766658851718193": "Here, and in 1:17 and 22:13, the glorified Christ calls Himself “the First and the Last”—comparing with Isaiah 44:6 we have one of several demonstrations that Jesus Christ is Jehovah [Mormons and JWs deny that He is Jehovah].",
	"5366695865746824": "You had better believe that there is a ‘synagogue of Satan’ near you! Why do you suppose that 1 Peter 5:8 says to “ be vigilant ”? In our day false Christians are more of a problem than false Jews.",
	"9608323850171492": "The Lord does not promise us a free ride, bed of roses, or whatever. Here they are given specific advance warning—bad times ahead. (Presumably the “days” are not solar.)",
	"7378728039361446": "So what happens if you don’t stay faithful? Note that the Lord does not register any complaint against Smyrna. If you are being persecuted for your faith it tends to keep you pretty close to the Lord. Also there is no incentive to pretend.",
	"1685932450127079": "Revelation 20:14 makes clear that “the second death” is the Lake of Fire. The first death is the physical one; the second is the spiritual one—eternal separation from the Creator, in whose image we are. Of course the redeemed go into eternal life, not death, so the “second death” holds no threat for them. But there is the little matter of ‘overcoming’.",
	"5035597189067647": "I find the double reference to Satan here to be curious. The opposition in the spirit realm would be especially strong.",
	"6614996973921266": "Why are fornication and adultery becoming more and more common in ‘Christian’ circles today? They come with idolatry—the church is riddled with humanism, relativism, materialism, spiritism, etc., false gods all. One wonders how many Christians today have a worldview that is strictly Biblical, without any admixture of the world’s values.",
	"9892015230169364": "Birds of a feather flock together; if you start sinning in one area, before long it is two.",
	"7581552923186599": "Notice that the pronoun changes—it is specifically against the Nicolaitans and Balaamites that He will fight.",
	"6624428159970153": "“From” is literal, maybe too literal; perhaps we should render “some of” the hidden manna.",
	"27608935835758674": "Our name identifies us to other people, so what good is a name that no one knows? Except that the giver knows, obviously. So maybe the private name has to do with a private relationship, between giver and receiver! Eating “hidden manna” also sounds sort of private.",
	"41625120743251665": "If anyone was still in doubt as to the identity of the One who is dictating these letters, the doubt stops here.",
	"8630272635036278": "Each of the seven letters begins with this phrase, ‘I know your works’. How we act reflects our world-view, what we really believe.",
	"27593152408725485": "Wow, here is a church that has it all—love, faith, service, endurance—and it is growing, doing more and more! Yes, well, but, then there is the rest of the story.",
	"47660164045537545": "About three fourths of the Greek manuscripts, including the best line of transmission, read “your wife” rather than ‘that woman’. The main group that reads ‘that woman’ reflects a tradition that is full of obvious corruptions, and so does not inspire confidence. The original reading is doubtless “your wife”. To have a wife the messenger must be a man, not an angel.",
	"05727233347690741": "The Lord uses an emphatic possessive pronoun here—she is messing with  His  slaves.",
	"5883251380868748": "Again, notice that fornication and idolatry go together.",
	"2896817046828295": "If someone refuses to repent they are beyond help; judgment has to come.",
	"9846973653942499": "Two thirds of the Greek manuscripts, including the most dependable group, have “her” works, not ‘their’ works. In verse 20 the Lord emphasized that they were His slaves. If the original reading is “her” works, as I believe, then what is involved here is spiritual adultery—she was not literally sleeping with a variety of men in the church. No matter how much love, faith and service there may be in a church, the Lord will not tolerate idolatry, which is spiritual adultery.",
	"8118297881201573": "Literally ‘kill by death’—so how else can you kill someone if not by death? Those who are familiar with the KJV will recall the phrase ‘let him die the death’, which in the context implies execution. I take it that “her children” does not refer to her literal sons and daughters, but to her ‘spiritual children’, those who have bought into her teaching and life style. The Lord wants to eradicate her ‘genes’, as it were. But why does God not kill Jezebel herself, instead of her children? I imagine that God uses evil people, like Jezebel, to put the rest of us to the test, to see whose side we really are on. Those who go along with a ‘Jezebel’ do not really want God.",
	"7674563462251811": "What we do, or do not do, not only makes a difference down here, but will also make a difference ‘up there’.",
	"22967937379701686": "“Known” implies experiential knowledge. Note that the Lord links Jezebel’s teaching directly to Satan, and those who are doing it are deeply involved with him (whether or not they fully understand the implications—if they are ‘deceived’ [v. 20] then they may indeed not understand).",
	"5376512882754656": "They were doing quite well, generally—see the second note with verse 19 above. So if they throw off Jezebel’s influence they will be all right.",
	"7715896947861116": "“Keeps my works until the end”—it is not enough to hold to the right doctrine; the Lord wants to see us reproducing His works (John 14:12). Notice that our participation in the administration of the Millennial Messianic Kingdom is at stake.",
	"28526669924509207": "The Lord is evidently referring to Psalms 2:7-9. In that event He is declaring that He is the “Son” in verse7 and that He did indeed ask for and receive the nations as an inheritance. If we are co-heirs (Romans 8:17) then we are involved in the outworking.",
	"4934427750238408": "In Revelation 22:16 the Lord declares Himself to be the “morning star”. In Isaiah 14:12 Satan is called “day- star, son of the morning”, but that was what he was before he fell. The planets Venus and Mercury are the ‘morning stars’ we see in the sky at dawn. But the Lord here says the morning star. I guess we will find out what He means when we get there.",
	"9642175744989581": "In 1:4 above “the seven Spirits“, which I rendered as “seven-fold Spirit”, has to do with the Holy Spirit. Here I think not—the Lord ‘has’ them like He has the seven stars. Perhaps the reference is to Isaiah 11:2.",
	"08459634682173078": "“That you were about to throw away” is the reading of about 2/3 of the Greek manuscripts, including the most dependable group, as opposed to ‘that were about to die’. They had probably already stopped believing in a variety of Biblical truths and were on the verge of dumping the rest, like the theological modernist or liberal of our day. Not surprisingly, they were short on works as well.",
	"25071953024436566": "See Luke 8:18.",
	"048844891141012425": "The Text is very clear—the glorified Christ said “erase”. You cannot erase something that is not there! To argue that Christ is using an impossibility as a threat is to accuse Him of using language deceitfully, a form of lying— not smart! By the grace of God my name is in the Book of Life, but what happens if I don’t overcome? In all seven letters our risen Lord places heavy emphasis upon our human responsibility. God will take care of His side; we had better take a careful look at our side.",
	"19046049053985747": "Comparing this statement with Jesus’ statement in Matthew 10:32-33, confessing is the opposite of denying. Since eternal destiny is at stake, the confessing/denying must involve what we are and do, not just our words. Confessing has to do with overcoming.",
	"5795698715093298": "The evidence is badly divided with reference to the wording of the last half of the verse. The translation given here reflects over half of the Greek manuscripts, including the most dependable group. We are accustomed to the more balanced form, but the basic point remains the same.",
	"023789959197843658": "I take it that this will happen here on earth—a pleasant prospect! Since they have been slandering us (at the very least, 2:9) this will be a welcome vindication. I imagine that at this point in history the “synagogue of Satan” includes people who claim to be Christians, but are not really. They may even be in positions of leadership (cf. Jeremiah 20:1-4).",
	"17823401612160938": "There has always been tribulation and testing here and there on the earth, but to include “the whole inhabited earth” the reference must be to the Great Tribulation. How can you be “kept from the hour” if you are in the middle of it? To be protected in the middle of a situation is not the same as being kept from it. This text would appear to point toward a pre-tribulation, or pre-wrath, rapture of the Church.",
	"22489842196601573": "Would the glorified Christ make an empty threat? So how does someone take our crown? How about if someone moves into a spot that you relinquished?",
	"4249477540001385": "That is three names.",
	"18358754117705445": "If the Lord vomits you out, where do you go? Something can only be vomited out if it is in.",
	"40497122671456864": "Sounds like ‘tough’ love. The Greek word is  , not  . See Hebrews 12:6.",
	"6191482010910199": "Although this text is widely used in evangelism, it is actually directed to Christians. The Lord is offering fellowship and communion to those who claim to belong to Him. Recall that the Father seeks those who will worship Him in spirit and truth (John 4:23). Many have the impression that God is hard to find or reach, but He disagrees: “You will seek me and find me, when you search for me with all your heart” (Jeremiah 29:13). The trouble is that few of us are willing to meet the condition. See also 2 Chronicles 15:2 and 16:9; also Acts 17:27.",
	"6176350539329474": "Evidently He both knocks and calls. In many cultures one calls out rather than knocks [there may not be any door, or the dogs may not let you get near it], and in the Apurinã culture (an indigenous people in the Amazon jungle, among whom I lived for several years) you call the person’s name.",
	"008167621497457755": "“Consider Him who endured such hostility from sinners against Himself, . . .” (Hebrews 12:3; see also verses 4- 11). He overcame, we must overcome—God is not offering a free ride.",
	"6279083196346613": "Comparing this statement with Ephesians 1:19-21 and 2:6, what is the picture? Since the Son is now literally “seated” at the Father’s right hand, this promise should be taken literally. But how about right now? I take it that we are supposed to be conducting ourselves on the basis of our position in Christ, on the basis of His victory and authority—maybe this has something to do with ‘overcoming’.",
	"7470218682668714": "This is a reference to 1:10 above, so it is the glorified Christ who is speaking—He is continuing His communicating (see 1:1), only now He is speaking from Heaven.",
	"2561540421760289": "“After these” opens and closes the verse. ‘These’ is a pronoun, so what is its antecedent? Presumably the churches described in chapters 2 and 3 (“the things that are” referred to in 1:19). Does “after” the churches imply that they are off the scene?",
	"476253931592173": "Compare 1:10. The Voice commanded him to “come up here”—it was something John had to do; I take it that his spirit was transported to heaven. (Consider Jesus—Matthew 17:25, John 1:48; Paul—1 Corinthians 5:3-4, Colossians 2:5; Elisha—2 Kings 5:26, 6:12.)",
	"8905615416383477": "The throne, not the One. 15% of the Greek manuscripts do have the One looking like a stone, but I judge that the 85% are correct.",
	"05020602087462289": "Why do we have “the” twenty-four elders the first time they are mentioned? I take it that John found them to be especially impressive or interesting (perhaps he identified with them).",
	"49595508521024123": "Might this picture have any connection with the promise in 3:21 above?",
	"08102826670824803": "There is no definite article with “seven spirits”. I doubt that they represent the Holy Spirit.",
	"6972508303806619": "The picture seems to be that the throne was not solid—the living beings moved in, through and around it; and they themselves were translucent—at least John could see that they had eyes inside as well as outside.",
	"1814406586919115": "Most of the Greek manuscripts have the elders in chorus with the living beings here, but the best line of transmission has just the living beings repeating ‘holy’ endlessly, which agrees with verse nine.",
	"9332204988952348": "The manuscript evidence is badly divided here, but I take it that two of the tree main lines of independent transmission, including the best one, have “holy” nine times, instead of three. Surely it is more likely that ‘nine’ would be changed to ‘three’ than vice versa. In fact, try reading “holy” nine times in a row out loud—it starts to get uncomfortable! Since in the context the living ones are repeating themselves endlessly, the ‘nine’ is both appropriate and effective. Three ‘holies’ for each member of the Trinity.",
	"021597664498548275": "‘O Lord’ as in KJV is found in a very few late manuscripts. Almost all Greek manuscripts have the words “Lord”, “God” and “our”, and some 2/3 of them (including the best group) have “the Holy One”.",
	"36100397059782074": "Again, how did John know that the scroll was written on both sides if it was closed? And where were the seals, all on the outside? It appears that the scroll also was not solid, or else John had laser vision.",
	"6195141950927325": "The Lamb is a Lion; the Lion is a Lamb. I would say that the Lamb characterizes Christ in His first advent to this earth, while the Lion characterizes His second advent.",
	"9951207355513532": "In about ¾ of the Greek manuscripts, including the best group, the gender of this relative pronoun agrees with “horns” (neuter) and not “eyes” (masculine). Perhaps the spirits were represented by both the horns and the eyes, possibly referring to power and knowledge.",
	"03489152786007499": "They all fell down, but I gather that it was the elders who had harps and bowls and sang the new song (the four are saying “Holy, holy” all the time).",
	"8108328761209753": "Every Greek manuscript except one, of inferior quality, reads “us”. Many modern versions follow that lone manuscript and omit the pronoun, but that leaves the transitive verb “redeem” without a direct object, so they usually supply “men” or some such thing. But the true reading is obviously “us”, so the 24 elders are among the redeemed, and they are already in heaven wearing crowns.",
	"6407844563804181": "A very few late Greek manuscripts read ‘us’, as in KJV, but almost all the manuscripts read “them”. The 24 elders exclude themselves when it comes to reigning on the earth—evidently they will not be involved in the administration of the Millennial Messianic Kingdom.",
	"8112127749222966": "10,000 x 10,000 = 100,000,000, so the good angels are over 100 million. If we understand correctly from Revelation 12:4 that a third of the original angels followed Lucifer in his rebellion, that means that there are some 50 million demons out there. Good grief!",
	"1978676457543096": "A list of seven; what else could we add?",
	"5900543068550907": "“Every creature” presumably must include more than men and angels; I take it that all mammals, at least (they have soul), including those in the sea (dolphins, whales), and quite possibly birds (eagles) will participate.",
	"2947534191299621": "The living beings and the elders were prostrating themselves and getting up repeatedly.",
	"3072637499644941": "The evidence is badly divided here, but I take it that two of the three main independent lines of transmission, including the best one, read as I have translated. The “Come!” was directed to the horse, not to John (since he was right there, there would be no need to address him with a thunderous roar). The same comment applies in verses 5 and 7.",
	"3612511648032122": "You had better believe that that was some horse!",
	"5610091120595815": "Over 80% of the Greek manuscripts do not have “and see”, as in KJV. Each of the living beings called out a horse, saying to it, “Come!”",
	"5542341047376309": "A denarius was the daily wage for manual labor. To work a full day for a quart of wheat means bare survival.",
	"9221316841128686": "Perhaps the oil and wine are spared for their medicinal value.",
	"6372986781614112": "The Text does not say that Hades was on a horse. John is stating a fact of human existence: Hades follows death—so it has been for 6,000 years.",
	"8499225533249402": "Less than 30% of the Greek manuscripts read ‘them’ for “him”, but they are followed by most (if not all) versions in English. However, it is Death that does the killing; Hades just collects the dead. The 70% are doubtless correct (involving two of the three main independent lines of transmission, including the best one).",
	"8414156589954607": "‘The four horsemen of the Apocalypse’ have received quite a bit of press, off and on, but they are just the opening gambit. The really heavy stuff comes later.",
	"5692876689275077": "These “souls” have evidently not yet been reunited with their bodies, which means that they have not participated in any resurrection, including the Rapture (see 3:10, 4:1 and 5:9). See notes at 7:13-14. “Of the people” excludes animals, that also have souls.",
	"3063017806958921": "“Slaves” and “brothers” evidently refer to two distinct categories of people, but I don’t know the explanation (unless ‘slaves’ refers to Israel, see 7:3 below and Galatians 4:25, in which case ‘brothers’ would refer to the Church).",
	"7733643011715658": "I suppose this refers to fallen angels, since a single literal star would obliterate our planet.",
	"9420092681525356": "Now it starts to get heavy! I have never been in a serious earthquake, but a former colleague was, and the trauma was so severe that years later he still had trouble talking about it.",
	"12033211408511857": "The wrath of God is a great leveler; the social classes all of a sudden do not make much difference—they are all trying to hide.",
	"49570389789715974": "Note that it is the Lamb’s wrath—those who reject His sacrifice can look for wrath. Notice that there is no hint of repentance from the people.",
	"31692779711821295": "He saw the content of chapter seven after he saw the content of chapter six, but the events described are not necessarily in chronological order. It should not be assumed that nothing else happened between the seals, or even at the same time. However, the seals are broken in sequence.",
	"514013968803162": "The Text says “the four corners” and “the four winds”. Presumably from John’s perspective the earth would look like a sphere (or a circle)—so perhaps the angels were strategically placed so as to control the whole planet. There are four basic wind patterns that influence most of the world—the north and south ‘trade winds’ and the north and south ‘prevailing westerlies’.",
	"973966742796581": "“Joseph” stands for Ephraim. Since Levi is counted here (usually he isn’t) and Joseph has two tribes, Manasseh and Ephraim, someone has to be dropped—Dan. From both Jacob (Genesis 49:16-17) and Moses (Deuteronomy 33:22) he got the least impressive ‘blessing’.",
	"6919265792315836": "Linguistically speaking, in terms of the norms of language, a phrase like “the tribe of Asher” can only have one meaning, precisely the meaning that it has everywhere else in the Bible. Ezekiel chapter 37 makes very clear that ‘the ten lost tribes’ are not lost at all—God knows exactly who and where they are, and at the right moment they will be restored.",
	"5799465025463897": "I take it that we should refer back to the fifth seal, 6:11—in that event those martyrs were also killed during the Great Tribulation, just earlier on. Perhaps at this point (7:13) the pre-determined number of martyrs is now complete (in 6:11 it was not).",
	"08232461575706473": "John understands that the elder is offering information and tells him to go ahead.",
	"21848553231120982": "Assuming a pre-Abomination-of-Desolation rapture of the Church (because of the surprise factor, but see the note at 2 Thessalonians 2:2), I take it that multiplied millions of church members will be left behind—they knew the Gospel but were never really regenerated. When they see that they have been left behind they will fall on their faces before God saying: “Oh Lord, have mercy; if I never believed before I do now!” There will be many millions of conversions in the first hours after the Rapture. People were saved in the OT without the indwelling Holy Spirit, and they will be too. But they will have to face the Beast and most of them will be martyred. Notice that they say, “Saved by our God . . . , and by the Lamb.” Apparently there is a sovereign act of God (the Father) involved here, with the blood of the Lamb as the basis.",
	"6968973850984514": "How does one “serve” in this sanctuary? I suppose by worship and praise.",
	"20313186343674627": "That is what the Text says, “waters”, plural. Might there be different kinds of water, or just different sources?",
	"7017182394127048": "To do this, will He also remove the memories that bring the tears?",
	"6089129916052207": "A ‘deafening’ silence! I wonder why. Well, there has been a lot of noise up to this point, and there will be plenty more later, so the silence acts as an emphasis by contrast. The outpouring of wrath will now build to a crescendo.",
	"7756650314291424": "One gains the clear impression that the seven trumpets form the content of the seventh seal. fifth ",
	"2553223788507535": "See Hebrews 8:5.",
	"3690983180098666": "That is what the Text says. Just as food for thought, I would suggest that God is Spirit and has soul; a human is soul and has spirit; an angel is spirit with no soul; an animal is soul with no spirit; insects and lower forms have neither. I imagine that the reference here is to mammals in the sea (like dolphins).",
	"21942701081560512": "If the springs are hit, does that include the aquifers that supply their water? If so, a third of the sweet water on the earth is ruined.",
	"06032768886375961": "Over 2/3 of the Greek manuscripts, including the best group, read “eagle” rather than ‘angel’. Since the fourth living being is similar to a flying eagle, the idea here is not new.",
	"517267608952934": "Presumably an angel, and of considerable rank.",
	"8451767720955259": "The Greek word appears to be composed of two morphemes, “no-depth”. Since it is a shaft or pit we presumably should understand no known or measured depth, hence ‘bottomless’. Literally, “the shaft of the no-bottom”; the familiar ‘bottomless pit’ is not a bad rendering. Since the word “abyss” occurs elsewhere without the “shaft/pit” (see verse 11, also Luke 8:31) I prefer to take it as a proper name.",
	"5871309339219082": "It will not be a good time to be on the earth!",
	"21875783367224": "Evidently these are not the literal insect, but the insect came in clouds (millions of them) and was a terrible plague. Since they are lead by a high-ranking demon (as I suppose), they are probably demons. I associate Luke 8:31 with this passage—although the Lord evidently did not send those demons to the Abyss, that they kept begging Him not to shows that it was a very real possibility in their ‘minds’; they knew something that we don’t. I take it that the Lord did not send them to the Abyss at that point because He had not won the victory yet—Satan was still the god of this world and the demons were doing their thing under Satan’s authority. But now we are to act on the basis of that victory, on the basis of our position and authority in Christ (Ephesians 2:6). So how did all those demons get into the Abyss to be available for the fifth trumpet? They got there because we sent them there! I would say that sending demons to the Abyss is one of the ‘greater’ things that the Lord Jesus said we would do (John 14:12).",
	"650861625083927": "And in English, Destroyer. “Angel” covers both good and bad—this one sounds like a boss demon.",
	"28874765508000455": "I find it to be curious that this voice comes from the altar [and why did the altars have horns?], which is usually associated with obtaining God’s mercy. But in this case the altar participates in the judgment.",
	"89823314508763": "Some ¾ of the Greek manuscripts, including the best group, do not have ‘two’. John was given the number.",
	"9153533655636366": "Dear me! And I thought the ‘locusts’ were bad! Notice that it is the “horses” that do the killing, not the riders. I understand that China has over one hundred million armed militia, right now, but presumably not these ‘horses’. Just as in the case of the ‘locusts’, I take it that we are looking at supernatural activity here. The population of the world is reduced by one third.",
	"7839808507913215": "Notice that the idols are linked to demons. Even though an image of wood presumably has no power in itself, a demon associated with it can do all sorts of damage.",
	"5035812418772894": "They were totally self-centered, and therefore totally evil, malignant, under demonic control; carbon copies of the devil. They are prepared to kill, steal and use witchcraft to gain their ends, with a total disregard for others. They want sexual gratification without responsibility. No matter what God does they will not repent; they are beyond fixing. I am glad I won’t be there. Oops, wait a minute! Don’t an awful lot of people in the world today (especially in Europe and North America) already answer to this description? They have been brought up on evolutionistic, relativistic humanism; they have been taught that they are gods, to ‘do your own thing’. Hey, if we are not already there I reckon we are well on the way! A recent study found that most young people in America today are narcissists.",
	"07821925566273191": "John is evidently back on earth at this point.",
	"7520442835991821": "That is what the Text says, “the” rainbow; our rainbows are caused by the sun shining through rain, which was not the case here—perhaps God has a prototype.",
	"8015124636920894": "Does the description remind you of anyone?",
	"6161266017117686": "That is what the Text says, the seven thunders, and each had a voice and could speak intelligible words. Obviously these “thunders” exist quite apart from climactic conditions on earth. Interesting! (I suspect that what we don’t know exceeds what we think we do know, and by a considerable margin.)",
	"5429600759069644": "The evidence is divided here, but I take it that two of the three main independent lines of transmission, including the best group, have “You write after these things” rather than ‘do not write them’. This text has been generally misunderstood since the beginning. Having been told to seal what the thunders uttered, why would John be told he would write it later? So many copyists altered the text, reinforcing the prohibition. However, I take it that the voice was giving two unrelated instructions: not to record the thunders; and to put his notebook aside until later—he is going to be busy interacting with the angel and eating a book, and the voice does not want him to be distracted by trying to write at the same time.",
	"3993362810058789": "“The days”—the events associated with a given trumpet (and probably seal and bowl) cover a period of time; they are not instantaneous.",
	"3271909915176394": "The action in verses 9-11 is presumably symbolic, but of what? Like why was the little book open, and why the stomach ache, etc.? I imagine that the book contained the prophecy mentioned by the angel, and being open would indicate that the prophecy was to be understandable. The book inside John suggests inspiration to me, and the terms of the prophecy would be mainly bitter.",
	"7928369193752574": "I get the impression that the angel shifted position, probably with both feet on land—his legs had been spread or straddled, now he stands normally.",
	"3735147758073587": "Comparing forty-two months with 1,260 days we get 30-day months. A year computed on the basis of these ‘prophetic’ months, as they are sometimes called, is five days shorter than a calendar year. Forty-two calendar months would give 1,277/8 days. years doesn’t sound like much fun.",
	"5082142784328509": "Presumably the angel is still speaking—might He be God the Son? Could a mere angel say “my two witnesses”?",
	"2011629275949749": "Note that their ‘ministry’ covers 3½ years; the Text does not actually say that it will be simultaneous with the trampling of the holy city, but I imagine that it will come close. When I see the perversity in the world I am sometimes tempted to wish I could do what they are going to do, until I get to the ‘sackcloth’—walking around in sackcloth for 3",
	"5627513070831529": "See Zechariah 4:3,14.",
	"12102445926649397": "They have the authority to do these things, but it is discretionary; it is up to them to decide when, where, and how much.",
	"6200307834107661": "This would seem to confirm that the “locusts” and their king, in chapter nine, are on Satan’s side. That is also where Satan will be confined during the Millennium (20:3). If this beast is not Abbaddon he is presumably another high ranking demon, or so I thought until I got to 13:1 and 17:8, which see.",
	"7389403865122373": "Over 99% of the Greek manuscripts have “their” Lord, not ‘our’ as in KJV and NKJV. If these two “olive trees” are the ones in Zechariah 4:3 and 14, then the “L ORD  of the whole earth” there is Jehovah the Son.",
	"37105324743908064": "We might expect “Sodom and Egypt” to apply to Rome, rather than Jerusalem, but the Lord was crucified in Jerusalem.",
	"21398134737898467": "People in past generations had trouble imagining how this could happen, but with modern technology people around the world will watch those corpses.",
	"8306319697593176": "They will celebrate, but not for long!",
	"640388255243507": "At least they are no longer pretending that God does not exist.",
	"2507225967759501": "“Slaves” and “saints”—again we seem to have two distinct categories.",
	"6499016258174528": "One gets the impression that the elders had been waiting for this day. I think I know how they feel—the destruction of “those who have corrupted the earth” cannot come too soon to suit me.",
	"6380165525290362": "Presumably this is the original ark of which the one made under Moses’ supervision was a copy (Hebrews 8:5, Exodus 25:9, 40, Hebrews 9:23).",
	"7765759781681496": "If this were all there was to the seventh trumpet it would be anticlimactic, ‘small potatoes’. I take it that the seven ‘bowls’ (see chapter 16) give the full content of the third woe.",
	"6912660025066499": "Just as Michael is the boss-angel in charge of Israel, as a nation (Dan. 10:21, 12:1), presumably each tribe has its own boss-angel (lower in rank than Michael). Assuming that the woman represents Israel, I imagine that these ‘stars’ are the tribal angels (because of the number twelve).",
	"9045705806293447": "It is generally understood that this refers to those angels who joined Lucifer in his rebellion—note that verse 7 refers to the dragon and his angels. If the 2/3 are over 100 million (5:11) then this 1/3 must be over 50 million—more than enough trouble to go around.",
	"06469754445144704": "That is what the Text says. Since “Son” is obviously masculine, adding “a male” emphasizes the gender. What the first man lost the second Man (1 Corinthians 15:47) recovered; the first man allowed his wife to lead, the second Man will rule with a rod of iron.",
	"23607561542512134": "Here the Child is clearly identified as the Messiah—since He was born some 2,000 years ago we are obviously looking at an historical parenthesis. The rebellion of Lucifer and his angels goes back at least 6,000 years. We do not normally associate ‘shepherd’ with ‘a rod of iron’—the Millennial Messianic Kingdom will be a benevolent dictatorship.",
	"6719052204332321": "Verses 1-5 are historical, but verse 6 brings us back to the Great Tribulation. The narrative is interrupted to give us some background.",
	"6429581564549343": "The dragon knew that Michael had received the order, so he decided to get in the first blow.",
	"6564584142902314": "“Into the earth”, including its atmosphere. The idea seems to be that at this point Satan is confined to this planet. From the content of the following verses I take it that Satan’s expulsion occurs in the middle of the seven-year period. So he is still in heaven accusing us (accusing us of what? There would be no point in bringing false accusations, so we must be providing Satan with ‘ammunition’—not a nice thought!).",
	"48969059813895544": "Wait a minute! If it is only “Now”, where have the Kingdom and Authority been in the meantime? As long as a government is being challenged, its rule is not complete or tranquil. I find it instructive that Satan still has sufficient power to wage war, in Heaven!",
	"4677694303662254": "“Our brothers”—I wonder who is speaking, since the ‘brothers’ are saved by the blood of the lamb.",
	"6922648369793238": "That is what the Text says. Comparing 6:11 and 7:13, perhaps it is necessary for a certain number of God’s servants to be willing to die for the Cause to bring about the accuser’s expulsion.",
	"35996049175439015": "It is the inhabitants that do the rejoicing, not the place.",
	"4187754702084703": "Only two very late Greek manuscripts add “Christ”, as in KJV and NKJV. Over 99% do not. The dragon will persecute Jews in general and Christians in particular.",
	"5472045552917588": "Less than 10% of the Greek manuscripts have ‘he’ (presumably referring to the dragon). The difference is between  (I stood) and ECTA H (he stood)—it would be easy to drop off the final N, especially since it is similar to H (more so in handwriting).",
	"06509974031052246": "I am not sure that this beast is the same as the one in 11:7—they are said to come from different places (but see 17:8).",
	"41485537293642283": "There is a family resemblance—seven heads, ten horns; might the Beast be the son of the Dragon? (Imitating God is Satan’s ‘thing’.)",
	"776034690233516": "I take it that here and in verse 7 it is God who does the giving—this is part of the Plan.",
	"8528927102849975": "Compare 1 Corinthians 3:16. We are the ‘temple’ of God; those who dwell in Heaven are His tabernacle.",
	"9351579108278081": "1 Peter 1:20 makes clear that it was actually before the foundation of the world. God knew what was going to happen before He created the human race, the terrible price He would have to pay, but He went ahead anyway.",
	"29508795188256154": "Two of the three main independent lines of transmission (including the best one) so read. The third line reads, ‘If anyone goes away into captivity . . .’—the second half of the conditional clause (the apodosis) is missing. The rendering of KJV and NKJV reflects a very few late manuscripts. But what does the Text mean? Anyone who has been appointed to captivity will certainly be taken away.",
	"25485111727451426": "I confess that this sentence puzzles me. Well, if I believe that my God is Sovereign over all, that He knows what He is doing, and that He has my ultimate wellbeing in view (Romans 8:28), then I will endure in faith.",
	"7343371639110328": "“My own  people ”—two of the three main independent lines of transmission (including the best one) so read. Since John is speaking (writing), his physical people would be the Jews, while his spiritual people would be the Christians. The use of “own” points toward the physical, which accords with the information given elsewhere (Daniel 9:27) that Israel makes a deal with the Beast.",
	"8287374449612122": "Worship an image or be killed—how humiliating! It sounds like a re-run of Daniel 3.",
	"3301651178001699": "I find this verse difficult to translate. The main verb has two basic meanings: ‘to calculate’ and ‘to vote’. Since the number is immediately provided, what is there to calculate? In the context, any wise person will vote against the number, that is, refuse to receive it, but the idea of ‘against’ is not stated. The number itself is represented by three letters (in Greek), the middle one looking rather like a snake. (Some versions write out the number, but since it has to fit on forehead or hand, just the three letters seems more likely.) Note that the number is 600 plus 60 plus 6, not 6 plus 6 plus 6.",
	"6499931536858983": "Is this group different than the one in chapter 7?",
	"6031440827856633": "Only 2% of the Greek manuscripts do not have “His name and” (as in KJV and NKJV), so they had two names written, the Father’s and the Son’s—much better than having the name of the Beast!",
	"33784050003881294": "Evidently John is finding it difficult to describe exactly what he heard, doubtless different from the normal sounds of this earth.",
	"7443233714661663": "All the pronouns are masculine, so these are male virgins.",
	"6587910951376479": "Two of the three main lines of independent transmission (including the best one) read “by Jesus”.",
	"5142809913185289": "Why “firstfruits”? Before the advent of refrigeration, food could be preserved by drying, smoking, salting, etc., but by the time of the next harvest, nothing would compare with a firstfruit, which would be something special. Those men were special!",
	"6194968544172619": "These are remarkable men! KJV and NKJV add “before the throne of God”, following the TR which is here based on only two very late manuscripts.",
	"20614572173186452": "Of all the people who have ever lived on this earth, what percentage of them ever heard that Jesus died for them? Romans 1:18-21 gives the essence of God’s requirement: the evidence of creation demands a Creator, and He expects people to acknowledge Him and try to please Him.",
	"9041722141570994": "As fresh, pure water becomes more and more scarce, the springs of water will become increasingly important.",
	"5154524376308998": "Why “rage”? Her fornication was violent and compulsive, also insatiable.",
	"11933571129396148": "To actually serve as a warning, this would have to be contemporary with 13:16.",
	"4746825561804211": "Believe me, you do not want to submit to the Beast in any way! Don’t let anyone put anything on your right hand or on your forehead. Better to be executed. I do not doubt that the Beast is already alive on the earth, with age and preparation sufficient to take center stage at any moment.",
	"013370565276337176": "I would say that the two “here”s are cataphoric, referring forward to the content of verse 13.",
	"49878562078094624": "That is roughly 180 miles! If some four billion people will be killed during the seven-year period [mostly the second half of it] (as I calculate, a low estimate) and we allow an average of one gallon of blood per person, that is four billion gallons of blood—which would make quite a river! If the “winepress of God’s terrible fury” described here represents sort of a summary of the blood shed during the Great Tribulation period, then the picture is not far fetched. Of course a winepress has a single outlet and the liquid is conveyed to the receptacle by a conduit of appropriate size. In this case the conduit is 180 miles long and the flow is about four feet (1.33 yards) deep—four billion gallons equals about 20 million cubic yards; 180 miles equals about 320 thousand linear yards; so we have about 62.5 cubic yards of blood per linear yard of conduit—so the conduit is about 45 yards wide. My purpose in conducting this exercise is simply to show that the description of the “winepress of God’s terrible fury” is not at all ridiculous—it is a graphic but factual picture of the coming bloodbath.",
	"8939702049790039": "I take it that this is a generic cover statement, referring to the detailed description that follows. I further take it that these ‘bowl’ plagues relate to the seventh trumpet (11:15) and make up the third ‘woe’ (11:14).",
	"9919859884547855": "These people were martyred by order of the Beast, so how did they ‘prevail’ over him? By refusing to bow to him they escaped from hell (14:11); they died physically but won spiritually (but see 12:11).",
	"7058996397499537": "KJV and NKJV read ‘saints’ instead of “nations”, following the TR which is here based on only two very late manuscripts.",
	"34091026999269247": "The best line of transmission has “heaven”, all the rest having the expected ‘sanctuary’. At first glance the context seems to call for ‘sanctuary’; so much so that if ‘heaven’ were original some might have omitted while others made the obvious change—if ‘sanctuary’ were original, why would anyone omit or change? On the other hand, there are at least three heavens, 2 Corinthians 12:2, and they may have come out of the third, into the second. This is the only mention of the tabernacle of the testimony in Revelation, so the throne of God was not there and none of the action related by John up to this point took place there—there have been several references to the temple, with angels coming out of it, but I doubt that temple and tabernacle are to be equated.",
	"5820815763923453": "Just like the glorified Christ (1:13). Perhaps a belt around the chest was like ‘war paint’, part of getting ready to fight.",
	"1363878336211617": "Even now a chip the size of a grain of rice is being planted under the skin of volunteers. The battery contains a substance that, if it leaks out of the chip, will produce “a foul and malignant ulcer”. Notice that ‘ulcer’ is singular, one per person, precisely those who have the ‘mark’. A word to the wise . . . .",
	"3382185341995727": "The resulting stench would qualify as a plague of reasonable severity.",
	"25309026574952487": "That is right. Where are people going to find water to drink, let alone for washing, etc.?",
	"45274549588278457": "They are no longer pretending that God does not exist, but they refuse to submit to Him, so they have no excuse.",
	"4169060196447598": "Apparently this is a different kind of darkness, evidently quite painful.",
	"3540055025615876": "So what might the “clothes” be? Presumably these are spiritual clothes, perhaps having to do with our walk with God, maintaining our personal sanctity or holiness, ‘without which no one will see the Lord’. “Watch” and “guard” are up to us—watch out for and guard against the world’s values.",
	"4183787669660193": "Verse 15 is an interjection from the glorified Christ.",
	"5338195063456623": "Such a monstrous earthquake will doubtless produce monstrous tsunamis which could well inundate many coastal cities—between the earth and the water the destruction will be massive.",
	"24393258929274886": "That would be around 90 pounds each (a Roman talent = 93.75 pounds). The surviving people are ‘punch- drunk’ by now, but the hailstones are so incredible that they provoke another round of blasphemy. Such hailstones can destroy any normal dwelling.",
	"892739512397587": "In Hebrew usage a ‘son’ of something was characterized by that something. So a ‘father’ of that something would be even more so. So when James calls God “the Father of lights” (1:17) that means that “God is light and in Him is no darkness at all” (1 John 1:5)—He is totally light. In John 8:44 the Lord Jesus says that Satan is the father of the lie, and that “there is no truth in him”—he is totally falsehood (I conclude that it is impossible for Satan to tell the undistorted truth). Here we have “the mother of prostitutes and abominations”—she is totally perverted, evil (it is impossible for her to do anything pure, clean or really good). So whom or what does the whore represent? If the kings are fornicating with her they are not trying to please God, so perhaps she is organized religion (including dead Christianity, of whatever kind). In that event organized religion is incapable of doing anything pure, clean or really good.",
	"0032451617331625826": "Well, the origin matches 11:7 but the description matches 13:1, so maybe the three passages refer to a single personage. If “sea” refers to human origin and “Abyss” to demonic, could it be that Satan will imitate God in producing the Antichrist?",
	"9776271730375135": "Here is a strong statement of election or predestination—how else could God know what names to put in the Book? At the same time the seven letters (chaps. 2 & 3) are strong on human responsibility (including the possibility of a name being erased). Divine sovereignty and human responsibility walk side by side throughout the Bible.",
	"8858487679031015": "Compare verse 13—God is in ultimate control; His Word and purpose will be fulfilled.",
	"5610898173219538": "In chapter 21 the Bride of Christ is represented by a city, the New Jerusalem, but the Bride is presumably people from around the earth. Likewise the whore, represented by a city, may well involve people from around the earth. “Is the great city”—when John wrote, Rome was the ruling city.",
	"6317971807163487": "Could an angel say “my” people? This may be God Himself speaking. But just how can one ‘come out’ of Babylon?—by rejecting all that she represents.",
	"8439774179339934": "What God has remembered about her is her iniquities.",
	"9483123100448563": "Evidently it is “my people” who are supposed to be doing this. First we must disassociate ourselves from the whore, but then we are to participate in her punishment, “double”. Only it does not say how the paying back works, and I, for one, would like to know.",
	"13196217680535338": "None of her lovers charge to the rescue; they stay well clear of the action! They enjoyed the whore, but . . . . (Actually, why do men go to prostitutes? They want sex without commitment.)",
	"06076167554341061": "An unidentified speaker interjects a cheerful note. It may be that “the fruit that your soul craved” had to do with the “bodies and souls of men”.",
	"10019847321838737": "I guess we should not expect the merchants to be braver than the kings, now should we?",
	"3114502760951301": "Perhaps this should be connected to verses 6-7, above. In that event, the judgment was pronounced in faith.",
	"2315781234165093": "The whore uses sorcery, and kills God’s prophets and saints. The Lord Jesus said that the “Jerusalem” of His day killed God’s prophets, so the whore has been around for quite a while.",
	"9978006412029583": "The whore’s eternal punishment is a cause for praise to God.",
	"9775227052965321": "Presumably the speaker is the angel of 17:1.",
	"33283658493920765": "It surprises me that an angel could or would call himself “your brother”. I don’t know what to make of it, unless this was really a human being that looked like an angel. Since the Bible records angels appearing in human form, I suppose a glorified human could appear in angelic form. Why not?",
	"1119870833071428": "I don’t understand this statement either, unless it is Jesus who is testifying to the prophets, giving them their messages.",
	"6493733374505137": "Well over half of the Greek manuscripts, two of the three main independent lines of transmission (including the best one) read “having names written”—presumably these names were on the diadems. I would imagine that each diadem had a name.",
	"972203783504485": "The Lord Jesus Christ paid the price for our sins all by Himself (Hebrews 1:3), and here He treads “the winepress of the fury of the wrath” all by Himself. Those who think of the Lord only in terms of ‘loving, meek, mild’ need to understand that there is a whole lot more to the story. Those who reject His sacrifice can look for “the fury of the wrath”—none of us can understand how terrible was the price the Son had to pay, and He will not take kindly to having that price despised!",
	"09886492870751984": "It is mainly birds of prey and scavengers that fly high in the sky; songbirds and game birds usually stay fairly close to the ground (except when migrating).",
	"13236773042051464": "Apparently these are the first two residents in the Lake, and they will have it all to themselves for a full one thousand years!",
	"6508649211936128": "If the Captain did all the killing, then His followers were just along for the ride. Evidently all the Captain had to do was speak.",
	"7806575590441585": "The birds will eat all they can, but there will presumably be plenty of flesh left over. Ezekiel 39:12 says it will take seven months to cleanse the land of all the remains!",
	"5480336734122926": "Well over half of the Greek manuscripts, two of the three main independent lines of transmission (including the best one), contain this clause. Since both the TR and the so-called critical text omit it, most versions do not include it.",
	"8852032300324222": "If language has any verifiable meaning at all, this passage is obviously talking about a literal period of one thousand years.",
	"24189154280179048": "What cultures in our day practice beheading?",
	"3463060826467319": "Verse six makes clear that this part of verse 5 is parenthetical. It is participants in the first resurrection who will reign the thousand years; so that first resurrection must happen at the beginning of the thousand years, not the end; so “the rest of the dead” are the lost who will participate in the resurrection unto condemnation (call it the second resurrection), after the Millennium. Superficial readings of this passage have given rise to all sorts of confusion.",
	"9827176159734525": "During the Millennium there will be a population explosion. Since the government will be dictatorial, everyone will have to obey outwardly, but Satan will have no trouble raising an army of ‘dissidents’.",
	"09107250428437785": "The picture here is different from the battle of Armageddon—compare 19:21.",
	"6244206756667823": "Doubtless the Face was full of wrath—at that point there will be absolutely no place to hide.",
	"2957322878293218": "Less than 10% of the Greek manuscripts read ‘God’ instead of “throne”, as in AV and NKJV.",
	"09159949619315455": "I confess that I don’t understand this; how can Death be holding dead that are not in Hades? Perhaps they are regarded as partners. But then, how can the ocean have a separate roster of dead?",
	"7178711471911443": "Twice it says that they will be judged on the basis of their works. So how can you really evaluate someone’s deeds? Only by taking account of their context. Those who never heard the Gospel will be judged within the context that they lived, and the Judge will prove that even within their own context they did not measure up.",
	"81427915807": "The first death is the physical one; the second is the spiritual one—eternal separation from the Creator (the essence of death is separation). Death and Hades are treated as if they were living entities.",
	"2881106051910758": "That is right; since no one can be saved by their works, the only way out is the Book of Life!",
	"1356626120766693": "“The first earth”, not the second, or whatever. This statement would seem to go against the ‘gap’ theory in Genesis 1:1.",
	"4029427243725274": "Apparently there will be no water in the new earth; I take it that our glorified bodies will require neither food nor drink (so there will be no body waste to dispose of).",
	"43499126361895213": "Without the separation of death, without pain and sorrow, there will be no occasion for tears.",
	"8262084506631395": "Since the last throne mentioned is the Great White Throne, and since all judgment has been committed to the Son (John 5:22), I conclude that the speaker is Jehovah the Son.",
	"34847196335734165": "“These word s  are true and faithful”—the guarantee extends to the individual words. If a word is true, then it cannot be false; if a word is faithful, then it cannot be designed to deceive us. Conclusion: the words of this book are to be taken at face value, according to the norms of language.",
	"3813919606841243": "“I have become”—this seems awkward, so a small minority of the Greek manuscripts changed it to the familiar ‘It is done’. But in order to be the Boss at both the beginning and the end, you have to be the greatest, and survive all challenges. All human history has been involved in Satan’s challenge of that supremacy. Because of that challenge, and because only at this point has that challenge been definitively put down, Jehovah the Son says, “I have become”.",
	"02906978291503548": "Does it surprise you that “cowardly” is in this list? In Matthew 10:32-33 we read: “Everyone who will confess me before men, I will also confess him before my father who is in the heavens. But whoever should deny me before men, I will also deny him before my Father who is in the heavens.” See also Luke 12:8-9 and 1 John 2:23. Presumably the Lord is referring to our attitude in the face of opposition or persecution. Anyone who caves in under pressure and disowns the Lord is out.",
	"7403068654717044": "Both the TR and the so-called critical text omit “and sinners”, so most versions do as well, but two of the three main independent lines of transmission (including the best one) have the phrase.",
	"35556421693472506": "That is what the Text says; instead of the noun ‘liar’ we find the adjective “false” (all the preceding descriptions are nouns, with one participle = “abominable”).",
	"23458917470296048": "Actually the Text has “and”—John saw the visions in this order, but they will not necessarily happen in this order. I imagine that the New Jerusalem belongs to the Millennium (for reasons I will give below).",
	"8459514439870857": "It seems to me to be unarguable that both Israel (the gates) and the Church (the foundations) participate in the New Jerusalem. (In fact, I imagine that the redeemed of all ages, up to the beginning of the Millennium, will be involved.) The rendering, “the woman [or, wife], the Lamb’s bride”, is based on over half of the Greek manuscripts, two of the three main independent lines of transmission (including the best one). In Jeremiah 3:20 and Hosea 2 Israel is presented as the wife of Jehovah—but in the O.T. wherever God interacts directly with the human race it is always Jehovah the Son. Passages like Matthew 25:10, John 3:29, 2 Corinthians 11:2 and Ephesians 5:25-27, 31-32 point to the Church as the bride of Christ (who is Jehovah the Son). So here the two come together—the wife, the bride—but maintain a distinct identity (gates are one thing and foundations are another)—indeed, nowhere does the Bible ever confuse Israel and the Church (not even in Galatians 6:16, as I can demonstrate to anyone who wishes to pursue the matter). But if the Church is still a “bride”, then the wedding has not happened yet, which is my first reason for placing this scene at the beginning of the Millennium.",
	"0031041384677545913": "I wonder, who replaces the Iscariot? Besides the Twelve, the only one who was personally chosen by Jesus was Saul of Tarsus.",
	"8414781462361078": "The evidence is badly divided here, but I take it that two of the three main independent lines of transmission (including the best one), do not add “and her wall”, which is read by most versions since both the TR and the so-called critical text so read. Two thousand years ago a city wall was a barrier to protect the city from attack, but the following context here makes clear that the wall was part of the structure. The city is a cube, like a modern high-rise, which is a recent concept in architecture. Many early copyists presumably assumed that the wall was distinct from the city and officiously altered the text. The angel measured precisely the city and her gates; see the next note.",
	"4622408914634937": "Over half of the Greek manuscripts, two of the three main independent lines of transmission (including the best one), read “and twelve”—a surprising bit of precise detail. But consider—12,000 stadia, twelve gates—if the gates are evenly spaced, as seems likely, we have a thousand stadia between gates; or is it 1,001 stadia? I will argue below that each gate was one stadium wide, which nicely explains the precise number, twelve thousand and twelve!",
	"04197127613943752": "The city is a cube, the total measurement being about 1,350 miles! But does it mean the circumference or is it referring to the three dimensions? If it refers to the circumference we divide by four and each side is about 340 miles long, and of course the height is also 340 miles. If we divide by three each dimension is about 450 miles. In either event, we have one incredibly large city! But because of the twelve gates and 12,000 stadia I really believe that the angel measured the circumference.",
	"42751514115257394": "That is about 70 yards; since we already know that the wall is hundreds of miles high, the reference here must be to the thickness of the wall. I take it that the wall was part of the structure, like in a modern high-rise, not like a fence (with no enemies there is no need for a fence—in fact, verse 25 makes clear that even the gates will never be closed).",
	"17230487811707396": "This is curious; apparently angels use the same measurement as humans. But then, with reference to things on this earth, why wouldn’t they?",
	"8236632694860768": "See verse 11 above.",
	"12822514311151445": "Each foundation was adorned with a different kind of stone. But how were the twelve foundations arranged, piled up or side by side? Presumably the gates were evenly spaced, with 1,000 stadia between each pair, so perhaps each such space represented an Apostle and had a different precious stone.",
	"28659594063843175": "Are not doors and gates usually wider than the wall is thick? The wall here is some 70 yards thick. I propose that each pearl was 200 yards (one stadium) wide (some pearl!), but notice in verse 25 that the gates were never closed, which means that they always remained in one position, hence no wear and tear on the ‘hinges’. But imagine that we are on that tremendously high mountain with John, and that we are perpendicular to the middle of one wall and at a distance of 50 miles. We are looking at a monstrous wall 340 miles square; it merely fills the horizon. At the base of the wall, evenly spaced (some 110 miles between them), are three gates. Would a gate 200 yards wide be out of proportion? Given the size of the wall, such gates might even seem small!",
	"9704351529025854": "The ‘gold’ here is evidently different from the gold we know; John does not say that it looked like gold, he says it was gold.",
	"5792881394355329": "“Kings of the earth”—we are still on the earth, with kings and nations coming and going, which is my second reason for placing the New Jerusalem during the Millennium.",
	"4434820272624729": "That is, defiled or profane; perhaps anything not consecrated to God.",
	"29438119100501625": "Connecting this statement with 22:15, we have all sorts of nasty people outside the city. After the Millennium and the Great White Throne they will be in the Lake of fire, so if they are still circulating on this earth, it must be during the Millennium, which is my third reason. Because of 22:15 I am inclined to suppose that the New Jerusalem will rest on the earth (not be a satellite, as some argue). But if so, where? The desert east of Jordan is hundreds of miles square with very few inhabitants, and relatively plane, yet quite close to the present Jerusalem. Perhaps there.",
	"8537552326514384": "So why else did you think there was an angel stationed at each gate (21:12)?",
	"9690590579334653": "This river should not be confused with the one in Ezekiel 47. The present city of Jerusalem will still exist and function during the Millennium. The two rivers share certain characteristics, but are also quite different. Zechariah 14:8 may well have to do with Ezekiel 47.",
	"4478839291668555": "Two of the three main independent lines of transmission (including the best one) have “of the spirits”. The familiar ‘the holy’ of the KJV is based on the third main line.",
	"7008638130736018": "This is a restatement of 1:1.",
	"03816045490198072": "Here Jesus Christ speaks (and so in verses 12, 16 and 18); see 1:3.",
	"07728728844786814": "I wonder if John was not always sure who was a real angel and who was the Son, appearing as an angel, and so just to make sure, . . .",
	"10383310264555923": "So who are the ‘dogs’? In Deuteronomy 23:18 ‘dog’ apparently refers to a male prostitute, a catamite, and is declared to be an abomination. In O.T. times dogs were scavengers and therefore unclean, and were generally looked down upon. In Jesus’ day Jews referred to Gentiles as ‘dogs’, but since many Gentiles are in the Church that is presumably not the intended meaning here. The ‘dogs’ in Matthew 7:6 react in an aggressively hostile manner against what is holy; I take it that they are people who are overtly serving evil (Philippians 3:2 may be referring to this sort of person). So who are the ‘dogs’ here? At the very least they are the unclean. Take it from there.",
	"02661764617841933": "Relativism is an idol; Humanism is an idol; Materialism is an idol. One wonders how many Christians today have a worldview that is really Biblical. The world’s values are not compatible with Christ’s values. Don’t forget 1 John 2:15-16!",
	"48087876339009616": "Since God the Son is speaking, I imagine that what He wants will be done!",
	"827786250517504": "“Words”, plural, includes the individual words that make up the whole. Those textual critics who have wantonly removed words from the Text, on the basis of satanically inspired presuppositions, are out. Those who interpret the Text in such a way as to avoid its plain meaning, likewise. Jehovah the Son affirms that the words are “true and  faithful ”, and He expects us to interpret them that way.",
	"8449353574674094": "“The Lord Jesus Christ” is now the full name or title of Jehovah the Son."
}