[{"type":"UNKNOWN","text":"Revelation"},{"type":"UNKNOWN","text":"REVELATION"},{"type":"note reference","text":"1"},{"type":"header","text":"Introduction"},{"type":"chapter number","text":"1"},{"type":"verse","text":":1 "},{"type":"verse","text":"Jesus Christ’s revelation, which God gave Him to show to His slaves"},{"type":"note reference","text":"2"},{"type":"verse","text":"—things that must"},{"type":"verse","text":"occur shortly."},{"type":"note reference","text":"3 "},{"type":"verse","text":"And He communicated it, sending it by His angel to His slave John, 2 who gave"},{"type":"verse","text":"witness to the word of God, even the testimony of Jesus Christ"},{"type":"note reference","text":"4"},{"type":"verse","text":"—the things that He saw,"},{"type":"note reference","text":"5"},{"type":"verse","text":"both things that are and those that must happen after these. 3 Blessed is he who reads and"},{"type":"verse","text":"those who hear the words of the prophecy, and keep the things that are written in it;"},{"type":"note reference","text":"6"},{"type":"verse","text":"because the time is near."},{"type":"paragraph break"},{"type":"verse","text":"4 John, to the seven churches that are in Asia: Grace and peace to you from"},{"type":"paragraph break"},{"type":"note reference","text":"7 "},{"type":"paragraph break"},{"type":"verse","text":"Him who"},{"type":"verse","text":"is and who was and who is coming, and from the seven-fold"},{"type":"note reference","text":"8 "},{"type":"verse","text":"Spirit who is before His throne,"},{"type":"verse","text":"5 and from Jesus Christ the faithful witness,"},{"type":"note reference","text":"9 "},{"type":"verse","text":"the firstborn from among the dead,"},{"type":"note reference","text":"10 "},{"type":"verse","text":"and the"},{"type":"verse","text":"ruler of the kings of the earth."},{"type":"note reference","text":"11"},{"type":"paragraph break"},{"type":"verse","text":"To Him who loved us and washed us from our sins with His own blood 6—indeed, He"},{"type":"verse","text":"made us a kingdom, priests"},{"type":"note reference","text":"12 "},{"type":"verse","text":"to His God and Father—to Him be the glory and the dominion"},{"type":"verse","text":"for ever and ever. Amen."},{"type":"note number","text":"1 "},{"type":"note","text":"Both the translation and the comments are the responsibility of Wilbur N. Pickering, ThM PhD, ©, being based"},{"type":"note","text":"on his edition of the Greek New Testament, according to the only significant line of transmission, both ancient"},{"type":"note","text":"and independent, that has a demonstrable archetypal form in all 27 books. The Greek Text of which this is a"},{"type":"note","text":"translation, and articles explaining the preference, may be downloaded free from "},{"type":"note","text":"www.prunch.org."},{"type":"note number","text":"2 "},{"type":"note","text":"Whose, the Father’s or the Son’s? Probably the Son’s, but in practice it makes little or no difference. Yes, the"},{"type":"note","text":"Text says “slaves”, so this book is not intended for the merely curious."},{"type":"note number","text":"3 "},{"type":"note","text":"The Text actually says, “with speed”. Since to God 1000 years = one day, it has only been two days!"},{"type":"note number","text":"4 "},{"type":"note","text":"Any testimony of Jesus Christ is a word of God."},{"type":"note number","text":"5 "},{"type":"note","text":"Most, if not all, versions have ‘he saw’ (referring to John, not Jesus) and omit the rest of the verse. The"},{"type":"note","text":"manuscript evidence is seriously divided at this point. My translation reflects two of the three main"},{"type":"note","text":"independent lines of transmission, including the best one (as I see it). See 22:20, “He who testifies to these"},{"type":"note","text":"things says, ‘Yes, I am coming swiftly!’ Oh yes!! Come Lord Jesus!” The whole book is what Jesus Christ is"},{"type":"note","text":"testifying, is revealing; as an eye witness. So the whole book is inspired."},{"type":"note number","text":"6 "},{"type":"note","text":"John is evidently claiming divine inspiration for what he is writing. You won’t be blessed for reading or hearing"},{"type":"note","text":"a newspaper or a magazine. Notice that one person is reading (aloud) and a number of people are hearing,"},{"type":"note","text":"which was the norm in the congregations, since very few could afford to have a private copy of Scripture."},{"type":"note","text":"Notice further that it is necessary to “keep” what is written."},{"type":"note number","text":"7 "},{"type":"note","text":"The sequence “from..., and from..., and from...” suggests three persons. The third, “Jesus Christ”, has to be the"},{"type":"note","text":"Son. “The seven-fold Spirit” would be the Holy Spirit. So “Him who is, was and is coming” must be the Father."},{"type":"note","text":"Just over half of the Greek MSS add ‘God’ after the first “from” to make the connection overt (but the best"},{"type":"note","text":"line of transmission does not)."},{"type":"note number","text":"8 "},{"type":"note","text":"Although the evidence is badly divided, I take it that the original reading is “the seven spirits which is”. A plural"},{"type":"note","text":"subject with a singular verb is anomalous, unless we understand “seven-fold Spirit which is”. If the Deity is"},{"type":"note","text":"three in one, why might not the Holy Spirit be seven in one? See Isaiah 11:2."},{"type":"note number","text":"9 "},{"type":"note","text":"When and how was He “the faithful witness”? Throughout His life on earth He was the faithful witness to the"},{"type":"note","text":"Father’s character, what the Father was doing (John 5:19), what the Father was saying (John 12:50). Here He is"},{"type":"note","text":"the faithful witness to what is going to happen."},{"type":"note number","text":"10 "},{"type":"note","text":"We have two readings here: one is clearly “from among the dead” while the other is ambiguous, meaning"},{"type":"note","text":"either “from among the dead” or ‘of the dead’. With the latter option, “firstborn” could have the derived"},{"type":"note","text":"meaning of ‘lord’ or ‘boss’. I take it that the better option is to follow the best line of transmission and read"},{"type":"note","text":"“from among”, in which case “firstborn” has its primary meaning. Death is pictured as a huge womb, pregnant"},{"type":"note","text":"with all the dead, and Jesus Christ was the first one out, literally the “firstborn”—but only the first! Because"},{"type":"note","text":"Jesus conquered death, we too may emerge from that ‘womb’. Thank you Lord!"},{"type":"note number","text":"11 "},{"type":"note","text":"Satan has been demoted—see John 12:31."},{"type":"note number","text":"12 "},{"type":"note","text":"What was the function of a priest? A priest was a go-between, representing the people to God. I would say"},{"type":"note","text":"that intercessory prayer is a priestly function."},{"type":"UNKNOWN","text":"1"},{"type":"UNKNOWN","text":"Revelation"},{"type":"paragraph break"},{"type":"verse","text":"7 Take note, He comes with the clouds, and every eye will see Him, including those"},{"type":"verse","text":"who pierced Him."},{"type":"note reference","text":"1 "},{"type":"verse","text":"And all the tribes of the earth will beat their breasts [in dismay] because"},{"type":"verse","text":"of Him. Yea, verily!"},{"type":"note reference","text":"2"},{"type":"paragraph break"},{"type":"verse","text":"8 “I am the Alpha and the Omega”,"},{"type":"paragraph break"},{"type":"note reference","text":"3 "},{"type":"paragraph break"},{"type":"verse","text":"says the Lord God, “He who is and who was and"},{"type":"verse","text":"who is coming, The Almighty.”"},{"type":"note reference","text":"4"},{"type":"header","text":"John is commissioned"},{"type":"chapter number","text":"1"},{"type":"verse","text":":9 "},{"type":"verse","text":"I, John, your brother and companion in the tribulation and kingdom and endurance"},{"type":"note reference","text":"5 "},{"type":"verse","text":"in"},{"type":"verse","text":"Christ Jesus, was on the island called Patmos on account of the Word of God and on account"},{"type":"verse","text":"of the testimony of Jesus Christ."},{"type":"note reference","text":"6 "},{"type":"verse","text":"10 I was in spirit"},{"type":"note reference","text":"7 "},{"type":"verse","text":"on the Lord’s day and I heard a voice"},{"type":"verse","text":"behind me, loud as a trumpet, 11 saying, “Write what you see in a book and send it to the"},{"type":"verse","text":"seven churches: to Ephesus, to Smyrna, to Pergamos, to Thyatira, to Sardis, to Philadelphia"},{"type":"verse","text":"and to Laodicea.” 12 And there I turned to see the voice that was speaking with me."},{"type":"note reference","text":"8 "},{"type":"verse","text":"And"},{"type":"verse","text":"having turned I saw seven golden lampstands, 13 and in the midst of the seven lampstands"},{"type":"verse","text":"one similar to a son of man,"},{"type":"note reference","text":"9 "},{"type":"verse","text":"clothed down to the feet and girded at the nipples"},{"type":"note reference","text":"10 "},{"type":"verse","text":"with a"},{"type":"verse","text":"golden belt. 14 Now His head, that is His hair, was white, like wool, as white as snow; and His"},{"type":"verse","text":"eyes were like a flame of fire; 15 and His feet were like fine brass, as when refined in a"},{"type":"verse","text":"furnace; and His voice was like the sound of many waters;"},{"type":"note reference","text":"11 "},{"type":"verse","text":"16 and He had seven stars on His"},{"type":"verse","text":"right hand and a sharp two-edged sword coming out of His mouth; and His countenance was"},{"type":"verse","text":"like the sun shining in its strength."},{"type":"note reference","text":"12"},{"type":"paragraph break"},{"type":"verse","text":"17 And when I saw Him I fell at His feet as if dead. And He placed His right hand"},{"type":"paragraph break"},{"type":"note reference","text":"13"},{"type":"verse","text":"upon me saying: “Do not fear. I am the First and the Last, 18 even the Living One—I became"},{"type":"verse","text":"dead, to be sure, and now I am living for ever and ever! Oh yes!! And I have the keys of Death"},{"type":"note number","text":"1 "},{"type":"note","text":"The soldier who actually pierced His side on the cross, and the religious leaders who brought the situation"},{"type":"note","text":"about, are presumably in Hades. I take it that we are being told that the dead will also see Him when He"},{"type":"note","text":"returns to reign. The human spirit is indestructible, so those in Hades are very much ‘aware’ (Luke 16:22-31)."},{"type":"note number","text":"2 "},{"type":"note","text":"That is how people used to talk—you may prefer ‘Yes, indeed!’ or ‘Even so, amen!’ The certainty that all tribes"},{"type":"note","text":"will beat their breasts is being emphasized."},{"type":"note number","text":"3 "},{"type":"note","text":"To be the first and the last you have to be the biggest, all the time."},{"type":"note number","text":"4 "},{"type":"note","text":"In verse 8 the Father speaks, putting His weight behind what is being written."},{"type":"note number","text":"5 "},{"type":"note","text":"“The tribulation and kingdom and endurance”—that there is only one definite article for the three nouns"},{"type":"note","text":"presumably indicates that the three are regarded as a single package. To participate in the Kingdom in this life"},{"type":"note","text":"involves tribulation and requires endurance."},{"type":"note number","text":"6 "},{"type":"note","text":"Presumably the witness that John gave about Jesus Christ. As in this verse, the human authors frequently"},{"type":"note","text":"alternated ‘Jesus Christ’ and ‘Christ Jesus’—so far as I can see, it was merely a stylistic devise to reduce"},{"type":"note","text":"repetition."},{"type":"note number","text":"7 "},{"type":"note","text":"There is no definite article with “spirit”, so to capitalize the word is arbitrary. It could refer to the Holy Spirit,"},{"type":"note","text":"but I think it more likely that it refers to John’s spiritual condition (see 4:2 below)."},{"type":"note number","text":"8 "},{"type":"note","text":"It was at that point that he turned."},{"type":"note number","text":"9 "},{"type":"note","text":"The Lord Jesus referred to Himself as “the Son of the Man”, always with the two definite articles, but here"},{"type":"note","text":"there are no articles (in the Greek). John saw a human like form, very different from the Jesus he had known."},{"type":"note number","text":"10 "},{"type":"note","text":"Since the figure was clothed, the nipples would not be visible, so the point is presumably to give the position"},{"type":"note","text":"of the belt—across the middle of the chest. Since no further mention is made of the belt, in the letters, it is"},{"type":"note","text":"hard to know what purpose it served. But see 15:6 below."},{"type":"note number","text":"11 "},{"type":"note","text":"A low (or loud) roar that pervades the atmosphere—it is awesome, and you can’t get away from it."},{"type":"note number","text":"12 "},{"type":"note","text":"Comparing this with verse 14 it is evident that only the part of the head covered by the hair was white, the"},{"type":"note","text":"face (probably no beard) was like the sun."},{"type":"note number","text":"13 "},{"type":"note","text":"But He had seven stars on that hand! Presumably the stars were on His open hand, so He rested the back of"},{"type":"note","text":"His hand on John. Since the seven stars represented the messengers of the seven churches, what might the"},{"type":"note","text":"symbolism be? Since the seven churches, taken together, represent the total Church (presumably), perhaps"},{"type":"note","text":"the glorified Christ is blessing John on behalf of the Church, so that he will be a blessing to that Church, in his"},{"type":"note","text":"turn."},{"type":"UNKNOWN","text":"2"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"and of Hades!"},{"type":"note reference","text":"1 "},{"type":"verse","text":"19 Therefore"},{"type":"note reference","text":"2 "},{"type":"verse","text":"write the things that you have seen, and the things that are,"},{"type":"verse","text":"and the things that are going to occur after these."},{"type":"note reference","text":"3 "},{"type":"verse","text":"20 The mystery of the seven stars which"},{"type":"verse","text":"you saw upon my right hand, and the seven golden lampstands: the seven stars are the"},{"type":"verse","text":"messengers"},{"type":"note reference","text":"4 "},{"type":"verse","text":"of the seven churches, and the seven lampstands that you saw are seven"},{"type":"verse","text":"churches."},{"type":"header","text":"The seven letters"},{"type":"note reference","text":"5"},{"type":"header","text":"To Ephesus"},{"type":"chapter number","text":"2"},{"type":"verse","text":":1 "},{"type":"verse","text":"“To the messenger of the church in Ephesus write: These things says He who holds the"},{"type":"verse","text":"seven stars on His right hand, who walks about in the midst of the seven golden lampstands:"},{"type":"note reference","text":"6"},{"type":"verse","text":"2 ‘I know your works, yes the labor, and your endurance, and that you cannot stand those"},{"type":"verse","text":"who are evil. And you have tested those who claim to be apostles and are not,"},{"type":"note reference","text":"7 "},{"type":"verse","text":"and found"},{"type":"verse","text":"them "},{"type":"verse","text":"to be "},{"type":"verse","text":"liars; 3 and you have born up and endured on account of my name, and not"},{"type":"verse","text":"grown weary."},{"type":"paragraph break"},{"type":"verse","text":"4 ‘Nevertheless I have against you that you have left your first love."},{"type":"paragraph break"},{"type":"note reference","text":"8 "},{"type":"paragraph break"},{"type":"verse","text":"5 So think about"},{"type":"verse","text":"from where you have drifted"},{"type":"note reference","text":"9 "},{"type":"verse","text":"and repent, and do the first works, or else I will come at you"},{"type":"verse","text":"swiftly and remove your lampstand out of its place"},{"type":"note reference","text":"10"},{"type":"verse","text":"—unless you do repent. 6 But you do"},{"type":"verse","text":"have this, that you hate the works of the Nicolaitans,"},{"type":"note reference","text":"11 "},{"type":"verse","text":"which I also hate.’"},{"type":"note number","text":"1 "},{"type":"note","text":"Oh praise God! Satan used to have the keys, Hebrews 2:14, but now Jesus has them, because He did indeed"},{"type":"note","text":"vanquish the devil."},{"type":"note number","text":"2 "},{"type":"note","text":"In verse 8 the Father guarantees the veracity of the prophecy; here the Son, who conquered death and lives"},{"type":"note","text":"forevermore, does the guaranteeing."},{"type":"note number","text":"3 "},{"type":"note","text":"I take it that the precise form of the original Text here has the effect of affirming the certainty of the coming"},{"type":"note","text":"events. This verse is often taken as giving the outline of the book: “what you saw” = chapter 1; “things that"},{"type":"note","text":"are” = chapters 2-3; “things to come” = chapters 4-22."},{"type":"note number","text":"4 "},{"type":"note","text":"The Greek word "},{"type":"UNKNOWN","text":"aggeloj "},{"type":"note","text":"may mean messenger or angel (they are often messengers). Since 2:20 below says"},{"type":"note","text":"“your wife”, referring to the messenger, we should presumably understand ‘messenger’ here as referring to a"},{"type":"note","text":"man. It is possible that messengers from these churches were visiting John, on Patmos, or had visited him"},{"type":"note","text":"earlier."},{"type":"note number","text":"5 "},{"type":"note","text":"These letters have received a variety of ‘interpretations’. The basic meaning is obviously the literal one—these"},{"type":"note","text":"were actual churches at the time that John wrote, and each one was exactly as described in its letter. By way"},{"type":"note","text":"of application, these churches may also be taken as symbolic—at any given moment throughout the history of"},{"type":"note","text":"the Church local churches may be found to be similar in character to any one of these seven. It is also possible"},{"type":"note","text":"to see these seven churches as prophetic of the general course of the Church through time, and in that event"},{"type":"note","text":"we are presumably in the last or Laodicean age."},{"type":"note number","text":"6 "},{"type":"note","text":"Christ’s walking about in the midst of the churches is not an aimless meandering; He is observing and"},{"type":"note","text":"evaluating."},{"type":"note number","text":"7 "},{"type":"note","text":"Evidently it is possible to test the validity of someone’s claim to be an apostle—I wish we had been told how to"},{"type":"note","text":"do it."},{"type":"note number","text":"8 "},{"type":"note","text":"Ouch!"},{"type":"note number","text":"9 "},{"type":"note","text":"They had not taken a sudden fall, they had drifted from their moorings, a process so gradual that it may go"},{"type":"note","text":"unnoticed for quite some time. It can happen to us too."},{"type":"note number","text":"10 "},{"type":"note","text":"In fact, Ephesus did lose its lampstand."},{"type":"note number","text":"11 "},{"type":"note","text":"We do not know for sure who or what they were. The etymology of the word suggests ‘laity conquerors’,"},{"type":"note","text":"perhaps the beginning of the system where the clergy dominates the laity. Once someone has a ‘guaranteed’"},{"type":"note","text":"position their lifestyle often becomes licentious."},{"type":"UNKNOWN","text":"3"},{"type":"UNKNOWN","text":"Revelation"},{"type":"paragraph break"},{"type":"verse","text":"7 “He who has an ear"},{"type":"paragraph break"},{"type":"note reference","text":"1 "},{"type":"paragraph break"},{"type":"verse","text":"let him hear what the Spirit is saying to the churches."},{"type":"paragraph break"},{"type":"note reference","text":"2 "},{"type":"paragraph break"},{"type":"verse","text":"To the"},{"type":"verse","text":"one who overcomes"},{"type":"note reference","text":"3 "},{"type":"verse","text":"I will grant to eat of the Tree of Life, which is in the midst of the"},{"type":"verse","text":"Paradise of my God."},{"type":"note reference","text":"4"},{"type":"header","text":"To Smyrna"},{"type":"paragraph break"},{"type":"verse","text":"8 "},{"type":"paragraph break"},{"type":"verse","text":"“And to the messenger of the church in Smyrna write: These things says the First"},{"type":"verse","text":"and the Last,"},{"type":"note reference","text":"5 "},{"type":"verse","text":"who became dead and came to life: 9 ‘I know your works and affliction and"},{"type":"verse","text":"poverty (but you are rich), and the slander of those who claim to be Jews and are not, but are"},{"type":"verse","text":"a synagogue of Satan."},{"type":"note reference","text":"6 "},{"type":"verse","text":"10 Do not fear any of the things that you are about to suffer: Take"},{"type":"verse","text":"note, the devil is really about to throw some of you into prison, so that you may be tested,"},{"type":"verse","text":"and you will have an affliction of ten days."},{"type":"note reference","text":"7 "},{"type":"verse","text":"Stay faithful until death and I will give you the"},{"type":"verse","text":"crown of life.’"},{"type":"note reference","text":"8"},{"type":"paragraph break"},{"type":"verse","text":"11 “He who has an ear let him hear what the Spirit is saying to the churches. The one"},{"type":"verse","text":"who overcomes will absolutely not be harmed by the second death."},{"type":"note reference","text":"9"},{"type":"header","text":"To Pergamos"},{"type":"paragraph break"},{"type":"verse","text":"12 "},{"type":"paragraph break"},{"type":"verse","text":"“And to the messenger of the church in Pergamos write: These things says He who"},{"type":"verse","text":"has the sharp two-edged sword: 13 ‘I know your works, and where you live, where Satan’s"},{"type":"verse","text":"throne is. And you hold my name fast and did not deny my faith during the days in which"},{"type":"verse","text":"Antipas was my faithful witness, who was killed among you, where Satan lives."},{"type":"note reference","text":"10"},{"type":"paragraph break"},{"type":"verse","text":"14 ‘Nevertheless I have a few things against you, because you have there adepts of"},{"type":"verse","text":"the doctrine of Balaam, who taught Balak to throw a stumbling block before the sons of"},{"type":"verse","text":"Israel, to eat things offered to idols and to fornicate."},{"type":"note reference","text":"11 "},{"type":"verse","text":"15 Thus"},{"type":"note reference","text":"12 "},{"type":"verse","text":"you also have adepts of the"},{"type":"note number","text":"1 "},{"type":"note","text":"That is right, just one ear. In other words, we had better pay attention!"},{"type":"note number","text":"2 "},{"type":"note","text":"At this point it becomes very clear that God is giving a general application to these letters. The first one was"},{"type":"note","text":"written to a literal church in literal Ephesus, in literal terms, but "},{"type":"note","text":"all "},{"type":"note","text":"of us are to pay attention to the spiritual"},{"type":"note","text":"principles and lessons involved."},{"type":"note number","text":"3 "},{"type":"note","text":"So what happens if you don’t overcome??"},{"type":"note number","text":"4 "},{"type":"note","text":"The Tree of Life is first mentioned in Genesis 3:22-24; it must have been transplanted out of the Garden of"},{"type":"note","text":"Eden before the Flood, unless it was a replica of the original in God’s Paradise. A considerable majority of the"},{"type":"note","text":"Greek manuscripts, including the best line of transmission, have “my” God. While walking this earth the Son"},{"type":"note","text":"repeatedly referred to the Father as ‘my God’."},{"type":"note number","text":"5 "},{"type":"note","text":"Here, and in 1:17 and 22:13, the glorified Christ calls Himself “the First and the Last”—comparing with Isaiah"},{"type":"note","text":"44:6 we have one of several demonstrations that Jesus Christ is Jehovah [Mormons and JWs deny that He is"},{"type":"note","text":"Jehovah]."},{"type":"note number","text":"6 "},{"type":"note","text":"You had better believe that there is a ‘synagogue of Satan’ near you! Why do you suppose that 1 Peter 5:8 says"},{"type":"note","text":"to “"},{"type":"note","text":"be vigilant"},{"type":"note","text":"”? In our day false Christians are more of a problem than false Jews."},{"type":"note number","text":"7 "},{"type":"note","text":"The Lord does not promise us a free ride, bed of roses, or whatever. Here they are given specific advance"},{"type":"note","text":"warning—bad times ahead. (Presumably the “days” are not solar.)"},{"type":"note number","text":"8 "},{"type":"note","text":"So what happens if you don’t stay faithful? Note that the Lord does not register any complaint against Smyrna."},{"type":"note","text":"If you are being persecuted for your faith it tends to keep you pretty close to the Lord. Also there is no"},{"type":"note","text":"incentive to pretend."},{"type":"note number","text":"9 "},{"type":"note","text":"Revelation 20:14 makes clear that “the second death” is the Lake of Fire. The first death is the physical one;"},{"type":"note","text":"the second is the spiritual one—eternal separation from the Creator, in whose image we are. Of course the"},{"type":"note","text":"redeemed go into eternal life, not death, so the “second death” holds no threat for them. But there is the little"},{"type":"note","text":"matter of ‘overcoming’."},{"type":"note number","text":"10 "},{"type":"note","text":"I find the double reference to Satan here to be curious. The opposition in the spirit realm would be especially"},{"type":"note","text":"strong."},{"type":"note number","text":"11 "},{"type":"note","text":"Why are fornication and adultery becoming more and more common in ‘Christian’ circles today? They come"},{"type":"note","text":"with idolatry—the church is riddled with humanism, relativism, materialism, spiritism, etc., false gods all. One"},{"type":"note","text":"wonders how many Christians today have a worldview that is strictly Biblical, without any admixture of the"},{"type":"note","text":"world’s values."},{"type":"note number","text":"12 "},{"type":"note","text":"Birds of a feather flock together; if you start sinning in one area, before long it is two."},{"type":"UNKNOWN","text":"4"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"doctrine of the Nicolaitans as well. 16 Repent! Or else I will come at you swiftly and will fight"},{"type":"verse","text":"against them"},{"type":"note reference","text":"1 "},{"type":"verse","text":"with the sword of my mouth.’"},{"type":"paragraph break"},{"type":"verse","text":"17 “He who has an ear let him hear what the Spirit is saying to the churches. To the"},{"type":"verse","text":"one who overcomes I will grant to eat from"},{"type":"note reference","text":"2 "},{"type":"verse","text":"the hidden manna. And I will give him a white"},{"type":"verse","text":"pebble, and on the pebble a new name written, which no one knows except the receiver."},{"type":"note reference","text":"3"},{"type":"header","text":"To Thyatira"},{"type":"paragraph break"},{"type":"verse","text":"18 "},{"type":"paragraph break"},{"type":"verse","text":"“And to the messenger of the church in Thyatira write: These things says the Son of"},{"type":"verse","text":"God,"},{"type":"note reference","text":"4 "},{"type":"verse","text":"He who has the eyes like a flame of fire and the feet like fine brass: 19 ‘I know your"},{"type":"verse","text":"works"},{"type":"note reference","text":"5"},{"type":"verse","text":"—the love, the faith, the service—and your endurance; in fact your last works are"},{"type":"verse","text":"greater than the first."},{"type":"note reference","text":"6"},{"type":"paragraph break"},{"type":"verse","text":"20 ‘Nevertheless I have against you that you tolerate your wife Jezebel,"},{"type":"paragraph break"},{"type":"note reference","text":"7 "},{"type":"paragraph break"},{"type":"verse","text":"who calls"},{"type":"verse","text":"herself a prophetess and teaches and deceives my slaves"},{"type":"note reference","text":"8 "},{"type":"verse","text":"to fornicate and to eat things"},{"type":"verse","text":"offered to idols."},{"type":"note reference","text":"9 "},{"type":"verse","text":"21 I even gave her time so that she might repent, but she does not want to"},{"type":"verse","text":"repent of her fornication."},{"type":"note reference","text":"10 "},{"type":"verse","text":"22 So, I am throwing her into a "},{"type":"verse","text":"sick"},{"type":"verse","text":"bed and those adulterating"},{"type":"verse","text":"with her into great affliction, unless they repent of her works."},{"type":"note reference","text":"11 "},{"type":"verse","text":"23 And I will execute her"},{"type":"verse","text":"children;"},{"type":"note reference","text":"12 "},{"type":"verse","text":"and all the churches will know that "},{"type":"verse","text":"I "},{"type":"verse","text":"am the One who searches minds and hearts,"},{"type":"verse","text":"and I will give to each one of you according to your works."},{"type":"note reference","text":"13"},{"type":"paragraph break"},{"type":"verse","text":"24 ‘Now to the rest of you who are in Thyatira I say—to as many as do not hold this"},{"type":"verse","text":"teaching, those who have not known"},{"type":"note reference","text":"14 "},{"type":"verse","text":"the depths of Satan, as they say—I will not put any"},{"type":"note number","text":"1 "},{"type":"note","text":"Notice that the pronoun changes—it is specifically against the Nicolaitans and Balaamites that He will fight."},{"type":"note number","text":"2 "},{"type":"note","text":"“From” is literal, maybe too literal; perhaps we should render “some of” the hidden manna."},{"type":"note number","text":"3 "},{"type":"note","text":"Our name identifies us to other people, so what good is a name that no one knows? Except that the giver"},{"type":"note","text":"knows, obviously. So maybe the private name has to do with a private relationship, between giver and"},{"type":"note","text":"receiver! Eating “hidden manna” also sounds sort of private."},{"type":"note number","text":"4 "},{"type":"note","text":"If anyone was still in doubt as to the identity of the One who is dictating these letters, the doubt stops here."},{"type":"note number","text":"5 "},{"type":"note","text":"Each of the seven letters begins with this phrase, ‘I know your works’. How we act reflects our world-view,"},{"type":"note","text":"what we really believe."},{"type":"note number","text":"6 "},{"type":"note","text":"Wow, here is a church that has it all—love, faith, service, endurance—and it is growing, doing more and more!"},{"type":"note","text":"Yes, well, but, then there is the rest of the story."},{"type":"note number","text":"7 "},{"type":"note","text":"About three fourths of the Greek manuscripts, including the best line of transmission, read “your wife” rather"},{"type":"note","text":"than ‘that woman’. The main group that reads ‘that woman’ reflects a tradition that is full of obvious"},{"type":"note","text":"corruptions, and so does not inspire confidence. The original reading is doubtless “your wife”. To have a wife"},{"type":"note","text":"the messenger must be a man, not an angel."},{"type":"note number","text":"8 "},{"type":"note","text":"The Lord uses an emphatic possessive pronoun here—she is messing with "},{"type":"note","text":"His "},{"type":"note","text":"slaves."},{"type":"note number","text":"9 "},{"type":"note","text":"Again, notice that fornication and idolatry go together."},{"type":"note number","text":"10 "},{"type":"note","text":"If someone refuses to repent they are beyond help; judgment has to come."},{"type":"note number","text":"11 "},{"type":"note","text":"Two thirds of the Greek manuscripts, including the most dependable group, have “her” works, not ‘their’"},{"type":"note","text":"works. In verse 20 the Lord emphasized that they were His slaves. If the original reading is “her” works, as I"},{"type":"note","text":"believe, then what is involved here is spiritual adultery—she was not literally sleeping with a variety of men in"},{"type":"note","text":"the church. No matter how much love, faith and service there may be in a church, the Lord will not tolerate"},{"type":"note","text":"idolatry, which is spiritual adultery."},{"type":"note number","text":"12 "},{"type":"note","text":"Literally ‘kill by death’—so how else can you kill someone if not by death? Those who are familiar with the KJV"},{"type":"note","text":"will recall the phrase ‘let him die the death’, which in the context implies execution. I take it that “her"},{"type":"note","text":"children” does not refer to her literal sons and daughters, but to her ‘spiritual children’, those who have"},{"type":"note","text":"bought into her teaching and life style. The Lord wants to eradicate her ‘genes’, as it were. But why does God"},{"type":"note","text":"not kill Jezebel herself, instead of her children? I imagine that God uses evil people, like Jezebel, to put the rest"},{"type":"note","text":"of us to the test, to see whose side we really are on. Those who go along with a ‘Jezebel’ do not really want"},{"type":"note","text":"God."},{"type":"note number","text":"13 "},{"type":"note","text":"What we do, or do not do, not only makes a difference down here, but will also make a difference ‘up there’."},{"type":"note number","text":"14 "},{"type":"note","text":"“Known” implies experiential knowledge. Note that the Lord links Jezebel’s teaching directly to Satan, and"},{"type":"note","text":"those who are doing it are deeply involved with him (whether or not they fully understand the implications—if"},{"type":"note","text":"they are ‘deceived’ [v. 20] then they may indeed not understand)."},{"type":"UNKNOWN","text":"5"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"other burden on you; 25 just hold fast what you have until I come."},{"type":"note reference","text":"1 "},{"type":"verse","text":"26 And "},{"type":"verse","text":"as for "},{"type":"verse","text":"the one"},{"type":"verse","text":"who overcomes and keeps my works"},{"type":"note reference","text":"2 "},{"type":"verse","text":"until the end, I will give him authority over the nations;"},{"type":"verse","text":"27 and he will shepherd them with a rod of iron; they will be smashed like clay pots 28—just"},{"type":"verse","text":"as I have received from my Father."},{"type":"note reference","text":"3 "},{"type":"verse","text":"And I will give him the morning star.’"},{"type":"note reference","text":"4"},{"type":"paragraph break"},{"type":"verse","text":"29 “He who has an ear let him hear what the Spirit is saying to the churches."},{"type":"header","text":"To Sardis"},{"type":"chapter number","text":"3"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"“And to the messenger of the church in Sardis write: These things says He who"},{"type":"verse","text":"has the seven spirits of God"},{"type":"note reference","text":"5 "},{"type":"verse","text":"and the seven stars: ‘I know your works, that you have a name"},{"type":"verse","text":"that you are alive, yet you are dead. 2 Wake up! And strengthen the remaining things that"},{"type":"verse","text":"you were about to throw away,"},{"type":"note reference","text":"6 "},{"type":"verse","text":"for I have not found your works to be fulfilled before my"},{"type":"verse","text":"God. 3 So remember how you have received and heard,"},{"type":"note reference","text":"7 "},{"type":"verse","text":"and hold fast and repent; because if"},{"type":"verse","text":"you do not watch, I will come upon you like a thief, and you will not know what hour I will"},{"type":"verse","text":"come upon you."},{"type":"paragraph break"},{"type":"verse","text":"4 ‘But you do have a few names in Sardis who have not defiled their garments, and"},{"type":"verse","text":"they will walk with me in white, because they are worthy. 5 The one who overcomes will thus"},{"type":"verse","text":"be clothed in white garments, and I will not erase his name from the Book of Life,"},{"type":"note reference","text":"8 "},{"type":"verse","text":"and I will"},{"type":"verse","text":"confess his name before my Father and before His angels.’"},{"type":"note reference","text":"9"},{"type":"paragraph break"},{"type":"verse","text":"6 “He who has an ear let him hear what the Spirit is saying to the churches."},{"type":"header","text":"To Philadelphia"},{"type":"paragraph break"},{"type":"verse","text":"7 "},{"type":"paragraph break"},{"type":"verse","text":"“And to the messenger of the church in Philadelphia write: These things says the"},{"type":"verse","text":"Holy, the True, He who has the key of David, who opens and no one can shut it, except He"},{"type":"verse","text":"who opens, and no one can open:"},{"type":"note reference","text":"10 "},{"type":"verse","text":"8 ‘I know your works. Look, I have set before you an open"},{"type":"note number","text":"1 "},{"type":"note","text":"They were doing quite well, generally—see the second note with verse 19 above. So if they throw off Jezebel’s"},{"type":"note","text":"influence they will be all right."},{"type":"note number","text":"2 "},{"type":"note","text":"“Keeps my works until the end”—it is not enough to hold to the right doctrine; the Lord wants to see us"},{"type":"note","text":"reproducing His works (John 14:12). Notice that our participation in the administration of the Millennial"},{"type":"note","text":"Messianic Kingdom is at stake."},{"type":"note number","text":"3 "},{"type":"note","text":"The Lord is evidently referring to Psalms 2:7-9. In that event He is declaring that He is the “Son” in verse7 and"},{"type":"note","text":"that He did indeed ask for and receive the nations as an inheritance. If we are co-heirs (Romans 8:17) then we"},{"type":"note","text":"are involved in the outworking."},{"type":"note number","text":"4 "},{"type":"note","text":"In Revelation 22:16 the Lord declares Himself to be the “morning star”. In Isaiah 14:12 Satan is called “day-"},{"type":"note","text":"star, son of the morning”, but that was what he was before he fell. The planets Venus and Mercury are the"},{"type":"note","text":"‘morning stars’ we see in the sky at dawn. But the Lord here says the morning star. I guess we will find out"},{"type":"note","text":"what He means when we get there."},{"type":"note number","text":"5 "},{"type":"note","text":"In 1:4 above “the seven Spirits“, which I rendered as “seven-fold Spirit”, has to do with the Holy Spirit. Here I"},{"type":"note","text":"think not—the Lord ‘has’ them like He has the seven stars. Perhaps the reference is to Isaiah 11:2."},{"type":"note number","text":"6 "},{"type":"note","text":"“That you were about to throw away” is the reading of about 2/3 of the Greek manuscripts, including the most"},{"type":"note","text":"dependable group, as opposed to ‘that were about to die’. They had probably already stopped believing in a"},{"type":"note","text":"variety of Biblical truths and were on the verge of dumping the rest, like the theological modernist or liberal of"},{"type":"note","text":"our day. Not surprisingly, they were short on works as well."},{"type":"note number","text":"7 "},{"type":"note","text":"See Luke 8:18."},{"type":"note number","text":"8 "},{"type":"note","text":"The Text is very clear—the glorified Christ said “erase”. You cannot erase something that is not there! To argue"},{"type":"note","text":"that Christ is using an impossibility as a threat is to accuse Him of using language deceitfully, a form of lying—"},{"type":"note","text":"not smart! By the grace of God my name is in the Book of Life, but what happens if I don’t overcome? In all"},{"type":"note","text":"seven letters our risen Lord places heavy emphasis upon our human responsibility. God will take care of His"},{"type":"note","text":"side; we had better take a careful look at our side."},{"type":"note number","text":"9 "},{"type":"note","text":"Comparing this statement with Jesus’ statement in Matthew 10:32-33, confessing is the opposite of denying."},{"type":"note","text":"Since eternal destiny is at stake, the confessing/denying must involve what we are and do, not just our words."},{"type":"note","text":"Confessing has to do with overcoming."},{"type":"note number","text":"10 "},{"type":"note","text":"The evidence is badly divided with reference to the wording of the last half of the verse. The translation given"},{"type":"note","text":"here reflects over half of the Greek manuscripts, including the most dependable group. We are accustomed to"},{"type":"note","text":"the more balanced form, but the basic point remains the same."},{"type":"UNKNOWN","text":"6"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"door, that no one is able to shut; because you have a little strength and have kept my Word"},{"type":"verse","text":"and have not denied my name. 9 See, I am determining that some of the synagogue of Satan,"},{"type":"verse","text":"those who claim to be Jews and are not, but are lying—yes, I will cause them to come, and to"},{"type":"verse","text":"do obeisance at your feet and to know that I have loved you."},{"type":"note reference","text":"1 "},{"type":"verse","text":"10 Because you have kept my"},{"type":"verse","text":"command to endure, I also will keep you from the hour of the testing that is about to come"},{"type":"verse","text":"upon the whole inhabited earth,"},{"type":"note reference","text":"2 "},{"type":"verse","text":"to test those who dwell on the earth."},{"type":"paragraph break"},{"type":"verse","text":"11 ‘I am coming swiftly. Hold fast what you have so that no one may take your"},{"type":"verse","text":"crown."},{"type":"note reference","text":"3 "},{"type":"verse","text":"12 The one who overcomes, I will make him a pillar in the temple of my God, and he"},{"type":"verse","text":"will never again go out. And I will write on him the name of my God, the name of my God’s"},{"type":"verse","text":"city—the new Jerusalem, which comes down out of heaven from my God—and my new"},{"type":"verse","text":"name.’"},{"type":"note reference","text":"4"},{"type":"paragraph break"},{"type":"verse","text":"13 “He who has an ear let him hear what the Spirit is saying to the churches."},{"type":"header","text":"To Laodicea"},{"type":"paragraph break"},{"type":"verse","text":"14 "},{"type":"paragraph break"},{"type":"verse","text":"“And to the messenger of the church in Laodicea write: These things says the"},{"type":"verse","text":"Amen, the faithful and true witness, the Originator of God’s creation: 15 ‘I know your works,"},{"type":"verse","text":"that you are neither cold nor hot. I could wish you were cold or hot. 16 So then, since you are"},{"type":"verse","text":"lukewarm, and neither hot nor cold, I am about to vomit you out of my mouth."},{"type":"note reference","text":"5 "},{"type":"verse","text":"17 Because"},{"type":"verse","text":"you say, “I am rich, even become wealthy, and have need of nothing”, and do not realize that"},{"type":"verse","text":"you are the most wretched—yes, the most pitiable and poor and blind and naked—18 I"},{"type":"verse","text":"counsel you to buy gold from me, refined by fire, so that you may become rich; and white"},{"type":"verse","text":"garments, so that you may be clothed, and your nakedness not be shamefully exposed; and"},{"type":"verse","text":"anoint your eyes with eye salve, so that you may see. 19 As many as I love I rebuke and"},{"type":"verse","text":"discipline;"},{"type":"note reference","text":"6 "},{"type":"verse","text":"so be zealous and repent!"},{"type":"paragraph break"},{"type":"verse","text":"20 ‘Now then, I stand at the door and knock."},{"type":"paragraph break"},{"type":"note reference","text":"7 "},{"type":"paragraph break"},{"type":"verse","text":"If anyone should hear my voice"},{"type":"paragraph break"},{"type":"note reference","text":"8 "},{"type":"paragraph break"},{"type":"verse","text":"and"},{"type":"verse","text":"open the door, I really will come in to him and eat with him, and he with me. 21 To the one"},{"type":"verse","text":"who overcomes I will grant to sit with me on my throne, just as I overcame"},{"type":"note reference","text":"9 "},{"type":"verse","text":"and sat down"},{"type":"verse","text":"with my Father on His throne.’"},{"type":"note reference","text":"10"},{"type":"note number","text":"1 "},{"type":"note","text":"I take it that this will happen here on earth—a pleasant prospect! Since they have been slandering us (at the"},{"type":"note","text":"very least, 2:9) this will be a welcome vindication. I imagine that at this point in history the “synagogue of"},{"type":"note","text":"Satan” includes people who claim to be Christians, but are not really. They may even be in positions of"},{"type":"note","text":"leadership (cf. Jeremiah 20:1-4)."},{"type":"note number","text":"2 "},{"type":"note","text":"There has always been tribulation and testing here and there on the earth, but to include “the whole inhabited"},{"type":"note","text":"earth” the reference must be to the Great Tribulation. How can you be “kept from the hour” if you are in the"},{"type":"note","text":"middle of it? To be protected in the middle of a situation is not the same as being kept from it. This text would"},{"type":"note","text":"appear to point toward a pre-tribulation, or pre-wrath, rapture of the Church."},{"type":"note number","text":"3 "},{"type":"note","text":"Would the glorified Christ make an empty threat? So how does someone take our crown? How about if"},{"type":"note","text":"someone moves into a spot that you relinquished?"},{"type":"note number","text":"4 "},{"type":"note","text":"That is three names."},{"type":"note number","text":"5 "},{"type":"note","text":"If the Lord vomits you out, where do you go? Something can only be vomited out if it is in."},{"type":"note number","text":"6 "},{"type":"note","text":"Sounds like ‘tough’ love. The Greek word is "},{"type":"UNKNOWN","text":"filew"},{"type":"note","text":", not "},{"type":"UNKNOWN","text":"agapaw"},{"type":"note","text":". See Hebrews 12:6."},{"type":"note number","text":"7 "},{"type":"note","text":"Although this text is widely used in evangelism, it is actually directed to Christians. The Lord is offering"},{"type":"note","text":"fellowship and communion to those who claim to belong to Him. Recall that the Father seeks those who will"},{"type":"note","text":"worship Him in spirit and truth (John 4:23). Many have the impression that God is hard to find or reach, but He"},{"type":"note","text":"disagrees: “You will seek me and find me, when you search for me with all your heart” (Jeremiah 29:13). The"},{"type":"note","text":"trouble is that few of us are willing to meet the condition. See also 2 Chronicles 15:2 and 16:9; also Acts 17:27."},{"type":"note number","text":"8 "},{"type":"note","text":"Evidently He both knocks and calls. In many cultures one calls out rather than knocks [there may not be any"},{"type":"note","text":"door, or the dogs may not let you get near it], and in the Apurinã culture (an indigenous people in the Amazon"},{"type":"note","text":"jungle, among whom I lived for several years) you call the person’s name."},{"type":"note number","text":"9 "},{"type":"note","text":"“Consider Him who endured such hostility from sinners against Himself, . . .” (Hebrews 12:3; see also verses 4-"},{"type":"note","text":"11). He overcame, we must overcome—God is not offering a free ride."},{"type":"note number","text":"10 "},{"type":"note","text":"Comparing this statement with Ephesians 1:19-21 and 2:6, what is the picture? Since the Son is now literally"},{"type":"note","text":"“seated” at the Father’s right hand, this promise should be taken literally. But how about right now? I take it"},{"type":"UNKNOWN","text":"7"},{"type":"UNKNOWN","text":"Revelation"},{"type":"paragraph break"},{"type":"verse","text":"22 “He who has an ear let him hear what the Spirit is saying to the churches.”"},{"type":"header","text":"“The things that must happen after these”"},{"type":"chapter number","text":"4"},{"type":"verse","text":":1 "},{"type":"verse","text":"After these things I looked and wow—a door standing open in the sky, and the first voice"},{"type":"verse","text":"that I heard, like a trumpet speaking with me,"},{"type":"note reference","text":"1 "},{"type":"verse","text":"saying, “Come up here and I will show you the"},{"type":"verse","text":"things that must take place after these.”"},{"type":"note reference","text":"2"},{"type":"header","text":"The Throne Room"},{"type":"paragraph break"},{"type":"verse","text":"2 "},{"type":"paragraph break"},{"type":"verse","text":"And immediately I was in spirit,"},{"type":"paragraph break"},{"type":"note reference","text":"3 "},{"type":"paragraph break"},{"type":"verse","text":"and there, a throne set in heaven (and One sitting"},{"type":"verse","text":"on the throne) 3 similar in appearance to a stone,"},{"type":"note reference","text":"4 "},{"type":"verse","text":"jasper and carnelian, and "},{"type":"verse","text":"there was "},{"type":"verse","text":"a"},{"type":"verse","text":"rainbow around the throne, similar in appearance to an emerald. 4 And around the throne"},{"type":"verse","text":"were twenty-four thrones, and on the thrones I saw the twenty-four elders sitting,"},{"type":"note reference","text":"5 "},{"type":"verse","text":"clothed"},{"type":"verse","text":"in white robes and golden crowns on their heads."},{"type":"note reference","text":"6 "},{"type":"verse","text":"5 And out of the throne came lightnings"},{"type":"verse","text":"and noises and thunders; and seven lamps of fire were burning before His throne, which are"},{"type":"verse","text":"seven spirits"},{"type":"note reference","text":"7 "},{"type":"verse","text":"of God; 6 and before the throne it was like a sea of glass, similar to crystal."},{"type":"header","text":"The four living beings"},{"type":"paragraph break"},{"type":"verse","text":"And in the midst of the throne and around the throne were four living beings full of"},{"type":"verse","text":"eyes, front and back. 7 The first living being was similar to a lion, the second living being was"},{"type":"verse","text":"similar to a calf, the third living being had a face like a man, and the fourth living being was"},{"type":"verse","text":"similar to a flying eagle. 8 And the four living beings, each one of them, having six wings"},{"type":"verse","text":"apiece, were full of eyes around and within."},{"type":"note reference","text":"8 "},{"type":"verse","text":"And they take no rest, day or night, saying:"},{"type":"note reference","text":"9"},{"type":"verse","text":"“Holy, holy, holy; Holy, holy, holy; Holy, holy, holy;"},{"type":"note reference","text":"10 "},{"type":"verse","text":"The Lord God Almighty; He who was and"},{"type":"verse","text":"who is and who is coming!”"},{"type":"header","text":"The twenty-four elders"},{"type":"paragraph break"},{"type":"verse","text":"9 "},{"type":"paragraph break"},{"type":"verse","text":"And whenever the living beings ascribe glory and honor and thanksgiving to Him"},{"type":"verse","text":"who sits on the throne, to Him who lives forever and ever, 10 the twenty-four elders fall"},{"type":"verse","text":"down before Him who sits on the throne and worship Him who lives forever and ever, and"},{"type":"verse","text":"they cast their crowns before the throne saying: 11 “You are worthy, our Lord and God, the"},{"type":"note","text":"that we are supposed to be conducting ourselves on the basis of our position in Christ, on the basis of His"},{"type":"note","text":"victory and authority—maybe this has something to do with ‘overcoming’."},{"type":"note number","text":"1 "},{"type":"note","text":"This is a reference to 1:10 above, so it is the glorified Christ who is speaking—He is continuing His"},{"type":"note","text":"communicating (see 1:1), only now He is speaking from Heaven."},{"type":"note number","text":"2 "},{"type":"note","text":"“After these” opens and closes the verse. ‘These’ is a pronoun, so what is its antecedent? Presumably the"},{"type":"note","text":"churches described in chapters 2 and 3 (“the things that are” referred to in 1:19). Does “after” the churches"},{"type":"note","text":"imply that they are off the scene?"},{"type":"note number","text":"3 "},{"type":"note","text":"Compare 1:10. The Voice commanded him to “come up here”—it was something John had to do; I take it that"},{"type":"note","text":"his spirit was transported to heaven. (Consider Jesus—Matthew 17:25, John 1:48; Paul—1 Corinthians 5:3-4,"},{"type":"note","text":"Colossians 2:5; Elisha—2 Kings 5:26, 6:12.)"},{"type":"note number","text":"4 "},{"type":"note","text":"The throne, not the One. 15% of the Greek manuscripts do have the One looking like a stone, but I judge that"},{"type":"note","text":"the 85% are correct."},{"type":"note number","text":"5 "},{"type":"note","text":"Why do we have “the” twenty-four elders the first time they are mentioned? I take it that John found them to"},{"type":"note","text":"be especially impressive or interesting (perhaps he identified with them)."},{"type":"note number","text":"6 "},{"type":"note","text":"Might this picture have any connection with the promise in 3:21 above?"},{"type":"note number","text":"7 "},{"type":"note","text":"There is no definite article with “seven spirits”. I doubt that they represent the Holy Spirit."},{"type":"note number","text":"8 "},{"type":"note","text":"The picture seems to be that the throne was not solid—the living beings moved in, through and around it; and"},{"type":"note","text":"they themselves were translucent—at least John could see that they had eyes inside as well as outside."},{"type":"note number","text":"9 "},{"type":"note","text":"Most of the Greek manuscripts have the elders in chorus with the living beings here, but the best line of"},{"type":"note","text":"transmission has just the living beings repeating ‘holy’ endlessly, which agrees with verse nine."},{"type":"note number","text":"10 "},{"type":"note","text":"The manuscript evidence is badly divided here, but I take it that two of the tree main lines of independent"},{"type":"note","text":"transmission, including the best one, have “holy” nine times, instead of three. Surely it is more likely that"},{"type":"note","text":"‘nine’ would be changed to ‘three’ than vice versa. In fact, try reading “holy” nine times in a row out loud—it"},{"type":"note","text":"starts to get uncomfortable! Since in the context the living ones are repeating themselves endlessly, the ‘nine’"},{"type":"note","text":"is both appropriate and effective. Three ‘holies’ for each member of the Trinity."},{"type":"UNKNOWN","text":"8"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"Holy One,"},{"type":"note reference","text":"1 "},{"type":"verse","text":"to receive the glory and the honor and the power, because You created all things,"},{"type":"verse","text":"and by Your will they exist and were created!”"},{"type":"header","text":"The Lamb takes the scroll"},{"type":"chapter number","text":"5"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"And I saw upon the right hand of Him who sat on the throne a scroll, written"},{"type":"verse","text":"inside and outside, sealed with seven seals."},{"type":"note reference","text":"2 "},{"type":"verse","text":"2 And I saw a strong angel proclaiming with a"},{"type":"verse","text":"loud voice, “Who is worthy to open the scroll and to break its seals?” 3 And no one in heaven"},{"type":"verse","text":"or on earth or under the earth was able to open the scroll or to look at it. 4 And I began to"},{"type":"verse","text":"really weep, because no one was found worthy to open and read the scroll, or to look at it."},{"type":"paragraph break"},{"type":"verse","text":"5 So one of the elders says to me: “Stop weeping! Look! The Lion of the tribe of Judah,"},{"type":"verse","text":"the Root of David, has prevailed to open the scroll and its seven seals.” 6 And I saw in the"},{"type":"verse","text":"midst of the throne and of the four living beings, and in the midst of the elders, a Lamb"},{"type":"verse","text":"standing"},{"type":"note reference","text":"3"},{"type":"verse","text":"—as if slaughtered, having seven horns and seven eyes, which"},{"type":"note reference","text":"4 "},{"type":"verse","text":"are the seven spirits"},{"type":"verse","text":"of God sent out into all the earth. 7 And He went and took it out of the right hand of the One"},{"type":"verse","text":"sitting on the throne!"},{"type":"header","text":"A new song"},{"type":"paragraph break"},{"type":"verse","text":"8 "},{"type":"paragraph break"},{"type":"verse","text":"And when He took the scroll the four living beings and the twenty-four elders fell"},{"type":"verse","text":"down before the Lamb, each having harps and golden bowls full of incenses, which are the"},{"type":"verse","text":"prayers of the saints."},{"type":"note reference","text":"5 "},{"type":"verse","text":"9 And they sing a new song saying: “You are worthy to take the scroll"},{"type":"verse","text":"and to open its seals; because You were slaughtered, and have redeemed us"},{"type":"note reference","text":"6 "},{"type":"verse","text":"to God by your"},{"type":"verse","text":"blood out of every tribe and language and people and ethnic nation; 10 and You have made"},{"type":"verse","text":"them"},{"type":"note reference","text":"7 "},{"type":"verse","text":"kings and priests to our God, and they will reign on the earth.”"},{"type":"header","text":"All the angels"},{"type":"paragraph break"},{"type":"verse","text":"11 "},{"type":"paragraph break"},{"type":"verse","text":"And I looked, and I heard as it were the voice of many angels, around the throne"},{"type":"verse","text":"and the living beings and the elders. And their number was ten thousand times ten thousand"},{"type":"verse","text":"and a thousand thousands,"},{"type":"note reference","text":"8 "},{"type":"verse","text":"12 saying with a great voice: “Worthy is the Lamb who was"},{"type":"verse","text":"slaughtered to receive the power and wealth and wisdom and strength and honor and glory"},{"type":"verse","text":"and blessing!”"},{"type":"note reference","text":"9"},{"type":"header","text":"Every creature"},{"type":"note number","text":"1 "},{"type":"note","text":"‘O Lord’ as in KJV is found in a very few late manuscripts. Almost all Greek manuscripts have the words “Lord”,"},{"type":"note","text":"“God” and “our”, and some 2/3 of them (including the best group) have “the Holy One”."},{"type":"note number","text":"2 "},{"type":"note","text":"Again, how did John know that the scroll was written on both sides if it was closed? And where were the seals,"},{"type":"note","text":"all on the outside? It appears that the scroll also was not solid, or else John had laser vision."},{"type":"note number","text":"3 "},{"type":"note","text":"The Lamb is a Lion; the Lion is a Lamb. I would say that the Lamb characterizes Christ in His first advent to this"},{"type":"note","text":"earth, while the Lion characterizes His second advent."},{"type":"note number","text":"4 "},{"type":"note","text":"In about ¾ of the Greek manuscripts, including the best group, the gender of this relative pronoun agrees with"},{"type":"note","text":"“horns” (neuter) and not “eyes” (masculine). Perhaps the spirits were represented by both the horns and the"},{"type":"note","text":"eyes, possibly referring to power and knowledge."},{"type":"note number","text":"5 "},{"type":"note","text":"They all fell down, but I gather that it was the elders who had harps and bowls and sang the new song (the"},{"type":"note","text":"four are saying “Holy, holy” all the time)."},{"type":"note number","text":"6 "},{"type":"note","text":"Every Greek manuscript except one, of inferior quality, reads “us”. Many modern versions follow that lone"},{"type":"note","text":"manuscript and omit the pronoun, but that leaves the transitive verb “redeem” without a direct object, so"},{"type":"note","text":"they usually supply “men” or some such thing. But the true reading is obviously “us”, so the 24 elders are"},{"type":"note","text":"among the redeemed, and they are already in heaven wearing crowns."},{"type":"note number","text":"7 "},{"type":"note","text":"A very few late Greek manuscripts read ‘us’, as in KJV, but almost all the manuscripts read “them”. The 24"},{"type":"note","text":"elders exclude themselves when it comes to reigning on the earth—evidently they will not be involved in the"},{"type":"note","text":"administration of the Millennial Messianic Kingdom."},{"type":"note number","text":"8 "},{"type":"note","text":"10,000 x 10,000 = 100,000,000, so the good angels are over 100 million. If we understand correctly from"},{"type":"note","text":"Revelation 12:4 that a third of the original angels followed Lucifer in his rebellion, that means that there are"},{"type":"note","text":"some 50 million demons out there. Good grief!"},{"type":"note number","text":"9 "},{"type":"note","text":"A list of seven; what else could we add?"},{"type":"UNKNOWN","text":"9"},{"type":"UNKNOWN","text":"Revelation"},{"type":"paragraph break"},{"type":"verse","text":"13 "},{"type":"paragraph break"},{"type":"verse","text":"And every creature which is in the heaven and upon the earth and under the earth,"},{"type":"verse","text":"and upon the sea (the existing "},{"type":"verse","text":"places "},{"type":"verse","text":"and the creatures in them)—I heard them all"},{"type":"note reference","text":"1 "},{"type":"verse","text":"saying:"},{"type":"verse","text":"“To Him who sits upon the throne and to the Lamb: the blessing and the honor and the glory"},{"type":"verse","text":"and the power for ever and ever! Amen!!” 14 (It was the four living beings saying the"},{"type":"verse","text":"“Amen”.) And the elders fell and did obeisance."},{"type":"note reference","text":"2"},{"type":"header","text":"The Lamb opens the seals"},{"type":"header","text":"The first seal"},{"type":"chapter number","text":"6"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"And I saw that the Lamb opened one of the seven seals, and I heard one of the"},{"type":"verse","text":"four living beings saying, like a voice of thunder, “Come!”"},{"type":"note reference","text":"3 "},{"type":"verse","text":"2 And I looked and, wow, a white"},{"type":"verse","text":"horse!"},{"type":"note reference","text":"4 "},{"type":"verse","text":"And he who sat on it had a bow. And a crown was given to him; and he went out"},{"type":"verse","text":"conquering, that is, in order to conquer."},{"type":"header","text":"The second seal"},{"type":"paragraph break"},{"type":"verse","text":"3 "},{"type":"paragraph break"},{"type":"verse","text":"And when He opened the second seal I heard the second living being saying,"},{"type":"verse","text":"“Come!”"},{"type":"note reference","text":"5 "},{"type":"verse","text":"4 And another horse went out, fiery red, and it was granted to him who sat on it to"},{"type":"verse","text":"take the peace from the earth, so that they would slaughter each other; also, a huge sword"},{"type":"verse","text":"was given to him."},{"type":"header","text":"The third seal"},{"type":"paragraph break"},{"type":"verse","text":"5 "},{"type":"paragraph break"},{"type":"verse","text":"And when He opened the third seal I heard the third living being saying, “Come!”"},{"type":"verse","text":"And I looked and, wow, a black horse! And he who sat on it had a pair of scales in his hand."},{"type":"verse","text":"6 And I heard a voice in the midst of the four living beings saying: “A ‘quart’ of wheat for a"},{"type":"verse","text":"denarius"},{"type":"note reference","text":"6 "},{"type":"verse","text":"and three ‘quarts’ of barley for a denarius; but do not harm the olive oil and the"},{"type":"verse","text":"wine.”"},{"type":"note reference","text":"7"},{"type":"header","text":"The fourth seal"},{"type":"paragraph break"},{"type":"verse","text":"7 "},{"type":"paragraph break"},{"type":"verse","text":"And when He opened the fourth seal I heard a voice from the fourth living being"},{"type":"verse","text":"saying, “Come!” 8 And I looked and, wow, a sickly pale horse! And as for the one sitting upon"},{"type":"verse","text":"it, his name is Death, and Hades follows with him."},{"type":"note reference","text":"8 "},{"type":"verse","text":"And authority was given to him"},{"type":"note reference","text":"9 "},{"type":"verse","text":"over a"},{"type":"verse","text":"fourth of the earth, to kill by sword and by famine and by death, also by the wild animals of"},{"type":"verse","text":"the earth."},{"type":"note reference","text":"10"},{"type":"header","text":"The fifth seal"},{"type":"paragraph break"},{"type":"verse","text":"9 "},{"type":"paragraph break"},{"type":"verse","text":"And when He opened the fifth seal I saw underneath the altar the souls of the"},{"type":"verse","text":"people who had been slaughtered on account of the Word of God and on account of the"},{"type":"note number","text":"1 "},{"type":"note","text":"“Every creature” presumably must include more than men and angels; I take it that all mammals, at least (they"},{"type":"note","text":"have soul), including those in the sea (dolphins, whales), and quite possibly birds (eagles) will participate."},{"type":"note number","text":"2 "},{"type":"note","text":"The living beings and the elders were prostrating themselves and getting up repeatedly."},{"type":"note number","text":"3 "},{"type":"note","text":"The evidence is badly divided here, but I take it that two of the three main independent lines of transmission,"},{"type":"note","text":"including the best one, read as I have translated. The “Come!” was directed to the horse, not to John (since he"},{"type":"note","text":"was right there, there would be no need to address him with a thunderous roar). The same comment applies"},{"type":"note","text":"in verses 5 and 7."},{"type":"note number","text":"4 "},{"type":"note","text":"You had better believe that that was some horse!"},{"type":"note number","text":"5 "},{"type":"note","text":"Over 80% of the Greek manuscripts do not have “and see”, as in KJV. Each of the living beings called out a"},{"type":"note","text":"horse, saying to it, “Come!”"},{"type":"note number","text":"6 "},{"type":"note","text":"A denarius was the daily wage for manual labor. To work a full day for a quart of wheat means bare survival."},{"type":"note number","text":"7 "},{"type":"note","text":"Perhaps the oil and wine are spared for their medicinal value."},{"type":"note number","text":"8 "},{"type":"note","text":"The Text does not say that Hades was on a horse. John is stating a fact of human existence: Hades follows"},{"type":"note","text":"death—so it has been for 6,000 years."},{"type":"note number","text":"9 "},{"type":"note","text":"Less than 30% of the Greek manuscripts read ‘them’ for “him”, but they are followed by most (if not all)"},{"type":"note","text":"versions in English. However, it is Death that does the killing; Hades just collects the dead. The 70% are"},{"type":"note","text":"doubtless correct (involving two of the three main independent lines of transmission, including the best one)."},{"type":"note number","text":"10 "},{"type":"note","text":"‘The four horsemen of the Apocalypse’ have received quite a bit of press, off and on, but they are just the"},{"type":"note","text":"opening gambit. The really heavy stuff comes later."},{"type":"UNKNOWN","text":"10"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"testimony of the Lamb which they held."},{"type":"note reference","text":"1 "},{"type":"verse","text":"10 And they cried out with a loud voice saying:"},{"type":"verse","text":"“How long, O Sovereign, Holy and True, until You judge and avenge our blood on those who"},{"type":"verse","text":"dwell on the earth?” 11 So a white robe was given to each of them, and they were told that"},{"type":"verse","text":"they should rest a while longer, until both their fellow slaves and their brothers,"},{"type":"note reference","text":"2 "},{"type":"verse","text":"who were"},{"type":"verse","text":"about to be killed just like they were, should complete "},{"type":"verse","text":"the number"},{"type":"verse","text":"."},{"type":"header","text":"The sixth seal"},{"type":"paragraph break"},{"type":"verse","text":"12 "},{"type":"paragraph break"},{"type":"verse","text":"And I saw, just when He opened the sixth seal—there was a severe earthquake,"},{"type":"verse","text":"and the sun became black as sackcloth of hair, and the moon became like blood. 13 And the"},{"type":"verse","text":"stars of heaven fell to the earth,"},{"type":"note reference","text":"3 "},{"type":"verse","text":"like a fig tree drops its late figs when shaken by a strong"},{"type":"verse","text":"wind. 14 And the sky was split, like a scroll being rolled up, and every mountain and island"},{"type":"verse","text":"was moved out of its place."},{"type":"note reference","text":"4"},{"type":"paragraph break"},{"type":"verse","text":"15 And the kings of the earth and the magnates and the generals and the rich and the"},{"type":"verse","text":"mighty, and every slave and every free man, hid themselves in the caves and among the"},{"type":"verse","text":"rocks of the mountains."},{"type":"note reference","text":"5 "},{"type":"verse","text":"16 And they said to the mountains and the rocks: “Fall on us and"},{"type":"verse","text":"hide us from the face of Him who sits on the throne and from the wrath of the Lamb!"},{"type":"verse","text":"17 Because the great day of His wrath has come, and who is able to stand?”"},{"type":"note reference","text":"6"},{"type":"header","text":"Parenthesis"},{"type":"header","text":"The sealed of Israel"},{"type":"chapter number","text":"7"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"And after this"},{"type":"paragraph break"},{"type":"note reference","text":"7 "},{"type":"paragraph break"},{"type":"verse","text":"I saw four angels standing on the four corners of the earth,"},{"type":"paragraph break"},{"type":"note reference","text":"8"},{"type":"verse","text":"holding the four winds of the earth, so that no wind should blow upon the earth, nor on the"},{"type":"verse","text":"sea, nor on any tree. 2 And I saw another angel ascending from the sun’s rising, having the"},{"type":"verse","text":"seal of the Living God. And he cried out with a loud voice to the four angels, to whom it had"},{"type":"verse","text":"been granted to harm the earth and the sea, 3 saying: “Do not harm the earth, nor the sea"},{"type":"verse","text":"nor the trees, until we have sealed the slaves of our God on their foreheads.” 4 And I heard"},{"type":"verse","text":"the number of those who were sealed, one hundred and forty four thousand, sealed out of"},{"type":"verse","text":"every tribe of the sons of Israel: 5 From the tribe of Judah twelve thousand were sealed, from"},{"type":"verse","text":"the tribe of Reuben twelve thousand, from the tribe of Gad twelve thousand, 6 from the tribe"},{"type":"verse","text":"of Asher twelve thousand, from the tribe of Naphtali twelve thousand, from the tribe of"},{"type":"verse","text":"Manasseh twelve thousand, 7 from the tribe of Simeon twelve thousand, from the tribe of"},{"type":"verse","text":"Levi twelve thousand, from the tribe of Issachar twelve thousand, 8 from the tribe of Zebulon"},{"type":"note number","text":"1 "},{"type":"note","text":"These “souls” have evidently not yet been reunited with their bodies, which means that they have not"},{"type":"note","text":"participated in any resurrection, including the Rapture (see 3:10, 4:1 and 5:9). See notes at 7:13-14. “Of the"},{"type":"note","text":"people” excludes animals, that also have souls."},{"type":"note number","text":"2 "},{"type":"note","text":"“Slaves” and “brothers” evidently refer to two distinct categories of people, but I don’t know the explanation"},{"type":"note","text":"(unless ‘slaves’ refers to Israel, see 7:3 below and Galatians 4:25, in which case ‘brothers’ would refer to the"},{"type":"note","text":"Church)."},{"type":"note number","text":"3 "},{"type":"note","text":"I suppose this refers to fallen angels, since a single literal star would obliterate our planet."},{"type":"note number","text":"4 "},{"type":"note","text":"Now it starts to get heavy! I have never been in a serious earthquake, but a former colleague was, and the"},{"type":"note","text":"trauma was so severe that years later he still had trouble talking about it."},{"type":"note number","text":"5 "},{"type":"note","text":"The wrath of God is a great leveler; the social classes all of a sudden do not make much difference—they are"},{"type":"note","text":"all trying to hide."},{"type":"note number","text":"6 "},{"type":"note","text":"Note that it is the Lamb’s wrath—those who reject His sacrifice can look for wrath. Notice that there is no hint"},{"type":"note","text":"of repentance from the people."},{"type":"note number","text":"7 "},{"type":"note","text":"He saw the content of chapter seven after he saw the content of chapter six, but the events described are not"},{"type":"note","text":"necessarily in chronological order. It should not be assumed that nothing else happened between the seals, or"},{"type":"note","text":"even at the same time. However, the seals are broken in sequence."},{"type":"note number","text":"8 "},{"type":"note","text":"The Text says “the four corners” and “the four winds”. Presumably from John’s perspective the earth would"},{"type":"note","text":"look like a sphere (or a circle)—so perhaps the angels were strategically placed so as to control the whole"},{"type":"note","text":"planet. There are four basic wind patterns that influence most of the world—the north and south ‘trade"},{"type":"note","text":"winds’ and the north and south ‘prevailing westerlies’."},{"type":"UNKNOWN","text":"11"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"twelve thousand, from the tribe of Joseph"},{"type":"note reference","text":"1 "},{"type":"verse","text":"twelve thousand, from the tribe of Benjamin"},{"type":"verse","text":"twelve thousand were sealed."},{"type":"note reference","text":"2"},{"type":"header","text":"A multitude from the Great Tribulation"},{"type":"paragraph break"},{"type":"verse","text":"9 "},{"type":"paragraph break"},{"type":"verse","text":"After these things I looked, and wow, a great multitude that no one could number,"},{"type":"verse","text":"from all ethnic nations and tribes and peoples and languages, standing before the Throne"},{"type":"verse","text":"and before the Lamb, clothed with white robes and "},{"type":"verse","text":"having "},{"type":"verse","text":"palm branches in their hands."},{"type":"verse","text":"10 And they shouted with a loud voice saying, “Saved by our God who sits on the throne, and"},{"type":"verse","text":"by the Lamb!”"},{"type":"paragraph break"},{"type":"verse","text":"11 And all the angels stood around the Throne, and the elders and the four living"},{"type":"verse","text":"beings, and they fell down before the Throne, on their faces, and worshipped God, 12 saying:"},{"type":"verse","text":"“Amen! The blessing and the glory and the wisdom and the thanksgiving and the honor and"},{"type":"verse","text":"the power and the strength to our God for ever and ever! Amen.”"},{"type":"paragraph break"},{"type":"verse","text":"13 And one of the elders reacted, saying to me, “Who are these that are clothed in"},{"type":"verse","text":"the white robes,"},{"type":"note reference","text":"3 "},{"type":"verse","text":"and where did they come from?” 14 So I said to him, “My lord, you know”."},{"type":"note reference","text":"4"},{"type":"verse","text":"So he said to me: “These are those who come out of the Great Tribulation—they washed"},{"type":"verse","text":"their robes and made them white in the blood of the Lamb."},{"type":"note reference","text":"5 "},{"type":"verse","text":"15 Therefore they are before"},{"type":"verse","text":"the throne of God, and they serve Him day and night in His sanctuary."},{"type":"note reference","text":"6 "},{"type":"verse","text":"And He who sits on"},{"type":"verse","text":"the throne will shelter them. 16 They shall not hunger anymore, nor thirst anymore; the sun"},{"type":"verse","text":"will absolutely not strike them, nor any heat; 17 because the Lamb who is in the midst of the"},{"type":"verse","text":"throne shepherds them and leads them to springs of waters"},{"type":"note reference","text":"7 "},{"type":"verse","text":"of life. And God will wipe away"},{"type":"verse","text":"every tear from their eyes.”"},{"type":"note reference","text":"8"},{"type":"header","text":"The seventh seal"},{"type":"chapter number","text":"8"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"And when He opened the seventh seal there was a stillness in heaven for about"},{"type":"verse","text":"half an hour."},{"type":"note reference","text":"9 "},{"type":"verse","text":"2 And I saw the seven angels who stood before God, and seven trumpets were"},{"type":"verse","text":"given to them."},{"type":"note reference","text":"10"},{"type":"note number","text":"1 "},{"type":"note","text":"“Joseph” stands for Ephraim. Since Levi is counted here (usually he isn’t) and Joseph has two tribes, Manasseh"},{"type":"note","text":"and Ephraim, someone has to be dropped—Dan. From both Jacob (Genesis 49:16-17) and Moses"},{"type":"note","text":"(Deuteronomy 33:22) he got the least impressive ‘blessing’."},{"type":"note number","text":"2 "},{"type":"note","text":"Linguistically speaking, in terms of the norms of language, a phrase like “the tribe of Asher” can only have one"},{"type":"note","text":"meaning, precisely the meaning that it has everywhere else in the Bible. Ezekiel chapter 37 makes very clear"},{"type":"note","text":"that ‘the ten lost tribes’ are not lost at all—God knows exactly who and where they are, and at the right"},{"type":"note","text":"moment they will be restored."},{"type":"note number","text":"3 "},{"type":"note","text":"I take it that we should refer back to the fifth seal, 6:11—in that event those martyrs were also killed during"},{"type":"note","text":"the Great Tribulation, just earlier on. Perhaps at this point (7:13) the pre-determined number of martyrs is"},{"type":"note","text":"now complete (in 6:11 it was not)."},{"type":"note number","text":"4 "},{"type":"note","text":"John understands that the elder is offering information and tells him to go ahead."},{"type":"note number","text":"5 "},{"type":"note","text":"Assuming a pre-Abomination-of-Desolation rapture of the Church (because of the surprise factor, but see the"},{"type":"note","text":"note at 2 Thessalonians 2:2), I take it that multiplied millions of church members will be left behind—they"},{"type":"note","text":"knew the Gospel but were never really regenerated. When they see that they have been left behind they will"},{"type":"note","text":"fall on their faces before God saying: “Oh Lord, have mercy; if I never believed before I do now!” There will be"},{"type":"note","text":"many millions of conversions in the first hours after the Rapture. People were saved in the OT without the"},{"type":"note","text":"indwelling Holy Spirit, and they will be too. But they will have to face the Beast and most of them will be"},{"type":"note","text":"martyred. Notice that they say, “Saved by our God . . . , and by the Lamb.” Apparently there is a sovereign act"},{"type":"note","text":"of God (the Father) involved here, with the blood of the Lamb as the basis."},{"type":"note number","text":"6 "},{"type":"note","text":"How does one “serve” in this sanctuary? I suppose by worship and praise."},{"type":"note number","text":"7 "},{"type":"note","text":"That is what the Text says, “waters”, plural. Might there be different kinds of water, or just different sources?"},{"type":"note number","text":"8 "},{"type":"note","text":"To do this, will He also remove the memories that bring the tears?"},{"type":"note number","text":"9 "},{"type":"note","text":"A ‘deafening’ silence! I wonder why. Well, there has been a lot of noise up to this point, and there will be"},{"type":"note","text":"plenty more later, so the silence acts as an emphasis by contrast. The outpouring of wrath will now build to a"},{"type":"note","text":"crescendo."},{"type":"note number","text":"10 "},{"type":"note","text":"One gains the clear impression that the seven trumpets form the content of the seventh seal."},{"type":"UNKNOWN","text":"12"},{"type":"UNKNOWN","text":"Revelation"},{"type":"paragraph break"},{"type":"verse","text":"3 And another angel came and stood at the altar, having a golden censer."},{"type":"paragraph break"},{"type":"note reference","text":"1 "},{"type":"paragraph break"},{"type":"verse","text":"He was"},{"type":"verse","text":"given lots of incense so that he could offer it with the prayers of all the saints upon the"},{"type":"verse","text":"golden altar that is before the throne. 4 And the smoke of the incense with the prayers of the"},{"type":"verse","text":"saints went up before God out of the angel’s hand. 5 Then the angel took the censer, filled it"},{"type":"verse","text":"with fire from the altar, and threw it at the earth. And there were noises and thunders and"},{"type":"verse","text":"lightnings and an earthquake. 6 And the seven angels who had the seven trumpets prepared"},{"type":"verse","text":"themselves to trumpet."},{"type":"header","text":"The first trumpet"},{"type":"paragraph break"},{"type":"verse","text":"7 "},{"type":"paragraph break"},{"type":"verse","text":"So the first one trumpeted, and there appeared hail and fire mixed with blood, and"},{"type":"verse","text":"it [the mixture] was thrown at the earth, and a third of the earth was burned up; that is, a"},{"type":"verse","text":"third of the trees was burned up and all green grass was burned up."},{"type":"header","text":"The second trumpet"},{"type":"paragraph break"},{"type":"verse","text":"8 "},{"type":"paragraph break"},{"type":"verse","text":"So the second angel trumpeted, and something like a great burning mountain was"},{"type":"verse","text":"thrown into the sea, and a third of the sea became blood. 9 And a third of the creatures with"},{"type":"verse","text":"souls"},{"type":"note reference","text":"2 "},{"type":"verse","text":"in the sea died. And a third of the ships were destroyed."},{"type":"header","text":"The third trumpet"},{"type":"paragraph break"},{"type":"verse","text":"10 "},{"type":"paragraph break"},{"type":"verse","text":"So the third angel trumpeted, and a great star fell out of the sky, burning like a"},{"type":"verse","text":"torch, and it fell upon a third of the rivers, and on the springs of waters."},{"type":"note reference","text":"3 "},{"type":"verse","text":"11 The name of the"},{"type":"verse","text":"star is called Wormwood; so a third of the waters were turned into wormwood, and many"},{"type":"verse","text":"people died from the waters because they were made bitter."},{"type":"header","text":"The fourth trumpet"},{"type":"paragraph break"},{"type":"verse","text":"12 "},{"type":"paragraph break"},{"type":"verse","text":"So the fourth angel trumpeted, and a third of the sun was struck, and a third of the"},{"type":"verse","text":"moon, and a third of the stars, so that a third of them was darkened; so a third of the day did"},{"type":"verse","text":"not shine, and the night likewise."},{"type":"paragraph break"},{"type":"verse","text":"13 And I saw and heard an eagle"},{"type":"paragraph break"},{"type":"note reference","text":"4 "},{"type":"paragraph break"},{"type":"verse","text":"flying in mid-heaven saying with a loud voice, three"},{"type":"verse","text":"times: “Woe, woe, woe to the inhabitants of the earth because of the remaining trumpet"},{"type":"verse","text":"blasts of the three angels who are about to trumpet!”"},{"type":"verse","text":"[The "},{"type":"note","text":"fifth "},{"type":"verse","text":"trumpet]"},{"type":"chapter number","text":"9"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"So the fifth angel trumpeted, and I saw a ‘star’"},{"type":"paragraph break"},{"type":"note reference","text":"5 "},{"type":"paragraph break"},{"type":"verse","text":"that had fallen out of the sky to"},{"type":"verse","text":"the earth. And to him was given the key to the shaft of the Abyss."},{"type":"note reference","text":"6 "},{"type":"verse","text":"2 So he opened the shaft"},{"type":"verse","text":"of the Abyss and smoke went up out of the shaft, like the smoke of a burning furnace; and"},{"type":"verse","text":"the sun and the air were darkened because of the smoke from the shaft. 3 And ‘locusts’"},{"type":"verse","text":"exited from the smoke into the earth. And to them was given a capability just like the"},{"type":"verse","text":"scorpions of the earth have capability. 4 And they were told not to harm the grass of the"},{"type":"verse","text":"earth, nor any green "},{"type":"verse","text":"plant"},{"type":"verse","text":", nor any tree, but only those men who do not have the seal of God"},{"type":"verse","text":"on their foreheads. 5 And it was designated to them [locusts], not to kill them [men] but, to"},{"type":"verse","text":"torment them five months. And their torment is like the torment of a scorpion whenever it"},{"type":"note number","text":"1 "},{"type":"note","text":"See Hebrews 8:5."},{"type":"note number","text":"2 "},{"type":"note","text":"That is what the Text says. Just as food for thought, I would suggest that God is Spirit and has soul; a human is"},{"type":"note","text":"soul and has spirit; an angel is spirit with no soul; an animal is soul with no spirit; insects and lower forms have"},{"type":"note","text":"neither. I imagine that the reference here is to mammals in the sea (like dolphins)."},{"type":"note number","text":"3 "},{"type":"note","text":"If the springs are hit, does that include the aquifers that supply their water? If so, a third of the sweet water on"},{"type":"note","text":"the earth is ruined."},{"type":"note number","text":"4 "},{"type":"note","text":"Over 2/3 of the Greek manuscripts, including the best group, read “eagle” rather than ‘angel’. Since the fourth"},{"type":"note","text":"living being is similar to a flying eagle, the idea here is not new."},{"type":"note number","text":"5 "},{"type":"note","text":"Presumably an angel, and of considerable rank."},{"type":"note number","text":"6 "},{"type":"note","text":"The Greek word appears to be composed of two morphemes, “no-depth”. Since it is a shaft or pit we"},{"type":"note","text":"presumably should understand no known or measured depth, hence ‘bottomless’. Literally, “the shaft of the"},{"type":"note","text":"no-bottom”; the familiar ‘bottomless pit’ is not a bad rendering. Since the word “abyss” occurs elsewhere"},{"type":"note","text":"without the “shaft/pit” (see verse 11, also Luke 8:31) I prefer to take it as a proper name."},{"type":"UNKNOWN","text":"13"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"strikes a person. 6 And in those days the people will seek death but not find it; they will want"},{"type":"verse","text":"to die but death will run away from them."},{"type":"note reference","text":"1"},{"type":"paragraph break"},{"type":"verse","text":"7 Now the appearance of the ‘locusts’"},{"type":"paragraph break"},{"type":"note reference","text":"2 "},{"type":"paragraph break"},{"type":"verse","text":"was like horses prepared for battle, and"},{"type":"verse","text":"something like a golden crown was on their heads, and their faces were like human faces."},{"type":"verse","text":"8 They had hair like a woman’s and their teeth were like a lion’s. 9 They had breastplates like"},{"type":"verse","text":"breastplates of iron and the noise of their wings was like the noise of many chariots with"},{"type":"verse","text":"horses rushing into battle. 10 And, they have tails like scorpions and stingers precisely in"},{"type":"verse","text":"those tails! They have the capability to hurt the populace five months, 11 having as king over"},{"type":"verse","text":"them the angel of the Abyss—his name in Hebrew is Abbaddon, while in Greek he has the"},{"type":"verse","text":"name Apollyon."},{"type":"note reference","text":"3"},{"type":"paragraph break"},{"type":"verse","text":"12 The first woe is past, but, two woes are still coming, after these things."},{"type":"header","text":"The sixth trumpet"},{"type":"paragraph break"},{"type":"verse","text":"13 "},{"type":"paragraph break"},{"type":"verse","text":"So the sixth angel trumpeted, and I heard a voice from the four horns of the golden"},{"type":"verse","text":"altar"},{"type":"note reference","text":"4 "},{"type":"verse","text":"that is before God 14 saying to the sixth angel who had the trumpet, “Release the four"},{"type":"verse","text":"angels who are bound at the great river Euphrates”. 15 So the four angels were released—"},{"type":"verse","text":"they had been prepared for the hour and the day and month and year—so that they might"},{"type":"verse","text":"kill a third of mankind. 16 And the number of the mounted troops was a hundred million"},{"type":"note reference","text":"5 "},{"type":"verse","text":"(I"},{"type":"verse","text":"heard their number). 17 And in the vision I saw the horses like this: those who rode them had"},{"type":"verse","text":"breastplates of fiery red, hyacinth blue and sulfur yellow; the heads of the horses were like"},{"type":"verse","text":"lions’ heads; out of their mouths came fire, smoke and brimstone. 18 By these three plagues"},{"type":"verse","text":"a third of mankind was killed—by the fire and the smoke and the brimstone that came out of"},{"type":"verse","text":"their mouths."},{"type":"note reference","text":"6 "},{"type":"verse","text":"19 For the capability of the horses is in their mouths—and in their tails,"},{"type":"verse","text":"because their tails are like snakes, having heads, and with them they do harm."},{"type":"paragraph break"},{"type":"verse","text":"20 Yet the rest of the people, those who were not killed by these plagues, did not"},{"type":"verse","text":"repent of the works of their hands, so as to stop worshipping the demons, even the idols"},{"type":"note reference","text":"7 "},{"type":"verse","text":"of"},{"type":"verse","text":"gold, silver, bronze, stone and wood, which can neither see nor hear nor walk; 21 and they"},{"type":"verse","text":"did not repent of their murders or their sorceries or their fornication or their thefts."},{"type":"note reference","text":"8"},{"type":"note number","text":"1 "},{"type":"note","text":"It will not be a good time to be on the earth!"},{"type":"note number","text":"2 "},{"type":"note","text":"Evidently these are not the literal insect, but the insect came in clouds (millions of them) and was a terrible"},{"type":"note","text":"plague. Since they are lead by a high-ranking demon (as I suppose), they are probably demons. I associate"},{"type":"note","text":"Luke 8:31 with this passage—although the Lord evidently did not send those demons to the Abyss, that they"},{"type":"note","text":"kept begging Him not to shows that it was a very real possibility in their ‘minds’; they knew something that we"},{"type":"note","text":"don’t. I take it that the Lord did not send them to the Abyss at that point because He had not won the victory"},{"type":"note","text":"yet—Satan was still the god of this world and the demons were doing their thing under Satan’s authority. But"},{"type":"note","text":"now we are to act on the basis of that victory, on the basis of our position and authority in Christ (Ephesians"},{"type":"note","text":"2:6). So how did all those demons get into the Abyss to be available for the fifth trumpet? They got there"},{"type":"note","text":"because we sent them there! I would say that sending demons to the Abyss is one of the ‘greater’ things that"},{"type":"note","text":"the Lord Jesus said we would do (John 14:12)."},{"type":"note number","text":"3 "},{"type":"note","text":"And in English, Destroyer. “Angel” covers both good and bad—this one sounds like a boss demon."},{"type":"note number","text":"4 "},{"type":"note","text":"I find it to be curious that this voice comes from the altar [and why did the altars have horns?], which is usually"},{"type":"note","text":"associated with obtaining God’s mercy. But in this case the altar participates in the judgment."},{"type":"note number","text":"5 "},{"type":"note","text":"Some ¾ of the Greek manuscripts, including the best group, do not have ‘two’. John was given the number."},{"type":"note number","text":"6 "},{"type":"note","text":"Dear me! And I thought the ‘locusts’ were bad! Notice that it is the “horses” that do the killing, not the riders. I"},{"type":"note","text":"understand that China has over one hundred million armed militia, right now, but presumably not these"},{"type":"note","text":"‘horses’. Just as in the case of the ‘locusts’, I take it that we are looking at supernatural activity here. The"},{"type":"note","text":"population of the world is reduced by one third."},{"type":"note number","text":"7 "},{"type":"note","text":"Notice that the idols are linked to demons. Even though an image of wood presumably has no power in itself, a"},{"type":"note","text":"demon associated with it can do all sorts of damage."},{"type":"note number","text":"8 "},{"type":"note","text":"They were totally self-centered, and therefore totally evil, malignant, under demonic control; carbon copies of"},{"type":"note","text":"the devil. They are prepared to kill, steal and use witchcraft to gain their ends, with a total disregard for"},{"type":"note","text":"others. They want sexual gratification without responsibility. No matter what God does they will not repent;"},{"type":"note","text":"they are beyond fixing. I am glad I won’t be there. Oops, wait a minute! Don’t an awful lot of people in the"},{"type":"UNKNOWN","text":"14"},{"type":"UNKNOWN","text":"Revelation"},{"type":"header","text":"Parenthesis"},{"type":"header","text":"John eats a little book"},{"type":"paragraph break"},{"type":"verse","text":"("},{"type":"chapter number","text":"10"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"I saw a mighty angel descending out of heaven,"},{"type":"paragraph break"},{"type":"note reference","text":"1 "},{"type":"paragraph break"},{"type":"verse","text":"clothed with a cloud, and the"},{"type":"verse","text":"rainbow"},{"type":"note reference","text":"2 "},{"type":"verse","text":"on his head; his face was like the sun and his feet like pillars of fire;"},{"type":"note reference","text":"3 "},{"type":"verse","text":"2 and he had a"},{"type":"verse","text":"little book open in his hand. He placed his right foot on the sea and his left on the land, 3 and"},{"type":"verse","text":"he cried out with a loud voice, just like a lion roars. And when he cried out, the seven"},{"type":"verse","text":"thunders uttered their own voices."},{"type":"note reference","text":"4 "},{"type":"verse","text":"4 Now when the seven thunders spoke I was about to"},{"type":"verse","text":"write, but I heard a voice out of heaven saying, “Seal up the things that the seven thunders"},{"type":"verse","text":"said”, and “You write after these things”."},{"type":"note reference","text":"5 "},{"type":"verse","text":"5 And the angel whom I saw standing on the sea"},{"type":"verse","text":"and on the land raised his right hand to the heaven 6 and swore by Him who lives forever and"},{"type":"verse","text":"ever, who created the heaven and the things in it, and the earth and the things in it, and the"},{"type":"verse","text":"sea and the things in it, that there would be no further delay, 7 but in the days"},{"type":"note reference","text":"6 "},{"type":"verse","text":"of the blast of"},{"type":"verse","text":"the seventh angel, whenever he should trumpet, the mystery of God which was announced"},{"type":"verse","text":"to His slaves the prophets would be finished."},{"type":"paragraph break"},{"type":"verse","text":"8 Now the voice that I heard out of heaven was speaking to me again and saying: “Go,"},{"type":"verse","text":"take the little book that is open in the hand of the angel who is standing on the sea and on"},{"type":"verse","text":"the land.” 9 So I went to the angel and said to him, “Give me the little book”, and he says to"},{"type":"verse","text":"me: “Take and eat it up; it will make your stomach bitter, but in your mouth it will be as"},{"type":"verse","text":"sweet as honey.” 10 So I took the little book out of the angel’s hand and ate it up, and it was"},{"type":"verse","text":"as sweet as honey in my mouth. But when I had eaten it my stomach was made bitter."},{"type":"verse","text":"11 And he said to me, “You must prophesy again over many peoples, even over ethnic"},{"type":"verse","text":"nations and languages and kings.”"},{"type":"note reference","text":"7"},{"type":"header","text":"The two witnesses"},{"type":"chapter number","text":"11"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"I was given a reed like a measuring rod. And the angel stood"},{"type":"paragraph break"},{"type":"note reference","text":"8 "},{"type":"paragraph break"},{"type":"verse","text":"saying: “Rise and"},{"type":"verse","text":"measure the temple of God and the altar, and those who worship there. 2 But leave out the"},{"type":"verse","text":"outer court of the temple and do not measure it, because it has been given to the nations;"},{"type":"note","text":"world today (especially in Europe and North America) already answer to this description? They have been"},{"type":"note","text":"brought up on evolutionistic, relativistic humanism; they have been taught that they are gods, to ‘do your own"},{"type":"note","text":"thing’. Hey, if we are not already there I reckon we are well on the way! A recent study found that most young"},{"type":"note","text":"people in America today are narcissists."},{"type":"note number","text":"1 "},{"type":"note","text":"John is evidently back on earth at this point."},{"type":"note number","text":"2 "},{"type":"note","text":"That is what the Text says, “the” rainbow; our rainbows are caused by the sun shining through rain, which was"},{"type":"note","text":"not the case here—perhaps God has a prototype."},{"type":"note number","text":"3 "},{"type":"note","text":"Does the description remind you of anyone?"},{"type":"note number","text":"4 "},{"type":"note","text":"That is what the Text says, the seven thunders, and each had a voice and could speak intelligible words."},{"type":"note","text":"Obviously these “thunders” exist quite apart from climactic conditions on earth. Interesting! (I suspect that"},{"type":"note","text":"what we don’t know exceeds what we think we do know, and by a considerable margin.)"},{"type":"note number","text":"5 "},{"type":"note","text":"The evidence is divided here, but I take it that two of the three main independent lines of transmission,"},{"type":"note","text":"including the best group, have “You write after these things” rather than ‘do not write them’. This text has"},{"type":"note","text":"been generally misunderstood since the beginning. Having been told to seal what the thunders uttered, why"},{"type":"note","text":"would John be told he would write it later? So many copyists altered the text, reinforcing the prohibition."},{"type":"note","text":"However, I take it that the voice was giving two unrelated instructions: not to record the thunders; and to put"},{"type":"note","text":"his notebook aside until later—he is going to be busy interacting with the angel and eating a book, and the"},{"type":"note","text":"voice does not want him to be distracted by trying to write at the same time."},{"type":"note number","text":"6 "},{"type":"note","text":"“The days”—the events associated with a given trumpet (and probably seal and bowl) cover a period of time;"},{"type":"note","text":"they are not instantaneous."},{"type":"note number","text":"7 "},{"type":"note","text":"The action in verses 9-11 is presumably symbolic, but of what? Like why was the little book open, and why the"},{"type":"note","text":"stomach ache, etc.? I imagine that the book contained the prophecy mentioned by the angel, and being open"},{"type":"note","text":"would indicate that the prophecy was to be understandable. The book inside John suggests inspiration to me,"},{"type":"note","text":"and the terms of the prophecy would be mainly bitter."},{"type":"note number","text":"8 "},{"type":"note","text":"I get the impression that the angel shifted position, probably with both feet on land—his legs had been spread"},{"type":"note","text":"or straddled, now he stands normally."},{"type":"UNKNOWN","text":"15"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"and they will trample the holy city for forty-two months."},{"type":"note reference","text":"1 "},{"type":"verse","text":"3 And I"},{"type":"note reference","text":"2 "},{"type":"verse","text":"will give "},{"type":"verse","text":"authority "},{"type":"verse","text":"to my"},{"type":"verse","text":"two witnesses, and they will prophesy one thousand two hundred and sixty days, clothed in"},{"type":"verse","text":"sackcloth.”"},{"type":"note reference","text":"3"},{"type":"paragraph break"},{"type":"verse","text":"4 These are the two olive trees, even the two lampstands that stand before the Lord"},{"type":"verse","text":"of the earth."},{"type":"note reference","text":"4 "},{"type":"verse","text":"5 And if anyone wants to harm them fire comes out of their mouths and"},{"type":"verse","text":"consumes their enemies. So if anyone wants to harm them he must be killed in this way."},{"type":"verse","text":"6 They have authority to shut up the sky so that no rain falls during the days of their"},{"type":"verse","text":"prophecy; and they have authority over the waters to turn them into blood, and to strike the"},{"type":"verse","text":"earth with every plague, as often as they wish."},{"type":"note reference","text":"5"},{"type":"paragraph break"},{"type":"verse","text":"7 When they finish their witness, the Beast of prey that comes up out of the Abyss"},{"type":"paragraph break"},{"type":"note reference","text":"6"},{"type":"verse","text":"will make war with them, overcome them and kill them 8—and "},{"type":"verse","text":"leave "},{"type":"verse","text":"their corpses in the"},{"type":"verse","text":"street of the great city! (which is called Sodom and Egypt, spiritually speaking), even where"},{"type":"verse","text":"their"},{"type":"note reference","text":"7 "},{"type":"verse","text":"Lord was crucified."},{"type":"note reference","text":"8"},{"type":"paragraph break"},{"type":"verse","text":"9 And those from the peoples, tribes, languages and ethnic nations look at their"},{"type":"verse","text":"corpses three-and-a-half days, and will not allow their corpses to be buried."},{"type":"note reference","text":"9 "},{"type":"verse","text":"10 And those"},{"type":"verse","text":"who dwell on the earth rejoice over them, and they will enjoy themselves and send gifts to"},{"type":"verse","text":"one another, because these two prophets tormented those who dwell on the earth."},{"type":"note reference","text":"10"},{"type":"paragraph break"},{"type":"verse","text":"11 And after three-and-a-half days a breath of life from God entered them and they"},{"type":"verse","text":"stood on their feet, and a great fear fell on those who were watching them. 12 And I heard a"},{"type":"verse","text":"loud voice from the heaven saying to them, “Come up here!” And they went up to heaven in"},{"type":"verse","text":"a cloud, and their enemies watched them. 13 And in that day there was a severe earthquake"},{"type":"verse","text":"and a tenth of the city fell, and seven thousand individuals were killed in the earthquake. And"},{"type":"verse","text":"the rest became fearful and gave glory to the God of heaven."},{"type":"note reference","text":"11"},{"type":"verse","text":")"},{"type":"paragraph break"},{"type":"verse","text":"14 The second woe is past. Look out, here comes the third woe!"},{"type":"header","text":"The seventh trumpet"},{"type":"paragraph break"},{"type":"verse","text":"15 "},{"type":"paragraph break"},{"type":"verse","text":"So the seventh angel trumpeted, and there were loud voices in heaven saying:"},{"type":"verse","text":"“The kingdom of the world has become the kingdom of our Lord and of His Christ, and He"},{"type":"verse","text":"shall reign forever and ever!” 16 And the twenty-four elders, who sit on their thrones in"},{"type":"verse","text":"God’s presence, fell on their faces and worshipped God 17 saying: “We thank You, O Lord"},{"type":"note number","text":"1 "},{"type":"note","text":"Comparing forty-two months with 1,260 days we get 30-day months. A year computed on the basis of these"},{"type":"note","text":"‘prophetic’ months, as they are sometimes called, is five days shorter than a calendar year. Forty-two calendar"},{"type":"note","text":"months would give 1,277/8 days."},{"type":"note number","text":"2 "},{"type":"note","text":"Presumably the angel is still speaking—might He be God the Son? Could a mere angel say “my two witnesses”?"},{"type":"note number","text":"3 "},{"type":"note","text":"Note that their ‘ministry’ covers 3½ years; the Text does not actually say that it will be simultaneous with the"},{"type":"note","text":"trampling of the holy city, but I imagine that it will come close. When I see the perversity in the world I am"},{"type":"note","text":"sometimes tempted to wish I could do what they are going to do, until I get to the ‘sackcloth’—walking"},{"type":"note","text":"around in sackcloth for 3"},{"type":"note number","text":"1/2 "},{"type":"note","text":"years doesn’t sound like much fun."},{"type":"note number","text":"4 "},{"type":"note","text":"See Zechariah 4:3,14."},{"type":"note number","text":"5 "},{"type":"note","text":"They have the authority to do these things, but it is discretionary; it is up to them to decide when, where, and"},{"type":"note","text":"how much."},{"type":"note number","text":"6 "},{"type":"note","text":"This would seem to confirm that the “locusts” and their king, in chapter nine, are on Satan’s side. That is also"},{"type":"note","text":"where Satan will be confined during the Millennium (20:3). If this beast is not Abbaddon he is presumably"},{"type":"note","text":"another high ranking demon, or so I thought until I got to 13:1 and 17:8, which see."},{"type":"note number","text":"7 "},{"type":"note","text":"Over 99% of the Greek manuscripts have “their” Lord, not ‘our’ as in KJV and NKJV. If these two “olive trees”"},{"type":"note","text":"are the ones in Zechariah 4:3 and 14, then the “L"},{"type":"note","text":"ORD "},{"type":"note","text":"of the whole earth” there is Jehovah the Son."},{"type":"note number","text":"8 "},{"type":"note","text":"We might expect “Sodom and Egypt” to apply to Rome, rather than Jerusalem, but the Lord was crucified in"},{"type":"note","text":"Jerusalem."},{"type":"note number","text":"9 "},{"type":"note","text":"People in past generations had trouble imagining how this could happen, but with modern technology people"},{"type":"note","text":"around the world will watch those corpses."},{"type":"note number","text":"10 "},{"type":"note","text":"They will celebrate, but not for long!"},{"type":"note number","text":"11 "},{"type":"note","text":"At least they are no longer pretending that God does not exist."},{"type":"UNKNOWN","text":"16"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"God Almighty, He who is and who was and who is coming, because You have taken up your"},{"type":"verse","text":"great power and begun to reign. 18 The nations were angry and your wrath came, even the"},{"type":"verse","text":"time for the dead to be judged and to give the reward to Your slaves the prophets, and to the"},{"type":"verse","text":"saints"},{"type":"note reference","text":"1 "},{"type":"verse","text":"and those who fear your name, small and great, and to destroy those who have"},{"type":"verse","text":"corrupted the earth.”"},{"type":"note reference","text":"2 "},{"type":"verse","text":"19 And the temple of God in heaven was opened, and the ark of the"},{"type":"verse","text":"covenant"},{"type":"note reference","text":"3 "},{"type":"verse","text":"of the Lord was seen in His temple. And there were lightnings, noises, thunderings"},{"type":"verse","text":"and huge hail."},{"type":"note reference","text":"4"},{"type":"header","text":"Parenthesis—partly historical"},{"type":"header","text":"The woman, the Child, the dragon"},{"type":"chapter number","text":"12"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"A great sign appeared in the sky: a woman clothed with the sun, with the moon"},{"type":"verse","text":"under her feet, and on her head a crown of twelve stars."},{"type":"note reference","text":"5 "},{"type":"verse","text":"2 And being pregnant she was"},{"type":"verse","text":"crying out in labor, being in great pain to give birth."},{"type":"paragraph break"},{"type":"verse","text":"3 And another sign appeared in the sky: wow, a dragon, huge, fiery red, having seven"},{"type":"verse","text":"heads and ten horns, with seven diadems on his heads. 4 And its tail grabbed a third of the"},{"type":"verse","text":"stars of heaven and threw them to the earth."},{"type":"note reference","text":"6"},{"type":"paragraph break"},{"type":"verse","text":"And the dragon stood before the woman who was about to give birth in order to"},{"type":"verse","text":"devour her Child as soon as she gave birth. 5 And she bore a Son, a male,"},{"type":"note reference","text":"7 "},{"type":"verse","text":"who would"},{"type":"verse","text":"shepherd all the nations with a rod of iron."},{"type":"note reference","text":"8 "},{"type":"verse","text":"And her Child was snatched up to God, even to"},{"type":"verse","text":"His throne."},{"type":"paragraph break"},{"type":"verse","text":"6 And the woman fled into the wilderness to where she has a place prepared by God,"},{"type":"verse","text":"so that they may nourish her there one thousand two hundred and sixty days."},{"type":"note reference","text":"9"},{"type":"header","text":"Satan excluded from heaven"},{"type":"paragraph break"},{"type":"verse","text":"7 "},{"type":"paragraph break"},{"type":"verse","text":"War was declared in heaven; Michael and his angels were to wage war with the"},{"type":"verse","text":"dragon; so the dragon and his angels made war,"},{"type":"note reference","text":"10 "},{"type":"verse","text":"8 but he was not strong enough; neither"},{"type":"verse","text":"was there any place found for him in heaven any more. 9 So the great dragon was expelled,"},{"type":"verse","text":"that ancient serpent, who is called Slanderer and Satan, who deceives the whole inhabited"},{"type":"verse","text":"world; he was thrown into the earth,"},{"type":"note reference","text":"11 "},{"type":"verse","text":"and his angels were expelled with him. 10 And I heard"},{"type":"note number","text":"1 "},{"type":"note","text":"“Slaves” and “saints”—again we seem to have two distinct categories."},{"type":"note number","text":"2 "},{"type":"note","text":"One gets the impression that the elders had been waiting for this day. I think I know how they feel—the"},{"type":"note","text":"destruction of “those who have corrupted the earth” cannot come too soon to suit me."},{"type":"note number","text":"3 "},{"type":"note","text":"Presumably this is the original ark of which the one made under Moses’ supervision was a copy (Hebrews 8:5,"},{"type":"note","text":"Exodus 25:9, 40, Hebrews 9:23)."},{"type":"note number","text":"4 "},{"type":"note","text":"If this were all there was to the seventh trumpet it would be anticlimactic, ‘small potatoes’. I take it that the"},{"type":"note","text":"seven ‘bowls’ (see chapter 16) give the full content of the third woe."},{"type":"note number","text":"5 "},{"type":"note","text":"Just as Michael is the boss-angel in charge of Israel, as a nation (Dan. 10:21, 12:1), presumably each tribe has"},{"type":"note","text":"its own boss-angel (lower in rank than Michael). Assuming that the woman represents Israel, I imagine that"},{"type":"note","text":"these ‘stars’ are the tribal angels (because of the number twelve)."},{"type":"note number","text":"6 "},{"type":"note","text":"It is generally understood that this refers to those angels who joined Lucifer in his rebellion—note that verse 7"},{"type":"note","text":"refers to the dragon and his angels. If the 2/3 are over 100 million (5:11) then this 1/3 must be over 50"},{"type":"note","text":"million—more than enough trouble to go around."},{"type":"note number","text":"7 "},{"type":"note","text":"That is what the Text says. Since “Son” is obviously masculine, adding “a male” emphasizes the gender. What"},{"type":"note","text":"the first man lost the second Man (1 Corinthians 15:47) recovered; the first man allowed his wife to lead, the"},{"type":"note","text":"second Man will rule with a rod of iron."},{"type":"note number","text":"8 "},{"type":"note","text":"Here the Child is clearly identified as the Messiah—since He was born some 2,000 years ago we are obviously"},{"type":"note","text":"looking at an historical parenthesis. The rebellion of Lucifer and his angels goes back at least 6,000 years. We"},{"type":"note","text":"do not normally associate ‘shepherd’ with ‘a rod of iron’—the Millennial Messianic Kingdom will be a"},{"type":"note","text":"benevolent dictatorship."},{"type":"note number","text":"9 "},{"type":"note","text":"Verses 1-5 are historical, but verse 6 brings us back to the Great Tribulation. The narrative is interrupted to"},{"type":"note","text":"give us some background."},{"type":"note number","text":"10 "},{"type":"note","text":"The dragon knew that Michael had received the order, so he decided to get in the first blow."},{"type":"note number","text":"11 "},{"type":"note","text":"“Into the earth”, including its atmosphere. The idea seems to be that at this point Satan is confined to this"},{"type":"note","text":"planet. From the content of the following verses I take it that Satan’s expulsion occurs in the middle of the"},{"type":"UNKNOWN","text":"17"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"a loud voice in the heaven saying: “Now the salvation and the power have come,"},{"type":"note reference","text":"1 "},{"type":"verse","text":"even the"},{"type":"verse","text":"Kingdom of our God and the authority of His Christ, because the accuser of our brothers"},{"type":"note reference","text":"2 "},{"type":"verse","text":"has"},{"type":"verse","text":"been thrown down, who accused them before our God day and night. 11 And they"},{"type":"verse","text":"conquered"},{"type":"note reference","text":"3 "},{"type":"verse","text":"him by the blood of the Lamb and by the word of their testimony, and they did"},{"type":"verse","text":"not cherish their lives, "},{"type":"verse","text":"even "},{"type":"verse","text":"up to death. 12 Therefore rejoice, O heavens, yes, you who are"},{"type":"verse","text":"dwelling in them!"},{"type":"note reference","text":"4 "},{"type":"verse","text":"Woe to the earth and the sea! Because the devil has come down to you,"},{"type":"verse","text":"having great wrath, knowing that he has little time.”"},{"type":"header","text":"Satan persecutes the woman"},{"type":"paragraph break"},{"type":"verse","text":"13 "},{"type":"paragraph break"},{"type":"verse","text":"So when the dragon perceived that he had been thrown into the earth, he"},{"type":"verse","text":"persecuted the woman who gave birth to the Male. 14 And to the woman were given two"},{"type":"verse","text":"wings of the great eagle, so that she might fly into the wilderness, into her place, so that she"},{"type":"verse","text":"might be nourished there for a time and times and half a time, from the presence of the"},{"type":"verse","text":"serpent. 15 So the serpent expelled water from his mouth after the woman, like a river, so as"},{"type":"verse","text":"to cause her to be overwhelmed by the flood. 16 But the ground helped the woman; indeed,"},{"type":"verse","text":"the ground opened its mouth and drank up the river that the dragon expelled from his"},{"type":"verse","text":"mouth. 17 So the dragon was furious about the woman and off he went to make war with"},{"type":"verse","text":"the rest of her offspring, those who keep the commands of God and hold the testimony of"},{"type":"verse","text":"Jesus."},{"type":"note reference","text":"5"},{"type":"header","text":"Various Vignettes"},{"type":"header","text":"A beast from the sea"},{"type":"chapter number","text":"13"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"Now I"},{"type":"paragraph break"},{"type":"note reference","text":"6 "},{"type":"paragraph break"},{"type":"verse","text":"was standing on the seashore, and I saw a Beast of prey coming up out of"},{"type":"verse","text":"the sea,"},{"type":"note reference","text":"7 "},{"type":"verse","text":"having seven heads and ten horns, and on his horns ten diadems and on his heads"},{"type":"verse","text":"blasphemous names."},{"type":"note reference","text":"8 "},{"type":"verse","text":"2 The beast that I saw was similar to a leopard, his feet were like those"},{"type":"verse","text":"of a bear, and his mouth was like a lion’s mouth. And the dragon gave him his power and his"},{"type":"verse","text":"throne and great authority. 3 And one of his heads was as if it had been mortally wounded,"},{"type":"verse","text":"but his fatal wound was healed. And the whole earth marveled after the Beast."},{"type":"paragraph break"},{"type":"verse","text":"4 And they did obeisance to the dragon who had given the authority to the Beast, and"},{"type":"verse","text":"they did obeisance to the Beast saying, “Who is like the Beast, and who is able to make war"},{"type":"verse","text":"with him?” 5 And he was given a mouth speaking great things, that is, blasphemy; and he was"},{"type":"verse","text":"given authority"},{"type":"note reference","text":"9 "},{"type":"verse","text":"to make war forty-two months. 6 So he opened that mouth of his in"},{"type":"verse","text":"blasphemy against God, to blaspheme His name and His tabernacle, those who dwell in"},{"type":"note","text":"seven-year period. So he is still in heaven accusing us (accusing us of what? There would be no point in"},{"type":"note","text":"bringing false accusations, so we must be providing Satan with ‘ammunition’—not a nice thought!)."},{"type":"note number","text":"1 "},{"type":"note","text":"Wait a minute! If it is only “Now”, where have the Kingdom and Authority been in the meantime? As long as a"},{"type":"note","text":"government is being challenged, its rule is not complete or tranquil. I find it instructive that Satan still has"},{"type":"note","text":"sufficient power to wage war, in Heaven!"},{"type":"note number","text":"2 "},{"type":"note","text":"“Our brothers”—I wonder who is speaking, since the ‘brothers’ are saved by the blood of the lamb."},{"type":"note number","text":"3 "},{"type":"note","text":"That is what the Text says. Comparing 6:11 and 7:13, perhaps it is necessary for a certain number of God’s"},{"type":"note","text":"servants to be willing to die for the Cause to bring about the accuser’s expulsion."},{"type":"note number","text":"4 "},{"type":"note","text":"It is the inhabitants that do the rejoicing, not the place."},{"type":"note number","text":"5 "},{"type":"note","text":"Only two very late Greek manuscripts add “Christ”, as in KJV and NKJV. Over 99% do not. The dragon will"},{"type":"note","text":"persecute Jews in general and Christians in particular."},{"type":"note number","text":"6 "},{"type":"note","text":"Less than 10% of the Greek manuscripts have ‘he’ (presumably referring to the dragon). The difference is"},{"type":"note","text":"between "},{"type":"UNKNOWN","text":"ECTAQHN "},{"type":"note","text":"(I stood) and ECTA"},{"type":"UNKNOWN","text":"Q"},{"type":"note","text":"H (he stood)—it would be easy to drop off the final N, especially"},{"type":"note","text":"since it is similar to H (more so in handwriting)."},{"type":"note number","text":"7 "},{"type":"note","text":"I am not sure that this beast is the same as the one in 11:7—they are said to come from different places (but"},{"type":"note","text":"see 17:8)."},{"type":"note number","text":"8 "},{"type":"note","text":"There is a family resemblance—seven heads, ten horns; might the Beast be the son of the Dragon? (Imitating"},{"type":"note","text":"God is Satan’s ‘thing’.)"},{"type":"note number","text":"9 "},{"type":"note","text":"I take it that here and in verse 7 it is God who does the giving—this is part of the Plan."},{"type":"UNKNOWN","text":"18"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"Heaven."},{"type":"note reference","text":"1 "},{"type":"verse","text":"7 And it was given to him to make war with the saints and to conquer them. And"},{"type":"verse","text":"authority was given him over every tribe and language and ethnic nation. 8 All who dwell on"},{"type":"verse","text":"the earth will do obeisance to him, whose names have not been written in the Book of Life of"},{"type":"verse","text":"the Lamb slaughtered from the foundation of the world."},{"type":"note reference","text":"2"},{"type":"paragraph break"},{"type":"verse","text":"9 If anyone has an ear, let him hear. 10 If anyone has captivity, he goes away."},{"type":"paragraph break"},{"type":"note reference","text":"3 "},{"type":"paragraph break"},{"type":"verse","text":"If"},{"type":"verse","text":"anyone kills with the sword, with the sword he must be killed. Here is the endurance and the"},{"type":"verse","text":"faith of the saints."},{"type":"note reference","text":"4"},{"type":"header","text":"A beast from the land"},{"type":"paragraph break"},{"type":"verse","text":"11 "},{"type":"paragraph break"},{"type":"verse","text":"Now I saw another beast of prey coming up out of the land, and he had two horns"},{"type":"verse","text":"like a lamb and spoke like a dragon. 12 And he exercises all the authority of the first Beast in"},{"type":"verse","text":"his presence; and he started to cause the earth and those who dwell in it to worship the first"},{"type":"verse","text":"Beast, whose mortal wound was healed. 13 And he performs great signs, including that fire"},{"type":"verse","text":"should come down from heaven upon the earth before the people. 14 And he deceives my"},{"type":"verse","text":"own "},{"type":"verse","text":"people"},{"type":"verse","text":","},{"type":"note reference","text":"5 "},{"type":"verse","text":"those dwelling on the earth, by the signs that it was given to him to perform"},{"type":"verse","text":"before the Beast, telling those who dwell on the earth to make an image to the Beast who"},{"type":"verse","text":"had the sword wound and lived. 15 And it was granted to him to give breath to the image of"},{"type":"verse","text":"the Beast, so that the image of the Beast should actually speak, and should cause as many as"},{"type":"verse","text":"would not worship the image of the Beast to be killed."},{"type":"note reference","text":"6 "},{"type":"verse","text":"16 And he causes everyone—both"},{"type":"verse","text":"small and great, both rich and poor, both free and slave—to receive marks on their right"},{"type":"verse","text":"hand or on their foreheads, 17 so that no one would be able to buy or sell who does not have"},{"type":"verse","text":"the mark, the name of the Beast or the number of his name. 18 Here is wisdom: let the one"},{"type":"verse","text":"who has understanding evaluate the number of the Beast, for it is the number of man—his"},{"type":"verse","text":"number is 666."},{"type":"note reference","text":"7"},{"type":"header","text":"The Lamb and the 144,000"},{"type":"chapter number","text":"14"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"And wow, I saw a Lamb standing on Mount Zion, and with Him one hundred and"},{"type":"verse","text":"forty-four thousand,"},{"type":"note reference","text":"8 "},{"type":"verse","text":"having His name and"},{"type":"note reference","text":"9 "},{"type":"verse","text":"His Father’s name written on their foreheads."},{"type":"verse","text":"2 And I heard a sound from the sky, like the sound of many waters, and like the sound of loud"},{"type":"note number","text":"1 "},{"type":"note","text":"Compare 1 Corinthians 3:16. We are the ‘temple’ of God; those who dwell in Heaven are His tabernacle."},{"type":"note number","text":"2 "},{"type":"note","text":"1 Peter 1:20 makes clear that it was actually before the foundation of the world. God knew what was going to"},{"type":"note","text":"happen before He created the human race, the terrible price He would have to pay, but He went ahead"},{"type":"note","text":"anyway."},{"type":"note number","text":"3 "},{"type":"note","text":"Two of the three main independent lines of transmission (including the best one) so read. The third line reads,"},{"type":"note","text":"‘If anyone goes away into captivity . . .’—the second half of the conditional clause (the apodosis) is missing."},{"type":"note","text":"The rendering of KJV and NKJV reflects a very few late manuscripts. But what does the Text mean? Anyone"},{"type":"note","text":"who has been appointed to captivity will certainly be taken away."},{"type":"note number","text":"4 "},{"type":"note","text":"I confess that this sentence puzzles me. Well, if I believe that my God is Sovereign over all, that He knows what"},{"type":"note","text":"He is doing, and that He has my ultimate wellbeing in view (Romans 8:28), then I will endure in faith."},{"type":"note number","text":"5 "},{"type":"note","text":"“My own "},{"type":"note","text":"people"},{"type":"note","text":"”—two of the three main independent lines of transmission (including the best one) so read."},{"type":"note","text":"Since John is speaking (writing), his physical people would be the Jews, while his spiritual people would be the"},{"type":"note","text":"Christians. The use of “own” points toward the physical, which accords with the information given elsewhere"},{"type":"note","text":"(Daniel 9:27) that Israel makes a deal with the Beast."},{"type":"note number","text":"6 "},{"type":"note","text":"Worship an image or be killed—how humiliating! It sounds like a re-run of Daniel 3."},{"type":"note number","text":"7 "},{"type":"note","text":"I find this verse difficult to translate. The main verb has two basic meanings: ‘to calculate’ and ‘to vote’. Since"},{"type":"note","text":"the number is immediately provided, what is there to calculate? In the context, any wise person will vote"},{"type":"note","text":"against the number, that is, refuse to receive it, but the idea of ‘against’ is not stated. The number itself is"},{"type":"note","text":"represented by three letters (in Greek), the middle one looking rather like a snake. (Some versions write out"},{"type":"note","text":"the number, but since it has to fit on forehead or hand, just the three letters seems more likely.) Note that the"},{"type":"note","text":"number is 600 plus 60 plus 6, not 6 plus 6 plus 6."},{"type":"note number","text":"8 "},{"type":"note","text":"Is this group different than the one in chapter 7?"},{"type":"note number","text":"9 "},{"type":"note","text":"Only 2% of the Greek manuscripts do not have “His name and” (as in KJV and NKJV), so they had two names"},{"type":"note","text":"written, the Father’s and the Son’s—much better than having the name of the Beast!"},{"type":"UNKNOWN","text":"19"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"thunder; and the sound that I heard was like harpists playing on their harps."},{"type":"note reference","text":"1 "},{"type":"verse","text":"3 And they sing"},{"type":"verse","text":"a new song before the Throne, and before the four living beings and the elders; and no one"},{"type":"verse","text":"was able to learn the song except the 144 thousand, who had been redeemed from the"},{"type":"verse","text":"earth. 4 These are the ones not defiled with women, for they are virgins;"},{"type":"note reference","text":"2 "},{"type":"verse","text":"these are the ones"},{"type":"verse","text":"who follow the Lamb wherever He may go. These were redeemed by Jesus"},{"type":"note reference","text":"3 "},{"type":"verse","text":"from among"},{"type":"verse","text":"men, firstfruits for God and for the Lamb;"},{"type":"note reference","text":"4 "},{"type":"verse","text":"5 no lie was found in their mouth, for they are"},{"type":"verse","text":"blameless."},{"type":"note reference","text":"5"},{"type":"header","text":"Three angels"},{"type":"paragraph break"},{"type":"verse","text":"6 "},{"type":"paragraph break"},{"type":"verse","text":"And I saw another angel flying in mid-heaven, having an eternal gospel to be"},{"type":"verse","text":"proclaimed to those who reside on the earth—to every ethnic nation and tribe and language"},{"type":"verse","text":"and people—7 saying with a loud voice, “Fear God and give Him glory,"},{"type":"note reference","text":"6 "},{"type":"verse","text":"because the hour of"},{"type":"verse","text":"His judging has come, and do obeisance to Him who made heaven and earth, the ocean and"},{"type":"verse","text":"springs of water.”"},{"type":"note reference","text":"7"},{"type":"paragraph break"},{"type":"verse","text":"8 And another, a second, angel followed, saying: “It fell, it fell, Babylon the great!—"},{"type":"verse","text":"she made all the nations drink of the wine of the rage of her fornication.”"},{"type":"note reference","text":"8"},{"type":"paragraph break"},{"type":"verse","text":"9 And another angel, a third, followed them, saying with a loud voice: “If anyone"},{"type":"verse","text":"worships the Beast and his image, and receives a mark on his forehead or on his hand,"},{"type":"note reference","text":"9"},{"type":"verse","text":"10 really, he will drink of the wine of the fury of God, mixed at full strength in the cup of His"},{"type":"verse","text":"wrath. In fact, he will be tormented with fire and sulfur before the holy angels and before the"},{"type":"verse","text":"Lamb.” 11 So the smoke of their torment goes up forever and ever, and they have no rest day"},{"type":"verse","text":"or night, those who worship the Beast and his image, and whoever receives the mark of his"},{"type":"verse","text":"name."},{"type":"note reference","text":"10"},{"type":"paragraph break"},{"type":"verse","text":"12 Here is the endurance of the saints, here those who keep the commands of God"},{"type":"verse","text":"and the faith of Jesus."},{"type":"note reference","text":"11 "},{"type":"verse","text":"13 I heard a voice from heaven saying to me, “Write: ‘Blessed are the"},{"type":"verse","text":"dead who die in the Lord from now on’ (“Yes” says the Spirit), ‘so that they may rest from"},{"type":"verse","text":"their labors, and their works follow along with them’.”"},{"type":"header","text":"The earth is harvested"},{"type":"paragraph break"},{"type":"verse","text":"14 "},{"type":"paragraph break"},{"type":"verse","text":"And wow, I saw a white cloud, and someone like a son of man was sitting on the"},{"type":"verse","text":"cloud, having on his head a golden crown, and in his hand a sharp sickle. 15 And another"},{"type":"verse","text":"angel came out of the temple crying out with a loud voice to the one sitting on the cloud,"},{"type":"verse","text":"“Thrust in your sickle and reap, for the time to reap has come, because the harvest of the"},{"type":"note number","text":"1 "},{"type":"note","text":"Evidently John is finding it difficult to describe exactly what he heard, doubtless different from the normal"},{"type":"note","text":"sounds of this earth."},{"type":"note number","text":"2 "},{"type":"note","text":"All the pronouns are masculine, so these are male virgins."},{"type":"note number","text":"3 "},{"type":"note","text":"Two of the three main lines of independent transmission (including the best one) read “by Jesus”."},{"type":"note number","text":"4 "},{"type":"note","text":"Why “firstfruits”? Before the advent of refrigeration, food could be preserved by drying, smoking, salting, etc.,"},{"type":"note","text":"but by the time of the next harvest, nothing would compare with a firstfruit, which would be something"},{"type":"note","text":"special. Those men were special!"},{"type":"note number","text":"5 "},{"type":"note","text":"These are remarkable men! KJV and NKJV add “before the throne of God”, following the TR which is here"},{"type":"note","text":"based on only two very late manuscripts."},{"type":"note number","text":"6 "},{"type":"note","text":"Of all the people who have ever lived on this earth, what percentage of them ever heard that Jesus died for"},{"type":"note","text":"them? Romans 1:18-21 gives the essence of God’s requirement: the evidence of creation demands a Creator,"},{"type":"note","text":"and He expects people to acknowledge Him and try to please Him."},{"type":"note number","text":"7 "},{"type":"note","text":"As fresh, pure water becomes more and more scarce, the springs of water will become increasingly important."},{"type":"note number","text":"8 "},{"type":"note","text":"Why “rage”? Her fornication was violent and compulsive, also insatiable."},{"type":"note number","text":"9 "},{"type":"note","text":"To actually serve as a warning, this would have to be contemporary with 13:16."},{"type":"note number","text":"10 "},{"type":"note","text":"Believe me, you do not want to submit to the Beast in any way! Don’t let anyone put anything on your right"},{"type":"note","text":"hand or on your forehead. Better to be executed. I do not doubt that the Beast is already alive on the earth,"},{"type":"note","text":"with age and preparation sufficient to take center stage at any moment."},{"type":"note number","text":"11 "},{"type":"note","text":"I would say that the two “here”s are cataphoric, referring forward to the content of verse 13."},{"type":"UNKNOWN","text":"20"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"earth is dry”. 16 So the one sitting on the cloud swung his sickle upon the earth, and the"},{"type":"verse","text":"earth was harvested."},{"type":"paragraph break"},{"type":"verse","text":"17 Then another angel came out of the temple (the one in heaven), he too having a"},{"type":"verse","text":"sharp sickle. 18 And another angel came out from the altar (having authority over the fire),"},{"type":"verse","text":"and he called out with a loud cry to the one having the sharp sickle saying, “Thrust in your"},{"type":"verse","text":"sharp sickle and gather the grape clusters of the vine of the earth, because her grapes are"},{"type":"verse","text":"ripe”. 19 So the angel swung his sickle at the earth and gathered the vine of the earth and"},{"type":"verse","text":"threw it into the winepress of God’s terrible fury. 20 And the winepress was trampled outside"},{"type":"verse","text":"the city, and blood came out of the winepress up to the horses’ bridles, for a thousand six"},{"type":"verse","text":"hundred stadia."},{"type":"note reference","text":"1"},{"type":"header","text":"Here come the bowls!"},{"type":"chapter number","text":"15"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"And I saw another sign in heaven, great and marvelous: seven angels having the"},{"type":"verse","text":"seven last plagues—in them the fury of God is completed."},{"type":"note reference","text":"2"},{"type":"header","text":"The song of the victors"},{"type":"paragraph break"},{"type":"verse","text":"2 "},{"type":"paragraph break"},{"type":"verse","text":"And I saw as it were a sea of glass mingled with fire, and those who prevailed over"},{"type":"verse","text":"the Beast and over his image and over the number of his name, standing on the glassy sea,"},{"type":"verse","text":"having harps of God."},{"type":"note reference","text":"3 "},{"type":"verse","text":"3 They sing the song of Moses, the slave of God, and the song of the"},{"type":"verse","text":"Lamb, saying: “Great and marvelous are Your works, O Lord God, the Almighty! Just and true"},{"type":"verse","text":"are Your ways, O King of the nations!"},{"type":"note reference","text":"4 "},{"type":"verse","text":"4 Who could not fear You, O Lord, and glorify Your"},{"type":"verse","text":"name? Because You alone are holy; because all the nations will come and do obeisance"},{"type":"verse","text":"before You, because Your righteous judgments have been manifested.”"},{"type":"header","text":"The angels are commissioned"},{"type":"paragraph break"},{"type":"verse","text":"5 "},{"type":"paragraph break"},{"type":"verse","text":"After these things I looked, and the sanctuary of the tabernacle of the testimony in"},{"type":"verse","text":"the heaven was opened. 6 And out from that heaven"},{"type":"note reference","text":"5 "},{"type":"verse","text":"came the seven angels, the ones"},{"type":"verse","text":"having the seven plagues; they were clothed in pure bright linen and were girded around the"},{"type":"note number","text":"1 "},{"type":"note","text":"That is roughly 180 miles! If some four billion people will be killed during the seven-year period [mostly the"},{"type":"note","text":"second half of it] (as I calculate, a low estimate) and we allow an average of one gallon of blood per person,"},{"type":"note","text":"that is four billion gallons of blood—which would make quite a river! If the “winepress of God’s terrible fury”"},{"type":"note","text":"described here represents sort of a summary of the blood shed during the Great Tribulation period, then the"},{"type":"note","text":"picture is not far fetched. Of course a winepress has a single outlet and the liquid is conveyed to the"},{"type":"note","text":"receptacle by a conduit of appropriate size. In this case the conduit is 180 miles long and the flow is about four"},{"type":"note","text":"feet (1.33 yards) deep—four billion gallons equals about 20 million cubic yards; 180 miles equals about 320"},{"type":"note","text":"thousand linear yards; so we have about 62.5 cubic yards of blood per linear yard of conduit—so the conduit"},{"type":"note","text":"is about 45 yards wide. My purpose in conducting this exercise is simply to show that the description of the"},{"type":"note","text":"“winepress of God’s terrible fury” is not at all ridiculous—it is a graphic but factual picture of the coming"},{"type":"note","text":"bloodbath."},{"type":"note number","text":"2 "},{"type":"note","text":"I take it that this is a generic cover statement, referring to the detailed description that follows. I further take it"},{"type":"note","text":"that these ‘bowl’ plagues relate to the seventh trumpet (11:15) and make up the third ‘woe’ (11:14)."},{"type":"note number","text":"3 "},{"type":"note","text":"These people were martyred by order of the Beast, so how did they ‘prevail’ over him? By refusing to bow to"},{"type":"note","text":"him they escaped from hell (14:11); they died physically but won spiritually (but see 12:11)."},{"type":"note number","text":"4 "},{"type":"note","text":"KJV and NKJV read ‘saints’ instead of “nations”, following the TR which is here based on only two very late"},{"type":"note","text":"manuscripts."},{"type":"note number","text":"5 "},{"type":"note","text":"The best line of transmission has “heaven”, all the rest having the expected ‘sanctuary’. At first glance the"},{"type":"note","text":"context seems to call for ‘sanctuary’; so much so that if ‘heaven’ were original some might have omitted while"},{"type":"note","text":"others made the obvious change—if ‘sanctuary’ were original, why would anyone omit or change? On the"},{"type":"note","text":"other hand, there are at least three heavens, 2 Corinthians 12:2, and they may have come out of the third,"},{"type":"note","text":"into the second. This is the only mention of the tabernacle of the testimony in Revelation, so the throne of"},{"type":"note","text":"God was not there and none of the action related by John up to this point took place there—there have been"},{"type":"note","text":"several references to the temple, with angels coming out of it, but I doubt that temple and tabernacle are to"},{"type":"note","text":"be equated."},{"type":"UNKNOWN","text":"21"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"chests with golden belts."},{"type":"note reference","text":"1 "},{"type":"verse","text":"7 Then one of the four living beings gave the seven angels seven"},{"type":"verse","text":"golden bowls filled with the fury of God, the One who lives forever and ever. 8 The sanctuary"},{"type":"verse","text":"was filled with smoke from the glory of God and from His power, and no one was able to go"},{"type":"verse","text":"into the sanctuary until the seven angels’ plagues were completed. "},{"type":"chapter number","text":"16"},{"type":"verse","text":":1 And I heard a loud"},{"type":"verse","text":"voice from the sanctuary saying to the seven angels, “Go, pour out the bowls of God’s fury on"},{"type":"verse","text":"the earth.”"},{"type":"header","text":"The first bowl"},{"type":"paragraph break"},{"type":"verse","text":"2 "},{"type":"paragraph break"},{"type":"verse","text":"So off went the first one and poured out his bowl on the earth, and a foul and"},{"type":"verse","text":"malignant ulcer"},{"type":"note reference","text":"2 "},{"type":"verse","text":"appeared in the people who had the mark of the beast and those who"},{"type":"verse","text":"worshipped his image."},{"type":"header","text":"The second bowl"},{"type":"paragraph break"},{"type":"verse","text":"3 "},{"type":"paragraph break"},{"type":"verse","text":"Then the second angel poured out his bowl on the sea, and it turned into blood, like"},{"type":"verse","text":"a dead person’s; so every living soul in the sea died."},{"type":"note reference","text":"3"},{"type":"header","text":"The third bowl"},{"type":"paragraph break"},{"type":"verse","text":"4 "},{"type":"paragraph break"},{"type":"verse","text":"Then the third angel poured out his bowl on the rivers and the springs of water, and"},{"type":"verse","text":"they turned into blood. 5 And I heard the angel of the waters saying: “How just You are! The"},{"type":"verse","text":"One who is and who was, the holy One, because You have judged these things. 6 Because"},{"type":"verse","text":"they shed the blood of saints and prophets, and You have given them blood to drink."},{"type":"note reference","text":"4 "},{"type":"verse","text":"They"},{"type":"verse","text":"deserve it!” 7 And I heard one from the altar saying: “Yes, O Lord God, the Almighty! Your"},{"type":"verse","text":"judgings are true and just!”"},{"type":"header","text":"The fourth bowl"},{"type":"paragraph break"},{"type":"verse","text":"8 "},{"type":"paragraph break"},{"type":"verse","text":"Then the fourth angel poured out his bowl on the sun, and it was granted to him to"},{"type":"verse","text":"burn the people with fire. 9 So the people were burned with severe burns, and they"},{"type":"verse","text":"blasphemed the name of God, who has authority over these plagues. And they did not repent"},{"type":"verse","text":"to give Him glory."},{"type":"note reference","text":"5"},{"type":"header","text":"The fifth bowl"},{"type":"paragraph break"},{"type":"verse","text":"10 "},{"type":"paragraph break"},{"type":"verse","text":"Then the fifth angel poured out his bowl on the throne of the Beast, and his"},{"type":"verse","text":"kingdom was plunged into darkness; so they gnawed their tongues because of the pain."},{"type":"note reference","text":"6"},{"type":"verse","text":"11 And they blasphemed the God of heaven because of their pains, and because of their"},{"type":"verse","text":"ulcers; yet they did not repent of their deeds."},{"type":"header","text":"The sixth bowl"},{"type":"paragraph break"},{"type":"verse","text":"12 "},{"type":"paragraph break"},{"type":"verse","text":"Then the sixth angel poured out his bowl on the great river Euphrates, and its"},{"type":"verse","text":"water was dried up, so that the way for the kings from the sun’s rising might be prepared."},{"type":"verse","text":"13 And I saw three unclean spirits, like frogs, "},{"type":"verse","text":"coming "},{"type":"verse","text":"out of the mouth of the dragon, out of"},{"type":"verse","text":"the mouth of the Beast, and out of the mouth of the false prophet. 14 For they are spirits of"},{"type":"verse","text":"demons, performing signs, which go out to the kings of the whole inhabited earth, to gather"},{"type":"verse","text":"them to the battle of that great day of God Almighty. 15 (“Watch out, I am coming like a"},{"type":"note number","text":"1 "},{"type":"note","text":"Just like the glorified Christ (1:13). Perhaps a belt around the chest was like ‘war paint’, part of getting ready to"},{"type":"note","text":"fight."},{"type":"note number","text":"2 "},{"type":"note","text":"Even now a chip the size of a grain of rice is being planted under the skin of volunteers. The battery contains a"},{"type":"note","text":"substance that, if it leaks out of the chip, will produce “a foul and malignant ulcer”. Notice that ‘ulcer’ is"},{"type":"note","text":"singular, one per person, precisely those who have the ‘mark’. A word to the wise . . . ."},{"type":"note number","text":"3 "},{"type":"note","text":"The resulting stench would qualify as a plague of reasonable severity."},{"type":"note number","text":"4 "},{"type":"note","text":"That is right. Where are people going to find water to drink, let alone for washing, etc.?"},{"type":"note number","text":"5 "},{"type":"note","text":"They are no longer pretending that God does not exist, but they refuse to submit to Him, so they have no"},{"type":"note","text":"excuse."},{"type":"note number","text":"6 "},{"type":"note","text":"Apparently this is a different kind of darkness, evidently quite painful."},{"type":"UNKNOWN","text":"22"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"thief. Blessed is the one who watches and guards his clothes,"},{"type":"note reference","text":"1 "},{"type":"verse","text":"so that he not walk about"},{"type":"verse","text":"naked and they see his shame.”)"},{"type":"note reference","text":"2 "},{"type":"verse","text":"16 So he gathered them to the place called in Hebrew,"},{"type":"verse","text":"Armagedon."},{"type":"header","text":"The seventh bowl"},{"type":"paragraph break"},{"type":"verse","text":"17 "},{"type":"paragraph break"},{"type":"verse","text":"Then the seventh angel poured out his bowl into the air, and a great voice came"},{"type":"verse","text":"out of the sanctuary of heaven, from the Throne, saying, “It is done!” 18 and there were"},{"type":"verse","text":"lightnings and thunders and noises. And there was a tremendous earthquake, a terribly"},{"type":"verse","text":"severe earthquake such as had not occurred since mankind existed on the earth. 19 So the"},{"type":"verse","text":"great city was divided into three parts, and the cities of the nations fell."},{"type":"note reference","text":"3 "},{"type":"verse","text":"And Babylon the"},{"type":"verse","text":"great was remembered before God, to give her the cup of the wine of the fury of His wrath."},{"type":"verse","text":"20 And every island fled, and mountains were not found. 21 And huge hailstones, weighing"},{"type":"verse","text":"about a talent,"},{"type":"note reference","text":"4 "},{"type":"verse","text":"fell out of the sky on the people; and the people blasphemed God on account"},{"type":"verse","text":"of the plague of the hail, because its plague was exceedingly severe."},{"type":"header","text":"About Babylon"},{"type":"chapter number","text":"17"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"One of the seven angels who had the seven bowls came and spoke with me"},{"type":"verse","text":"saying, “Come, I will show you the judgment of the great whore who sits on the many waters,"},{"type":"verse","text":"2 with whom the kings of the earth fornicated; and the inhabitants of the earth were made"},{"type":"verse","text":"drunk with the wine of her fornication.”"},{"type":"header","text":"A woman and a beast"},{"type":"paragraph break"},{"type":"verse","text":"3 "},{"type":"paragraph break"},{"type":"verse","text":"So he took me away in spirit to a wilderness. And I saw a woman sitting on a scarlet"},{"type":"verse","text":"beast full of blasphemous names, having seven heads and ten horns. 4 And the woman was"},{"type":"verse","text":"clothed in purple and scarlet, adorned with gold and precious stones and pearls, having in"},{"type":"verse","text":"her hand a golden cup full of abominations and the filthiness of her fornication. 5 And on her"},{"type":"verse","text":"forehead a name was written: “Mystery, Babylon the Great, the Mother of the prostitutes"},{"type":"verse","text":"and the abominations of the earth.”"},{"type":"note reference","text":"5 "},{"type":"verse","text":"6 And I saw the woman drunk with the blood of the"},{"type":"verse","text":"saints, even with the blood of the martyrs of Jesus. And upon seeing her I was tremendously"},{"type":"verse","text":"impressed."},{"type":"header","text":"The vision explained"},{"type":"paragraph break"},{"type":"verse","text":"7 "},{"type":"paragraph break"},{"type":"verse","text":"So the angel said to me: “Why are you impressed? I will tell you the mystery of the"},{"type":"verse","text":"woman and of the beast, having the seven heads and the ten horns, that carries her. 8 The"},{"type":"note number","text":"1 "},{"type":"note","text":"So what might the “clothes” be? Presumably these are spiritual clothes, perhaps having to do with our walk"},{"type":"note","text":"with God, maintaining our personal sanctity or holiness, ‘without which no one will see the Lord’. “Watch” and"},{"type":"note","text":"“guard” are up to us—watch out for and guard against the world’s values."},{"type":"note number","text":"2 "},{"type":"note","text":"Verse 15 is an interjection from the glorified Christ."},{"type":"note number","text":"3 "},{"type":"note","text":"Such a monstrous earthquake will doubtless produce monstrous tsunamis which could well inundate many"},{"type":"note","text":"coastal cities—between the earth and the water the destruction will be massive."},{"type":"note number","text":"4 "},{"type":"note","text":"That would be around 90 pounds each (a Roman talent = 93.75 pounds). The surviving people are ‘punch-"},{"type":"note","text":"drunk’ by now, but the hailstones are so incredible that they provoke another round of blasphemy. Such"},{"type":"note","text":"hailstones can destroy any normal dwelling."},{"type":"note number","text":"5 "},{"type":"note","text":"In Hebrew usage a ‘son’ of something was characterized by that something. So a ‘father’ of that something"},{"type":"note","text":"would be even more so. So when James calls God “the Father of lights” (1:17) that means that “God is light"},{"type":"note","text":"and in Him is no darkness at all” (1 John 1:5)—He is totally light. In John 8:44 the Lord Jesus says that Satan is"},{"type":"note","text":"the father of the lie, and that “there is no truth in him”—he is totally falsehood (I conclude that it is impossible"},{"type":"note","text":"for Satan to tell the undistorted truth). Here we have “the mother of prostitutes and abominations”—she is"},{"type":"note","text":"totally perverted, evil (it is impossible for her to do anything pure, clean or really good). So whom or what"},{"type":"note","text":"does the whore represent? If the kings are fornicating with her they are not trying to please God, so perhaps"},{"type":"note","text":"she is organized religion (including dead Christianity, of whatever kind). In that event organized religion is"},{"type":"note","text":"incapable of doing anything pure, clean or really good."},{"type":"UNKNOWN","text":"23"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"beast that you saw was, and is not, and is about to come up out of the Abyss"},{"type":"note reference","text":"1 "},{"type":"verse","text":"and to go into"},{"type":"verse","text":"perdition. And those who dwell upon the earth will be amazed, whose names are not written"},{"type":"verse","text":"in the Book of Life from the foundation of the world,"},{"type":"note reference","text":"2 "},{"type":"verse","text":"when they see the beast that was, and"},{"type":"verse","text":"is not and will be present. 9 Here is the mind that has wisdom: The seven heads are seven"},{"type":"verse","text":"mountains on which the woman sits. 10 And there are seven kings; five have fallen, one is,"},{"type":"verse","text":"the other has not come yet. And whenever he comes he must continue a short time. 11 And"},{"type":"verse","text":"the beast that was and is not; he is actually the eighth, yet he is of the seven, and he is going"},{"type":"verse","text":"into perdition. 12 And the ten horns that you saw are ten kings who have not yet received a"},{"type":"verse","text":"kingdom, but they receive authority as kings with the Beast for one hour. 13 These are of one"},{"type":"verse","text":"mind and give their power and authority to the Beast. 14 They will make war with the Lamb,"},{"type":"verse","text":"and the Lamb will conquer them, because He is Lord of lords and King of kings; and those"},{"type":"verse","text":"who are with Him are called and chosen and faithful.”"},{"type":"paragraph break"},{"type":"verse","text":"15 Then he says to me: “The waters that you saw, where the whore sits, are peoples"},{"type":"verse","text":"and multitudes and nations and languages. 16 And the ten horns that you saw, also the"},{"type":"verse","text":"beast, these will hate the whore and will lay her waste and strip her and eat her flesh and"},{"type":"verse","text":"burn her with fire. 17 Because God put it into their hearts to perform His purpose, even to be"},{"type":"verse","text":"of one mind, and to give their kingdom to the Beast, until the words of God should be"},{"type":"verse","text":"fulfilled."},{"type":"note reference","text":"3 "},{"type":"verse","text":"18 Now the woman whom you saw is the great city"},{"type":"note reference","text":"4 "},{"type":"verse","text":"that holds rulership over the"},{"type":"verse","text":"kings of the earth."},{"type":"header","text":"Her fall proclaimed"},{"type":"chapter number","text":"18"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"After these things I saw another angel coming down from heaven, having great"},{"type":"verse","text":"authority, and the earth was illuminated by his splendor. 2 And he cried out with a strong"},{"type":"verse","text":"voice saying: “It fell, it fell, Babylon the great! and has become a dwelling place of demons,"},{"type":"verse","text":"even a prison of every unclean spirit, also a prison of every unclean and detestable bird."},{"type":"verse","text":"3 Because all the nations have drunk of the rage of the wine of her fornication, and the kings"},{"type":"verse","text":"of the earth have fornicated with her, and the merchants of the earth became rich through"},{"type":"verse","text":"the strength of her luxury.”"},{"type":"paragraph break"},{"type":"verse","text":"4 And I heard another Voice from heaven saying: “Come out of her, my people,"},{"type":"paragraph break"},{"type":"note reference","text":"5 "},{"type":"paragraph break"},{"type":"verse","text":"so as"},{"type":"verse","text":"not to participate in her sins and so as not to receive of her plagues. 5 For her sins have"},{"type":"verse","text":"reached to heaven and God has remembered about her her iniquities."},{"type":"note reference","text":"6 "},{"type":"verse","text":"6 Render to her just"},{"type":"verse","text":"as she rendered to you;"},{"type":"note reference","text":"7 "},{"type":"verse","text":"yes, pay her back double, according to her deeds; in the cup that"},{"type":"verse","text":"she mixed, mix double for her. 7 To the extent that she glorified herself and lived luxuriously,"},{"type":"verse","text":"by so much give her torment; because in her heart she says, ‘I sit a queen, and am not a"},{"type":"note number","text":"1 "},{"type":"note","text":"Well, the origin matches 11:7 but the description matches 13:1, so maybe the three passages refer to a single"},{"type":"note","text":"personage. If “sea” refers to human origin and “Abyss” to demonic, could it be that Satan will imitate God in"},{"type":"note","text":"producing the Antichrist?"},{"type":"note number","text":"2 "},{"type":"note","text":"Here is a strong statement of election or predestination—how else could God know what names to put in the"},{"type":"note","text":"Book? At the same time the seven letters (chaps. 2 & 3) are strong on human responsibility (including the"},{"type":"note","text":"possibility of a name being erased). Divine sovereignty and human responsibility walk side by side throughout"},{"type":"note","text":"the Bible."},{"type":"note number","text":"3 "},{"type":"note","text":"Compare verse 13—God is in ultimate control; His Word and purpose will be fulfilled."},{"type":"note number","text":"4 "},{"type":"note","text":"In chapter 21 the Bride of Christ is represented by a city, the New Jerusalem, but the Bride is presumably"},{"type":"note","text":"people from around the earth. Likewise the whore, represented by a city, may well involve people from"},{"type":"note","text":"around the earth. “Is the great city”—when John wrote, Rome was the ruling city."},{"type":"note number","text":"5 "},{"type":"note","text":"Could an angel say “my” people? This may be God Himself speaking. But just how can one ‘come out’ of"},{"type":"note","text":"Babylon?—by rejecting all that she represents."},{"type":"note number","text":"6 "},{"type":"note","text":"What God has remembered about her is her iniquities."},{"type":"note number","text":"7 "},{"type":"note","text":"Evidently it is “my people” who are supposed to be doing this. First we must disassociate ourselves from the"},{"type":"note","text":"whore, but then we are to participate in her punishment, “double”. Only it does not say how the paying back"},{"type":"note","text":"works, and I, for one, would like to know."},{"type":"UNKNOWN","text":"24"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"widow; and I will certainly not see sorrow’. 8 Therefore her plagues will come in one day—"},{"type":"verse","text":"death and sorrow and famine—and she will be burned up with fire; because the Lord God"},{"type":"verse","text":"who has judged her is "},{"type":"verse","text":"strong"},{"type":"verse","text":"."},{"type":"header","text":"Her fall lamented"},{"type":"paragraph break"},{"type":"verse","text":"9 "},{"type":"paragraph break"},{"type":"verse","text":"“The kings of the earth who fornicated and lived luxuriously with her will weep and"},{"type":"verse","text":"mourn over her, when they see the smoke of her burning, 10 standing afar off for fear of her"},{"type":"verse","text":"torment,"},{"type":"note reference","text":"1 "},{"type":"verse","text":"saying: ‘Alas, alas, O great city Babylon, O mighty city! Because your judgment"},{"type":"verse","text":"came in one hour.’"},{"type":"paragraph break"},{"type":"verse","text":"11 “And the merchants of the earth weep and sorrow over her, because no one buys"},{"type":"verse","text":"their goods anymore: 12 goods of gold and of silver, of precious stones and of pearl, of fine"},{"type":"verse","text":"linen and of purple, of silk and of scarlet; every citron wood and object of ivory, every object"},{"type":"verse","text":"of most precious wood and of bronze and of iron and of marble; 13 cinnamon and incense"},{"type":"verse","text":"and perfume and frankincense, wine and olive oil and fine flour and wheat, cattle and sheep"},{"type":"verse","text":"and horses and carriages, and bodies and souls of men!” 14 (‘Yes, the fruit that your soul"},{"type":"verse","text":"craved has gone from you, and all the sumptuous and splendid things have perished from"},{"type":"verse","text":"you, and you will never find them again!’)"},{"type":"note reference","text":"2 "},{"type":"verse","text":"15 “The merchants of these things, who became"},{"type":"verse","text":"rich by her, will stand afar off for fear of her torment,"},{"type":"note reference","text":"3 "},{"type":"verse","text":"weeping and sorrowing 16 and saying:"},{"type":"verse","text":"‘Alas, alas, O great city! that was clothed in fine linen and purple and scarlet, and was"},{"type":"verse","text":"adorned with gold and precious stones and pearls; 17 because in one hour such great wealth"},{"type":"verse","text":"was laid waste.’"},{"type":"paragraph break"},{"type":"verse","text":"“And every ship captain, and all who travel by ship—sailors and as many as work the"},{"type":"verse","text":"sea—stood afar off 18 and cried out, seeing the smoke of her burning, saying, ‘Who is like the"},{"type":"verse","text":"great city!?’ 19 They threw dust on their heads and cried out, weeping and sorrowing and"},{"type":"verse","text":"saying: ‘Alas, alas, O great city! by which all who had ships in the sea became rich, by her"},{"type":"verse","text":"costly abundance; because in one hour she was laid waste.’"},{"type":"header","text":"Her doom final"},{"type":"paragraph break"},{"type":"verse","text":"20 "},{"type":"paragraph break"},{"type":"verse","text":"“Rejoice over her, O heaven, yes you saints and apostles and prophets, because"},{"type":"verse","text":"God has pronounced your judgment against her!”"},{"type":"note reference","text":"4 "},{"type":"verse","text":"21 And a mighty angel took up a stone like"},{"type":"verse","text":"a huge millstone and threw it into the ocean saying: “The great city Babylon will be thrown"},{"type":"verse","text":"down violently, and will never be found again. 22 The sound of harpists and musicians and"},{"type":"verse","text":"flutists and trumpeters will never be heard in you again; no craftsman of whatever craft will"},{"type":"verse","text":"ever be found in you again; the sound of a millstone will never be heard in you again; 23 the"},{"type":"verse","text":"light of a lamp will never shine in you again; the voice of bridegroom and bride will never be"},{"type":"verse","text":"heard in you again; because your merchants were the magnates of the earth, because by"},{"type":"verse","text":"your sorcery"},{"type":"note reference","text":"5 "},{"type":"verse","text":"all the nations were deceived.” 24 And in her was found the blood of prophets"},{"type":"verse","text":"and saints, even of all who had been butchered on the earth."},{"type":"header","text":"Her fall celebrated"},{"type":"chapter number","text":"19"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"After these things I heard as it were the really loud voice of a great multitude in"},{"type":"verse","text":"heaven saying: “Hallelujah! The salvation and power and glory of our God! 2 Because His"},{"type":"verse","text":"judgments are true and just, because He has judged the great whore who corrupted the"},{"type":"verse","text":"earth with her fornication, and has avenged the blood of His slaves by her hand.” 3 And a"},{"type":"note number","text":"1 "},{"type":"note","text":"None of her lovers charge to the rescue; they stay well clear of the action! They enjoyed the whore, but . . . ."},{"type":"note","text":"(Actually, why do men go to prostitutes? They want sex without commitment.)"},{"type":"note number","text":"2 "},{"type":"note","text":"An unidentified speaker interjects a cheerful note. It may be that “the fruit that your soul craved” had to do"},{"type":"note","text":"with the “bodies and souls of men”."},{"type":"note number","text":"3 "},{"type":"note","text":"I guess we should not expect the merchants to be braver than the kings, now should we?"},{"type":"note number","text":"4 "},{"type":"note","text":"Perhaps this should be connected to verses 6-7, above. In that event, the judgment was pronounced in faith."},{"type":"note number","text":"5 "},{"type":"note","text":"The whore uses sorcery, and kills God’s prophets and saints. The Lord Jesus said that the “Jerusalem” of His"},{"type":"note","text":"day killed God’s prophets, so the whore has been around for quite a while."},{"type":"UNKNOWN","text":"25"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"second voice said, “Hallelujah! Her smoke goes up for ever and ever!”"},{"type":"note reference","text":"1 "},{"type":"verse","text":"4 And the twenty-four"},{"type":"verse","text":"elders and the four living beings fell down and worshipped God, who sits on the throne,"},{"type":"verse","text":"saying, “Amen, Hallelujah!” 5 And a voice came from the Throne saying, “Praise our God, all"},{"type":"verse","text":"you His slaves and those who fear Him, small and great!”"},{"type":"header","text":"The wedding of the Lamb"},{"type":"paragraph break"},{"type":"verse","text":"6 "},{"type":"paragraph break"},{"type":"verse","text":"And I heard as it were the voice of a great multitude like the sound of many waters"},{"type":"verse","text":"and like the sound of mighty thunderings saying: “Hallelujah! Because the Lord our God"},{"type":"verse","text":"reigns, the Almighty! 7 Let us rejoice and exult and give Him the glory, because the wedding"},{"type":"verse","text":"of the Lamb has come, and His wife has prepared herself.” 8 And it was granted to her to be"},{"type":"verse","text":"dressed in fine linen, bright and pure, for the fine linen is the righteous deeds of the saints."},{"type":"paragraph break"},{"type":"verse","text":"9 And he says to me,"},{"type":"paragraph break"},{"type":"note reference","text":"2 "},{"type":"paragraph break"},{"type":"verse","text":"“Write: ‘Blessed are those who are invited to the wedding"},{"type":"verse","text":"banquet of the Lamb’.” And he says to me, “These are the true words of God”. 10 And I fell at"},{"type":"verse","text":"his feet to worship him, but he says to me: “Don’t! I am your fellow slave and among your"},{"type":"verse","text":"brothers who hold the testimony of Jesus."},{"type":"note reference","text":"3 "},{"type":"verse","text":"Worship God! For the testimony of Jesus is the"},{"type":"verse","text":"spirit of prophecy.”"},{"type":"note reference","text":"4"},{"type":"header","text":"The battle of Armageddon"},{"type":"paragraph break"},{"type":"verse","text":"11 "},{"type":"paragraph break"},{"type":"verse","text":"I saw the heaven opened, and wow, a white horse! And the One who sits on it,"},{"type":"verse","text":"called Faithful and True, both judges and makes war with righteousness. 12 Now His eyes"},{"type":"verse","text":"were a flame of fire and on His head were many diadems, having names written,"},{"type":"note reference","text":"5 "},{"type":"verse","text":"besides a"},{"type":"verse","text":"written name that no one knows except Himself; 13 and He was clothed with a robe that had"},{"type":"verse","text":"been dipped in blood, and His name is called The Word of God. 14 And the armies in heaven,"},{"type":"verse","text":"clothed in fine linen, white, clean, followed Him on white horses. 15 And out of His mouth"},{"type":"verse","text":"goes a sharp, two-edged sword, so that with it He may strike the nations. And He Himself will"},{"type":"verse","text":"shepherd them with a rod of iron. And He Himself treads the winepress of the fury of the"},{"type":"verse","text":"wrath of God, the Almighty."},{"type":"note reference","text":"6 "},{"type":"verse","text":"16 And He has a name written on His robe and on His thigh,"},{"type":"verse","text":"King of kings and Lord of lords!"},{"type":"header","text":"A feast for vultures"},{"type":"paragraph break"},{"type":"verse","text":"17 "},{"type":"paragraph break"},{"type":"verse","text":"And I saw an angel standing in the sun; and he cried out with a loud voice, saying"},{"type":"verse","text":"to all the birds that fly in mid-heaven,"},{"type":"note reference","text":"7 "},{"type":"verse","text":"“Come, gather together to the great dinner of God,"},{"type":"verse","text":"18 so that you may eat flesh of kings and flesh of commanders and flesh of the mighty and"},{"type":"verse","text":"flesh of horses along with their riders, even the flesh of all, both free and slave, both small"},{"type":"verse","text":"and great.”"},{"type":"note number","text":"1 "},{"type":"note","text":"The whore’s eternal punishment is a cause for praise to God."},{"type":"note number","text":"2 "},{"type":"note","text":"Presumably the speaker is the angel of 17:1."},{"type":"note number","text":"3 "},{"type":"note","text":"It surprises me that an angel could or would call himself “your brother”. I don’t know what to make of it,"},{"type":"note","text":"unless this was really a human being that looked like an angel. Since the Bible records angels appearing in"},{"type":"note","text":"human form, I suppose a glorified human could appear in angelic form. Why not?"},{"type":"note number","text":"4 "},{"type":"note","text":"I don’t understand this statement either, unless it is Jesus who is testifying to the prophets, giving them their"},{"type":"note","text":"messages."},{"type":"note number","text":"5 "},{"type":"note","text":"Well over half of the Greek manuscripts, two of the three main independent lines of transmission (including"},{"type":"note","text":"the best one) read “having names written”—presumably these names were on the diadems. I would imagine"},{"type":"note","text":"that each diadem had a name."},{"type":"note number","text":"6 "},{"type":"note","text":"The Lord Jesus Christ paid the price for our sins all by Himself (Hebrews 1:3), and here He treads “the"},{"type":"note","text":"winepress of the fury of the wrath” all by Himself. Those who think of the Lord only in terms of ‘loving, meek,"},{"type":"note","text":"mild’ need to understand that there is a whole lot more to the story. Those who reject His sacrifice can look"},{"type":"note","text":"for “the fury of the wrath”—none of us can understand how terrible was the price the Son had to pay, and He"},{"type":"note","text":"will not take kindly to having that price despised!"},{"type":"note number","text":"7 "},{"type":"note","text":"It is mainly birds of prey and scavengers that fly high in the sky; songbirds and game birds usually stay fairly"},{"type":"note","text":"close to the ground (except when migrating)."},{"type":"UNKNOWN","text":"26"},{"type":"UNKNOWN","text":"Revelation"},{"type":"paragraph break"},{"type":"verse","text":"19 And I saw the Beast and the kings of the earth and their armies gathered together"},{"type":"verse","text":"to make war against the One riding the horse and against His army. 20 So the Beast was"},{"type":"verse","text":"captured, and with him the False prophet, the one who performed signs in his presence (by"},{"type":"verse","text":"which he had deceived those who had received the mark of the Beast and those who"},{"type":"verse","text":"worshipped his image). The two were thrown alive into the Lake of Fire that burns with"},{"type":"verse","text":"brimstone."},{"type":"note reference","text":"1 "},{"type":"verse","text":"21 And the rest were killed by the sword that proceeds from the mouth of the"},{"type":"verse","text":"One riding the horse."},{"type":"note reference","text":"2 "},{"type":"verse","text":"And all the birds were filled with their flesh."},{"type":"note reference","text":"3"},{"type":"header","text":"The Millennium"},{"type":"header","text":"Satan bound"},{"type":"chapter number","text":"20"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"And I saw an angel coming down from heaven, having the key of the Abyss and a"},{"type":"verse","text":"huge chain on his hand. 2 And he seized the dragon, the ancient serpent, who is a slanderer,"},{"type":"verse","text":"even Satan, who deceives the whole inhabited earth,"},{"type":"note reference","text":"4 "},{"type":"verse","text":"and bound him for a thousand years;"},{"type":"verse","text":"3 he threw him into the Abyss and locked and sealed "},{"type":"verse","text":"it "},{"type":"verse","text":"over him so that he should not"},{"type":"verse","text":"deceive the nations any more until the thousand years were finished. And after these "},{"type":"verse","text":"years"},{"type":"verse","text":"he must be loosed for a short time."},{"type":"note reference","text":"5"},{"type":"header","text":"Saints reign"},{"type":"paragraph break"},{"type":"verse","text":"4 "},{"type":"paragraph break"},{"type":"verse","text":"And I saw thrones, and they sat on them, and judgment was committed to them;"},{"type":"verse","text":"also, "},{"type":"verse","text":"I saw "},{"type":"verse","text":"the souls of those who had been beheaded"},{"type":"note reference","text":"6 "},{"type":"verse","text":"on account of the testimony of Jesus"},{"type":"verse","text":"and on account of the Word of God, even those who had not worshipped the Beast or his"},{"type":"verse","text":"image and had not received the mark on their forehead and on their hand. And they lived"},{"type":"verse","text":"and reigned with the Christ for a thousand years. 5 (Now the rest of the dead did not come to"},{"type":"verse","text":"life until the thousand years were finished.)"},{"type":"note reference","text":"7 "},{"type":"verse","text":"This is the first resurrection. 6 Blessed and holy"},{"type":"verse","text":"is the one having a part in the first resurrection; upon such the second death has no power,"},{"type":"verse","text":"but they will be priests of God and of Christ, and will reign with Him a thousand years."},{"type":"header","text":"The final rebellion"},{"type":"paragraph break"},{"type":"verse","text":"7 "},{"type":"paragraph break"},{"type":"verse","text":"Now when the thousand years are finished Satan will be released from his prison,"},{"type":"verse","text":"8 and he will go forth to deceive the nations that are in the four corners of the earth, Gog"},{"type":"verse","text":"and Magog, to gather them together to the war, whose number is like the sand of the sea."},{"type":"note reference","text":"8"},{"type":"verse","text":"9 They went up on the breadth of the earth and surrounded the camp of the saints and the"},{"type":"verse","text":"beloved city. And fire came down out of heaven from God and devoured them."},{"type":"note reference","text":"9 "},{"type":"verse","text":"10 And the"},{"type":"note number","text":"1 "},{"type":"note","text":"Apparently these are the first two residents in the Lake, and they will have it all to themselves for a full one"},{"type":"note","text":"thousand years!"},{"type":"note number","text":"2 "},{"type":"note","text":"If the Captain did all the killing, then His followers were just along for the ride. Evidently all the Captain had to"},{"type":"note","text":"do was speak."},{"type":"note number","text":"3 "},{"type":"note","text":"The birds will eat all they can, but there will presumably be plenty of flesh left over. Ezekiel 39:12 says it will"},{"type":"note","text":"take seven months to cleanse the land of all the remains!"},{"type":"note number","text":"4 "},{"type":"note","text":"Well over half of the Greek manuscripts, two of the three main independent lines of transmission (including"},{"type":"note","text":"the best one), contain this clause. Since both the TR and the so-called critical text omit it, most versions do not"},{"type":"note","text":"include it."},{"type":"note number","text":"5 "},{"type":"note","text":"If language has any verifiable meaning at all, this passage is obviously talking about a literal period of one"},{"type":"note","text":"thousand years."},{"type":"note number","text":"6 "},{"type":"note","text":"What cultures in our day practice beheading?"},{"type":"note number","text":"7 "},{"type":"note","text":"Verse six makes clear that this part of verse 5 is parenthetical. It is participants in the first resurrection who will"},{"type":"note","text":"reign the thousand years; so that first resurrection must happen at the beginning of the thousand years, not"},{"type":"note","text":"the end; so “the rest of the dead” are the lost who will participate in the resurrection unto condemnation (call"},{"type":"note","text":"it the second resurrection), after the Millennium. Superficial readings of this passage have given rise to all"},{"type":"note","text":"sorts of confusion."},{"type":"note number","text":"8 "},{"type":"note","text":"During the Millennium there will be a population explosion. Since the government will be dictatorial, everyone"},{"type":"note","text":"will have to obey outwardly, but Satan will have no trouble raising an army of ‘dissidents’."},{"type":"note number","text":"9 "},{"type":"note","text":"The picture here is different from the battle of Armageddon—compare 19:21."},{"type":"UNKNOWN","text":"27"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"devil, who deceived them, was thrown into the Lake of Fire and brimstone, where the Beast"},{"type":"verse","text":"and the False prophet also are. And they will be tormented day and night forever and ever."},{"type":"header","text":"The Great White Throne"},{"type":"paragraph break"},{"type":"verse","text":"11 "},{"type":"paragraph break"},{"type":"verse","text":"Then I saw a tremendous white throne and the One who sat on it, from whose face"},{"type":"verse","text":"the earth and the sky fled away;"},{"type":"note reference","text":"1 "},{"type":"verse","text":"and no place was found for them. 12 And I saw the dead,"},{"type":"verse","text":"great and small, standing before the throne;"},{"type":"note reference","text":"2 "},{"type":"verse","text":"and books were opened. And another Book was"},{"type":"verse","text":"opened, namely, of Life. And the dead were judged according to their works, by the things"},{"type":"verse","text":"that were written in the books. 13 The ocean gave up the dead who were in it, and Death and"},{"type":"verse","text":"Hades gave up the dead who were in them;"},{"type":"note reference","text":"3 "},{"type":"verse","text":"and they were judged each one according to"},{"type":"verse","text":"their works."},{"type":"note reference","text":"4 "},{"type":"verse","text":"14 And Death and Hades were thrown into the Lake of Fire. This is the second"},{"type":"verse","text":"death, the Lake of Fire."},{"type":"note reference","text":"5 "},{"type":"verse","text":"15 And if anyone was not found written in the Book of Life he was"},{"type":"verse","text":"thrown into the Lake of Fire."},{"type":"note reference","text":"6"},{"type":"header","text":"New heaven, new earth"},{"type":"chapter number","text":"21"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"Now I saw a new heaven and a new earth, because the first heaven and the first"},{"type":"verse","text":"earth had passed away;"},{"type":"note reference","text":"7 "},{"type":"verse","text":"also, the ocean was no more."},{"type":"note reference","text":"8 "},{"type":"verse","text":"2 And I saw the holy city, New"},{"type":"verse","text":"Jerusalem, coming down out of heaven from God, prepared like a bride adorned for her"},{"type":"verse","text":"husband. 3 And I heard a loud voice from heaven saying: “Take note, the tabernacle of God is"},{"type":"verse","text":"with men and He will dwell with them, and they will be His people. Yes, God Himself will be"},{"type":"verse","text":"with them. 4 And He will wipe away every tear from their eyes; there will be no more death"},{"type":"verse","text":"nor sorrow nor crying nor pain"},{"type":"note reference","text":"9"},{"type":"verse","text":"—they will exist no more because the first things have gone.”"},{"type":"paragraph break"},{"type":"verse","text":"5 Then He who sat on the throne"},{"type":"paragraph break"},{"type":"note reference","text":"10 "},{"type":"paragraph break"},{"type":"verse","text":"said, “Take note, I make everything new!” And He"},{"type":"verse","text":"says to me, “Write, because these words are true and faithful!”"},{"type":"note reference","text":"11 "},{"type":"verse","text":"6 Then He said to me: “I"},{"type":"verse","text":"have become the Alpha and the Omega, the Beginning and the End."},{"type":"note reference","text":"12 "},{"type":"verse","text":"To the one who thirsts"},{"type":"verse","text":"I will give of the spring of the water of Life freely. 7 He who overcomes will inherit these"},{"type":"verse","text":"things, and I will be God to him and he will be a son to me. 8 But as for the cowardly"},{"type":"note reference","text":"13 "},{"type":"verse","text":"and"},{"type":"note number","text":"1 "},{"type":"note","text":"Doubtless the Face was full of wrath—at that point there will be absolutely no place to hide."},{"type":"note number","text":"2 "},{"type":"note","text":"Less than 10% of the Greek manuscripts read ‘God’ instead of “throne”, as in AV and NKJV."},{"type":"note number","text":"3 "},{"type":"note","text":"I confess that I don’t understand this; how can Death be holding dead that are not in Hades? Perhaps they are"},{"type":"note","text":"regarded as partners. But then, how can the ocean have a separate roster of dead?"},{"type":"note number","text":"4 "},{"type":"note","text":"Twice it says that they will be judged on the basis of their works. So how can you really evaluate someone’s"},{"type":"note","text":"deeds? Only by taking account of their context. Those who never heard the Gospel will be judged within the"},{"type":"note","text":"context that they lived, and the Judge will prove that even within their own context they did not measure up."},{"type":"note number","text":"5 "},{"type":"note","text":"The first death is the physical one; the second is the spiritual one—eternal separation from the Creator (the"},{"type":"note","text":"essence of death is separation). Death and Hades are treated as if they were living entities."},{"type":"note number","text":"6 "},{"type":"note","text":"That is right; since no one can be saved by their works, the only way out is the Book of Life!"},{"type":"note number","text":"7 "},{"type":"note","text":"“The first earth”, not the second, or whatever. This statement would seem to go against the ‘gap’ theory in"},{"type":"note","text":"Genesis 1:1."},{"type":"note number","text":"8 "},{"type":"note","text":"Apparently there will be no water in the new earth; I take it that our glorified bodies will require neither food"},{"type":"note","text":"nor drink (so there will be no body waste to dispose of)."},{"type":"note number","text":"9 "},{"type":"note","text":"Without the separation of death, without pain and sorrow, there will be no occasion for tears."},{"type":"note number","text":"10 "},{"type":"note","text":"Since the last throne mentioned is the Great White Throne, and since all judgment has been committed to the"},{"type":"note","text":"Son (John 5:22), I conclude that the speaker is Jehovah the Son."},{"type":"note number","text":"11 "},{"type":"note","text":"“These word"},{"type":"note","text":"s "},{"type":"note","text":"are true and faithful”—the guarantee extends to the individual words. If a word is true, then it"},{"type":"note","text":"cannot be false; if a word is faithful, then it cannot be designed to deceive us. Conclusion: the words of this"},{"type":"note","text":"book are to be taken at face value, according to the norms of language."},{"type":"note number","text":"12 "},{"type":"note","text":"“I have become”—this seems awkward, so a small minority of the Greek manuscripts changed it to the"},{"type":"note","text":"familiar ‘It is done’. But in order to be the Boss at both the beginning and the end, you have to be the greatest,"},{"type":"note","text":"and survive all challenges. All human history has been involved in Satan’s challenge of that supremacy."},{"type":"note","text":"Because of that challenge, and because only at this point has that challenge been definitively put down,"},{"type":"note","text":"Jehovah the Son says, “I have become”."},{"type":"note number","text":"13 "},{"type":"note","text":"Does it surprise you that “cowardly” is in this list? In Matthew 10:32-33 we read: “Everyone who will confess"},{"type":"note","text":"me before men, I will also confess him before my father who is in the heavens. But whoever should deny me"},{"type":"UNKNOWN","text":"28"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"unbelieving and sinners"},{"type":"note reference","text":"1 "},{"type":"verse","text":"and abominable and murderers and fornicators and sorcerers and"},{"type":"verse","text":"idolaters, and all who are false,"},{"type":"note reference","text":"2 "},{"type":"verse","text":"their portion is in the Lake that burns with fire and"},{"type":"verse","text":"brimstone, which is the second death.”"},{"type":"header","text":"The New Jerusalem"},{"type":"paragraph break"},{"type":"verse","text":"9 "},{"type":"paragraph break"},{"type":"verse","text":"Then"},{"type":"paragraph break"},{"type":"note reference","text":"3 "},{"type":"paragraph break"},{"type":"verse","text":"one of the seven angels who had the seven bowls full of the seven last"},{"type":"verse","text":"plagues came and spoke with me saying, “Come, I will show you the woman, the Lamb’s"},{"type":"verse","text":"bride”."},{"type":"note reference","text":"4 "},{"type":"verse","text":"10 So he transported me in spirit to a great and high mountain and showed me the"},{"type":"verse","text":"great city, the holy Jerusalem, coming down out of heaven from God, 11 having the splendor"},{"type":"verse","text":"of God. Her radiance was similar to a most precious stone, like a crystalline jasper stone;"},{"type":"verse","text":"12 she had a tremendous, high wall with twelve gates, and at the gates twelve angels, and"},{"type":"verse","text":"names inscribed, namely the twelve tribes of the sons of Israel; 13 "},{"type":"verse","text":"looking "},{"type":"verse","text":"from the east,"},{"type":"verse","text":"three gates, and from the north, three gates, and from the south, three gates, and from the"},{"type":"verse","text":"west, three gates. 14 And the wall of the city had twelve foundations, and on them twelve"},{"type":"verse","text":"names, of the twelve apostles of the Lamb."},{"type":"note reference","text":"5 "},{"type":"verse","text":"15 Now he who spoke with me had a measure, a"},{"type":"verse","text":"golden reed, so that he might measure the city and her gates."},{"type":"note reference","text":"6 "},{"type":"verse","text":"16 The city is laid out as a"},{"type":"verse","text":"square; that is, her length is equal to her width. So he measured the city with the reed at"},{"type":"verse","text":"twelve thousand and twelve stadia."},{"type":"note reference","text":"7 "},{"type":"verse","text":"Her length and width and height are equal."},{"type":"note reference","text":"8 "},{"type":"verse","text":"17 And he"},{"type":"note","text":"before men, I will also deny him before my Father who is in the heavens.” See also Luke 12:8-9 and 1 John"},{"type":"note","text":"2:23. Presumably the Lord is referring to our attitude in the face of opposition or persecution. Anyone who"},{"type":"note","text":"caves in under pressure and disowns the Lord is out."},{"type":"note number","text":"1 "},{"type":"note","text":"Both the TR and the so-called critical text omit “and sinners”, so most versions do as well, but two of the three"},{"type":"note","text":"main independent lines of transmission (including the best one) have the phrase."},{"type":"note number","text":"2 "},{"type":"note","text":"That is what the Text says; instead of the noun ‘liar’ we find the adjective “false” (all the preceding"},{"type":"note","text":"descriptions are nouns, with one participle = “abominable”)."},{"type":"note number","text":"3 "},{"type":"note","text":"Actually the Text has “and”—John saw the visions in this order, but they will not necessarily happen in this"},{"type":"note","text":"order. I imagine that the New Jerusalem belongs to the Millennium (for reasons I will give below)."},{"type":"note number","text":"4 "},{"type":"note","text":"It seems to me to be unarguable that both Israel (the gates) and the Church (the foundations) participate in"},{"type":"note","text":"the New Jerusalem. (In fact, I imagine that the redeemed of all ages, up to the beginning of the Millennium,"},{"type":"note","text":"will be involved.) The rendering, “the woman [or, wife], the Lamb’s bride”, is based on over half of the Greek"},{"type":"note","text":"manuscripts, two of the three main independent lines of transmission (including the best one). In Jeremiah"},{"type":"note","text":"3:20 and Hosea 2 Israel is presented as the wife of Jehovah—but in the O.T. wherever God interacts directly"},{"type":"note","text":"with the human race it is always Jehovah the Son. Passages like Matthew 25:10, John 3:29, 2 Corinthians 11:2"},{"type":"note","text":"and Ephesians 5:25-27, 31-32 point to the Church as the bride of Christ (who is Jehovah the Son). So here the"},{"type":"note","text":"two come together—the wife, the bride—but maintain a distinct identity (gates are one thing and foundations"},{"type":"note","text":"are another)—indeed, nowhere does the Bible ever confuse Israel and the Church (not even in Galatians 6:16,"},{"type":"note","text":"as I can demonstrate to anyone who wishes to pursue the matter). But if the Church is still a “bride”, then the"},{"type":"note","text":"wedding has not happened yet, which is my first reason for placing this scene at the beginning of the"},{"type":"note","text":"Millennium."},{"type":"note number","text":"5 "},{"type":"note","text":"I wonder, who replaces the Iscariot? Besides the Twelve, the only one who was personally chosen by Jesus was"},{"type":"note","text":"Saul of Tarsus."},{"type":"note number","text":"6 "},{"type":"note","text":"The evidence is badly divided here, but I take it that two of the three main independent lines of transmission"},{"type":"note","text":"(including the best one), do not add “and her wall”, which is read by most versions since both the TR and the"},{"type":"note","text":"so-called critical text so read. Two thousand years ago a city wall was a barrier to protect the city from attack,"},{"type":"note","text":"but the following context here makes clear that the wall was part of the structure. The city is a cube, like a"},{"type":"note","text":"modern high-rise, which is a recent concept in architecture. Many early copyists presumably assumed that the"},{"type":"note","text":"wall was distinct from the city and officiously altered the text. The angel measured precisely the city and her"},{"type":"note","text":"gates; see the next note."},{"type":"note number","text":"7 "},{"type":"note","text":"Over half of the Greek manuscripts, two of the three main independent lines of transmission (including the"},{"type":"note","text":"best one), read “and twelve”—a surprising bit of precise detail. But consider—12,000 stadia, twelve gates—if"},{"type":"note","text":"the gates are evenly spaced, as seems likely, we have a thousand stadia between gates; or is it 1,001 stadia? I"},{"type":"note","text":"will argue below that each gate was one stadium wide, which nicely explains the precise number, twelve"},{"type":"note","text":"thousand and twelve!"},{"type":"note number","text":"8 "},{"type":"note","text":"The city is a cube, the total measurement being about 1,350 miles! But does it mean the circumference or is it"},{"type":"note","text":"referring to the three dimensions? If it refers to the circumference we divide by four and each side is about"},{"type":"UNKNOWN","text":"29"},{"type":"UNKNOWN","text":"Revelation"},{"type":"verse","text":"measured her wall, one hundred and forty-four cubits,"},{"type":"note reference","text":"1 "},{"type":"verse","text":"the measure of a man (which is of an"},{"type":"verse","text":"angel)."},{"type":"note reference","text":"2 "},{"type":"verse","text":"18 The material of her wall was jasper,"},{"type":"note reference","text":"3 "},{"type":"verse","text":"and the city was pure gold, like clear glass."},{"type":"verse","text":"19 And the foundations of the wall of the city were adorned with all kinds of precious stones:"},{"type":"verse","text":"the first foundation "},{"type":"verse","text":"had "},{"type":"verse","text":"jasper, the second sapphire, the third chalcedony, the fourth"},{"type":"verse","text":"emerald, 20 the fifth sardonyx, the sixth carnelian, the seventh chrysolite, the eighth beryl,"},{"type":"verse","text":"the ninth topaz, the tenth chrysoprase, the eleventh jacinth, the twelfth amethyst."},{"type":"note reference","text":"4 "},{"type":"verse","text":"21 And"},{"type":"verse","text":"the twelve gates are twelve pearls; each individual gate was "},{"type":"verse","text":"composed "},{"type":"verse","text":"of one pearl."},{"type":"note reference","text":"5 "},{"type":"verse","text":"And the"},{"type":"verse","text":"street of the city was pure gold, like transparent glass."},{"type":"note reference","text":"6"},{"type":"header","text":"Her glory"},{"type":"paragraph break"},{"type":"verse","text":"22 "},{"type":"paragraph break"},{"type":"verse","text":"I saw no sanctuary in her, because the Lord God, the Almighty, and the Lamb are"},{"type":"verse","text":"her sanctuary. 23 And the city has no need of the sun or the moon, that they should shine on"},{"type":"verse","text":"her, because the very glory of God illumines her, and the Lamb is her light. 24 And the"},{"type":"verse","text":"nations will walk in her light, and the kings of the earth"},{"type":"note reference","text":"7 "},{"type":"verse","text":"bring their glory and honor into her."},{"type":"verse","text":"25 Her gates will absolutely not be closed by day (and no night will exist there). 26 And they"},{"type":"verse","text":"will bring the glory and the honor of the nations into her. 27 But anything ‘common’"},{"type":"note reference","text":"8 "},{"type":"verse","text":"or"},{"type":"verse","text":"anyone perpetrating an abomination or a lie will absolutely not enter her;"},{"type":"note reference","text":"9 "},{"type":"verse","text":"only those who"},{"type":"verse","text":"are written in the Lamb’s Book of Life."},{"type":"note reference","text":"10"},{"type":"header","text":"Her river"},{"type":"note","text":"340 miles long, and of course the height is also 340 miles. If we divide by three each dimension is about 450"},{"type":"note","text":"miles. In either event, we have one incredibly large city! But because of the twelve gates and 12,000 stadia I"},{"type":"note","text":"really believe that the angel measured the circumference."},{"type":"note number","text":"1 "},{"type":"note","text":"That is about 70 yards; since we already know that the wall is hundreds of miles high, the reference here must"},{"type":"note","text":"be to the thickness of the wall. I take it that the wall was part of the structure, like in a modern high-rise, not"},{"type":"note","text":"like a fence (with no enemies there is no need for a fence—in fact, verse 25 makes clear that even the gates"},{"type":"note","text":"will never be closed)."},{"type":"note number","text":"2 "},{"type":"note","text":"This is curious; apparently angels use the same measurement as humans. But then, with reference to things on"},{"type":"note","text":"this earth, why wouldn’t they?"},{"type":"note number","text":"3 "},{"type":"note","text":"See verse 11 above."},{"type":"note number","text":"4 "},{"type":"note","text":"Each foundation was adorned with a different kind of stone. But how were the twelve foundations arranged,"},{"type":"note","text":"piled up or side by side? Presumably the gates were evenly spaced, with 1,000 stadia between each pair, so"},{"type":"note","text":"perhaps each such space represented an Apostle and had a different precious stone."},{"type":"note number","text":"5 "},{"type":"note","text":"Are not doors and gates usually wider than the wall is thick? The wall here is some 70 yards thick. I propose"},{"type":"note","text":"that each pearl was 200 yards (one stadium) wide (some pearl!), but notice in verse 25 that the gates were"},{"type":"note","text":"never closed, which means that they always remained in one position, hence no wear and tear on the ‘hinges’."},{"type":"note","text":"But imagine that we are on that tremendously high mountain with John, and that we are perpendicular to the"},{"type":"note","text":"middle of one wall and at a distance of 50 miles. We are looking at a monstrous wall 340 miles square; it"},{"type":"note","text":"merely fills the horizon. At the base of the wall, evenly spaced (some 110 miles between them), are three"},{"type":"note","text":"gates. Would a gate 200 yards wide be out of proportion? Given the size of the wall, such gates might even"},{"type":"note","text":"seem small!"},{"type":"note number","text":"6 "},{"type":"note","text":"The ‘gold’ here is evidently different from the gold we know; John does not say that it looked like gold, he says"},{"type":"note","text":"it was gold."},{"type":"note number","text":"7 "},{"type":"note","text":"“Kings of the earth”—we are still on the earth, with kings and nations coming and going, which is my second"},{"type":"note","text":"reason for placing the New Jerusalem during the Millennium."},{"type":"note number","text":"8 "},{"type":"note","text":"That is, defiled or profane; perhaps anything not consecrated to God."},{"type":"note number","text":"9 "},{"type":"note","text":"Connecting this statement with 22:15, we have all sorts of nasty people outside the city. After the Millennium"},{"type":"note","text":"and the Great White Throne they will be in the Lake of fire, so if they are still circulating on this earth, it must"},{"type":"note","text":"be during the Millennium, which is my third reason. Because of 22:15 I am inclined to suppose that the New"},{"type":"note","text":"Jerusalem will rest on the earth (not be a satellite, as some argue). But if so, where? The desert east of Jordan"},{"type":"note","text":"is hundreds of miles square with very few inhabitants, and relatively plane, yet quite close to the present"},{"type":"note","text":"Jerusalem. Perhaps there."},{"type":"note number","text":"10 "},{"type":"note","text":"So why else did you think there was an angel stationed at each gate (21:12)?"},{"type":"UNKNOWN","text":"30"},{"type":"UNKNOWN","text":"Revelation"},{"type":"chapter number","text":"22"},{"type":"paragraph break"},{"type":"verse","text":":1 "},{"type":"paragraph break"},{"type":"verse","text":"And he showed me a pure river of water of life,"},{"type":"paragraph break"},{"type":"note reference","text":"1 "},{"type":"paragraph break"},{"type":"verse","text":"bright as crystal, proceeding"},{"type":"verse","text":"from the throne of God and of the Lamb, 2 in the middle of her street. And on either side of"},{"type":"verse","text":"the river was a tree of life producing twelve fruits, yielding each month’s fruit monthly; and"},{"type":"verse","text":"the leaves of the tree are for the healing of the nations. 3 There will be no accursed thing"},{"type":"verse","text":"there, but the throne of God and of the Lamb are in her, and His slaves will minister to Him."},{"type":"verse","text":"4 They will see His face and His name is on their foreheads. 5 Night will not exist there and"},{"type":"verse","text":"they will need neither lamp nor sunlight, because the Lord God illuminates them. And they"},{"type":"verse","text":"will reign forever and ever."},{"type":"header","text":"Conclusion"},{"type":"chapter number","text":"22"},{"type":"verse","text":":6 "},{"type":"verse","text":"Then He says to me: “These words are faithful and true. The Lord God of the spirits"},{"type":"note reference","text":"2 "},{"type":"verse","text":"of"},{"type":"verse","text":"the prophets sent His angel to show to His slaves the things that must shortly take place."},{"type":"note reference","text":"3"},{"type":"verse","text":"7 Take note, I am coming swiftly! Blessed is the one who keeps the words of the prophecy of"},{"type":"verse","text":"this book.”"},{"type":"note reference","text":"4"},{"type":"paragraph break"},{"type":"verse","text":"8 Now I, John, who heard and saw these things, when I had heard and seen I fell down"},{"type":"verse","text":"to worship at the feet of the angel who showed me these things, 9 but he says to me: “Don’t!"},{"type":"verse","text":"I am your fellow slave and of your brothers the prophets, those who keep the words of this"},{"type":"verse","text":"book. Worship God!”"},{"type":"note reference","text":"5 "},{"type":"verse","text":"10 Then he says to me: “Do not seal the words of the prophecy of this"},{"type":"verse","text":"book, for the time is near. 11 He who acts unjustly let him act unjustly still, and let the filthy"},{"type":"verse","text":"one be filthy still, and let the righteous one still practice righteousness, and let the holy one"},{"type":"verse","text":"still be sanctified.”"},{"type":"header","text":"Jesus’ final word"},{"type":"paragraph break"},{"type":"verse","text":"12 "},{"type":"paragraph break"},{"type":"verse","text":"“Take note, I am coming swiftly, and my reward is with me to give to each one"},{"type":"verse","text":"according to his work. 13 I am the Alpha and the Omega, beginning and end, the First and the"},{"type":"verse","text":"Last.” 14 (Blessed are those who do His commands, so that they may have the right to the"},{"type":"verse","text":"tree of life, even to enter through the gates into the city. 15 Outside are the ‘dogs’"},{"type":"note reference","text":"6 "},{"type":"verse","text":"and the"},{"type":"verse","text":"sorcerers and the fornicators and the murderers and the idolaters,"},{"type":"note reference","text":"7 "},{"type":"verse","text":"and everyone who loves"},{"type":"verse","text":"and practices a lie.) 16 “I, Jesus, have sent my angel to testify these things to you, in the"},{"type":"verse","text":"churches. I am the Root and the Offspring of David, the bright morning Star. 17 Both the"},{"type":"verse","text":"Spirit and the Bride say, ‘Come!’ And let whoever hears say, ‘Come!’ And let whoever thirsts"},{"type":"verse","text":"come; whoever wants to, let him take the water of life free of charge."},{"type":"header","text":"A serious warning"},{"type":"note number","text":"1 "},{"type":"note","text":"This river should not be confused with the one in Ezekiel 47. The present city of Jerusalem will still exist and"},{"type":"note","text":"function during the Millennium. The two rivers share certain characteristics, but are also quite different."},{"type":"note","text":"Zechariah 14:8 may well have to do with Ezekiel 47."},{"type":"note number","text":"2 "},{"type":"note","text":"Two of the three main independent lines of transmission (including the best one) have “of the spirits”. The"},{"type":"note","text":"familiar ‘the holy’ of the KJV is based on the third main line."},{"type":"note number","text":"3 "},{"type":"note","text":"This is a restatement of 1:1."},{"type":"note number","text":"4 "},{"type":"note","text":"Here Jesus Christ speaks (and so in verses 12, 16 and 18); see 1:3."},{"type":"note number","text":"5 "},{"type":"note","text":"I wonder if John was not always sure who was a real angel and who was the Son, appearing as an angel, and so"},{"type":"note","text":"just to make sure, . . ."},{"type":"note number","text":"6 "},{"type":"note","text":"So who are the ‘dogs’? In Deuteronomy 23:18 ‘dog’ apparently refers to a male prostitute, a catamite, and is"},{"type":"note","text":"declared to be an abomination. In O.T. times dogs were scavengers and therefore unclean, and were generally"},{"type":"note","text":"looked down upon. In Jesus’ day Jews referred to Gentiles as ‘dogs’, but since many Gentiles are in the Church"},{"type":"note","text":"that is presumably not the intended meaning here. The ‘dogs’ in Matthew 7:6 react in an aggressively hostile"},{"type":"note","text":"manner against what is holy; I take it that they are people who are overtly serving evil (Philippians 3:2 may be"},{"type":"note","text":"referring to this sort of person). So who are the ‘dogs’ here? At the very least they are the unclean. Take it"},{"type":"note","text":"from there."},{"type":"note number","text":"7 "},{"type":"note","text":"Relativism is an idol; Humanism is an idol; Materialism is an idol. One wonders how many Christians today"},{"type":"note","text":"have a worldview that is really Biblical. The world’s values are not compatible with Christ’s values. Don’t forget"},{"type":"note","text":"1 John 2:15-16!"},{"type":"UNKNOWN","text":"31"},{"type":"UNKNOWN","text":"Revelation"},{"type":"paragraph break"},{"type":"verse","text":"18 "},{"type":"paragraph break"},{"type":"verse","text":"“I myself testify to everyone who hears the words of the prophecy of this book: If"},{"type":"verse","text":"any one adds to them, may God add to him the seven plagues written in this book!"},{"type":"note reference","text":"1 "},{"type":"verse","text":"19 And if"},{"type":"verse","text":"anyone takes away from the word"},{"type":"verse","text":"s"},{"type":"note reference","text":"2 "},{"type":"verse","text":"of the book of this prophecy, may God remove his share"},{"type":"verse","text":"from the tree of life and out of the Holy City, that stand written in this book!”"},{"type":"header","text":"John signs off"},{"type":"paragraph break"},{"type":"verse","text":"20 "},{"type":"paragraph break"},{"type":"verse","text":"He who testifies to these things says, “Yes, I am coming swiftly!” Oh yes!! Come,"},{"type":"verse","text":"Sovereign Jesus! 21 The grace of the Lord Jesus Christ"},{"type":"note reference","text":"3 "},{"type":"verse","text":"be with all the saints. Amen."},{"type":"note number","text":"1 "},{"type":"note","text":"Since God the Son is speaking, I imagine that what He wants will be done!"},{"type":"note number","text":"2 "},{"type":"note","text":"“Words”, plural, includes the individual words that make up the whole. Those textual critics who have"},{"type":"note","text":"wantonly removed words from the Text, on the basis of satanically inspired presuppositions, are out. Those"},{"type":"note","text":"who interpret the Text in such a way as to avoid its plain meaning, likewise. Jehovah the Son affirms that the"},{"type":"note","text":"words are “true and "},{"type":"note","text":"faithful"},{"type":"note","text":"”, and He expects us to interpret them that way."},{"type":"note number","text":"3 "},{"type":"note","text":"“The Lord Jesus Christ” is now the full name or title of Jehovah the Son."},{"type":"UNKNOWN","text":"32"}]